
[
    {
         "date": "August 1",
        "title": "OH COME, LET US WORSHIP OUR GOD",
        "scriptures": [
            "1 Chronicles 16:23-36"
        ],
        "anchor_passage": "Sing unto the LORD, all the earth; show forth from day to day his salvation. Declare his glory among the heathen, his marvellous works among all nations. For great is the Lor, and greatly to be praised: He is also to be feared above all gods. Glory and honour are in his presence; strength and gladness are in his place. Give unto the LORD, ye kindreds of the people, give unto the LORD glory and strength. Give unto the LORD the glory due unto his name: bring an offering and come before him: worship the LORD in the beauty of holiness…O give thanks unto the LORD; for he is good; for his mercy endures forever. Blessed be the LORD God of Israel forever and ever. And all the people said, Amen, and praised the LORD. 1Chronicles 16:23-36 “I will bless the LORD at all times: his praise shall continually be in my mouth. My soul shall make her boast in the LORD: the humble shall hear thereof, and be glad. O magnify the LORD with me, and let us exalt his name together",
        "Discussion_title": "",
        "prayer_foci": [
            {
                "title": "Worship the Lord our maker for who He is in our lives and in MIV",
                  "scriptures": [
                ]
              
            },
            {
                "title": "Worship Him because He is great and greatly to be praised, He is glorious in holiness and fearful in praise; there is none like unto Him",
                "scriptures": [
                    "1 Chronicles 16:23-36"
                ]
            },
            {
                "title": "Make a joyful noise unto the Lord our Maker, our strength, our defence, the covenant keeping God, our ALL IN ALL, for He has been mighty in MIV as a whole; we hail you our God!!!",
                "scriptures": [
                    "1 Chronicles 16:23-36"
                ]
            },
            {
                "title": "Father, great is your faithfulness unto us in the last one year as individuals and as a ministry; You are worthy to be praised",
                "scriptures": [
                    "Deuteronomy 7:8-9",
                    "Numbers 23:19",
                    "Lamentation 3:22-23"
                ]
            },
            {
                "title": "Father, we thank you because you always hear us on this August altar as we make a covenant with you by sacrifice; thank you for allowing us to draw near, thank you for the great and mighty things you will show us",
                "scriptures": [
                    "Psalms 50:1",
                    "Psalms 65:4",
                    "Jeremiah 33:3"
                ]
            },
            {
                "title": "Celebrate the Holy Spirit our standby Helper; the spirit of grace and supplications; ask Him to help us in this month of prevailing prayers",
                "scriptures": [
                    "Romans 8:26-27",
                    "Zechariah 12:10",
                    "Ephesians 6:18"
                ]
            },
            {
                "title": "Father, let the fallow ground of my heart be broken, that I may truly seek you and find you this month; I receive the enablement of the Spirit for earnest, continued and resultful prayers and intercession this month in Jesus’s nam",
                "scriptures": [
                    "Hosea 10:12",
                    "James 5:16-19"
                ]
            },
            {
                "title": "Thank you, father, for putting an end to every storm in our lives and all around us today",
                  "scriptures": [
                ]
             
            },
            {
                "title": "Worship and sing in the Spirit",
                  "scriptures": [
                ]
            }
        ]
    },

    
    {
         "date": "August 2",
        "title": "GIVING THANKS.",
        "scriptures": [
            "Isaiah 65:24"
        ],
        "anchor_passage": "Make a joyful noise unto the LORD, all ye lands. Serve the LORD with gladness: come before his presence with singing. Know ye that the LORD he is God: it is He that hath made us, and not we ourselves; we are His people, and the sheep of his pasture. Enter into his gates with thanksgiving, and into his courts with praise: be thankful unto him, and bless his name.\n\nFor the LORD is good; his mercy is everlasting; and his truth endures to all generations. Psalms 100:1-5. Rejoice evermore. Pray without ceasing. In everything give thanks: for this is the will of God in Christ Jesus concerning you. Quench not the Spirit. 1 Thess 5:16-19 And it shall come to pass, that before they call, I will answer; and while they are yet speaking, I will hear. Isaiah 65:24",
        "Discussion_title": "",
        "prayer_foci": [
            {
                "title": "Ancient of days we adore you for another opportunity to see this month and for the grace to call upon you with the confidence that before we call you have answered. Thank you for drawing us into your very presence",
                "scriptures": [
                   
                ]
            },
            {
                "title": "What a mighty God you are! You are reliable, dependable, same yesterday same forever, thank you for your mercies and goodness by which you have preserved us to see this month of great encounter, we adore you.",
                "scriptures": [
                    "Psalms 136:1-26"
                ]
            },
            {
                "title": "Father, we thank you for your abiding presence with us as a ministry, for giving us outstanding testimonies of your faithfulness, for fighting our battles, for giving us victories over every raging of the devil and defending us all sides. Faithful are you, Lord!",
                "scriptures": [
                    "Psalms 59:16 ",
                    "Psalms 107:1-9 "
                ]
            },
            {
                "title": "Thank you, father, for forgiving our sins, healing us of every disease, and for preserving our lives and ministry from the evil one.",
                "scriptures": [
                    "Psalms 103:1-5"
                ]
            },
            {
                "title": "We appreciate your goodness, blessings, mercies and your manifold grace upon us, our families and MIV as a whole",
                "scriptures": [
                    "Lamentations 3:22-26",
                   "2 Corinthians 12:9"
                ]
            },
            {
                "title": "Give Him all glory for great deliverances, salvations, healings, victories, re-awakenings, miracles, and multifarious activities of the Holy Spirit among us. To Him be all glory",
                "scriptures": [
                    "Isaiah 42:8",
                    "Revelation 4:11"
                ]
            },
            {
                "title": "We ascribe greatness unto you our God for working in us both to will and to do of your good pleasure. You are worthy of all our praises",
                  "scriptures": [
                ]
               
            },
            {
                "title": "We hallow your name and lift you high again in this month because we know that your name will answer for us again; how is excellent is your name in all the earth",
                "scriptures": [
                    "Psalms 8:1-3"
                ]
            },
            {
                "title": "Father, we have confidence in you that you will show us your mercy this weekend as we gather for the Alone with God; glorify yourself in our midst and let no one be left out",
                  "scriptures": [
                ]
            }
        ]
    },

  {
        "date": "August 3",
       "title": "A NEW CONSECRATION FOR NEW ENCOUNTERS",
       "scriptures": [
           "Matthew 9:15-17","Hebrews 10:20-21 "
       ],
       "anchor_passage": "And Jesus said to them, Can the sons of the bride chamber mourn as long as the bridegroom is with them? But the days will come …and then they shall fast. No one puts a piece of new cloth onto an old garment; for that which is put in to fill it up takes from the garment, and the tear is made worse. Nor do men put new wine into old wineskins; else the wineskins burst, and the wine runs out, and the wineskins perish. But they put new wine into new wineskins, and both are preserved together” Matthew 9:15-17 \n\n“That every one of you should know how to possess his vessel in sanctification and honour, not in the lust of concupiscence, even as the Gentiles which know not God…For God hath not called us unto uncleanness, but unto holiness” I Thess 4:4-7 “… and having a High Priest over the house of God, let us draw near with a true heart in full assurance of faith, having our hearts sprinkled from an evil conscience and our bodies having been washed with pure water. Hebrews 10:20-21 ",
       "Discussion_title": "",
       "prayer_foci": [
           {
               "title": "Father, I thank you for the sacrifice of your son, and for the blood of Jesus Christ that cleanses us from all sin",
               "scriptures": [
                "1 Peter 1:18-19", 
                "1 John 1:7"
                  
               ]
           },
           {
               "title": "Father, we have come to repent of every evil we have committed, please forgive us for forsaking you, for refusing to seek you as we ought, for hewing for ourselves broken cistern, Lord we are sorry, please forgive us for betraying your trust, for grieving your spirit",
               "scriptures": [
                   "Jeremiah 2:13",
                   "Psalms 14:2-3"
               ]
           },
           {
               "title": "Father, I lay my life on your altar afresh, search me afresh and point out everything that cannot endure your fire; make me clean within and without from today; make my life to be a living sacrifice unto you henceforth; always dead to the flesh and ever yielded to your Spirit.",
               "scriptures": [
                   "Psalms 51:1-17",
                   "Romans 12:1-2",
                   "Romans 6:11-13"
                   
               ]
           },
           {
               "title": "Father, cause Christ to increase in me continually, as your power work in me to live the crucified life and manifest the true nature of Christ in all situations.",
               "scriptures": [
                   "John 3:30",
                   "Galatians 2:20"
               ]
           },
           {
               "title": "Father, give me grace for an ever-increasing brokenness, humility, obedience and a life of awe for you, so that I can continually attract answers to prayers.",
               "scriptures": [
                   "Hebrews 5:7-9",
                   "Isaiah 66:2"
               ]
           },
           {
               "title": "Father, cause me to continually find grace in your sight and live above sin despite the increasing iniquities of these last days",
               "scriptures": [
                   "Genesis 6:5-8",
                   "1 Chronicles 15:10"
               ]
           },
           {
               "title": "Father, grant me grace and wisdom to continually present my vessel (spirit, soul, and body) in sanctification and honour,living clean from every filthiness of the flesh and the spirit.",
                 "scriptures": [
                    "I Thess 4:4-7",
                    "2 Corinthians 7:11"
               ]
              
           },
           {
               "title": "Father, grant me the understanding of the consecration that is expected of me for new encounters with you, and to continually be a flaming believer, shinning for you till the end of my sojourn on earth.",
               "scriptures": [
                   "Hebrews 1:7",
                   "John 5:35"
               ]
           },
           {
               "title": "Father, in this month, launch me into a season of new spiritual experiences and realities that will usher me into a deeper knowledge of you and greater exploits in the kingdom. ",
                 "scriptures": [
                    "Philippians 3:10",
                    "Exodus 33:11-23",
                    "Daniel 11:32"
               ]
           }
       ]
   },

   {
    "date": "August 4",
   "title": "TEACH ME TO PRAY LIKE JESUS",
   "scriptures": [
       "Luke 18:1-8","Hebrews 5:6-7"
   ],
   "anchor_passage": "And he spoke a parable unto them to this end, that men ought always to pray, and not to faint….And shall not God avenge his own elect, which cry day and night unto him, though he bear long with them? I tell you that he will avenge them speedily. Nevertheless when the Son of man cometh, shall he find faith on the earth? Luke 18:1-8 “As He says also in another place, You are a priest forever after the order of Melchizedek. For Jesus, in the days of His flesh, when He had offered up prayers and supplications with strong cryings and tears to Him who was able to save Him from death, and was heard in that He feared, Heb 5:6-7 ",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Father, thank you for the privilege to come to your very presence and to partner with you in bringing about earthly permission for heavenly interference in the affairs of men, so that your will is perpetually done on earth as it is in heaven.",
           "scriptures": [
              "Matthew 6:9-10",
              "1Cor 3:9-10"
           ]
       },
       {
           "title": "Father please help me to understand my helplessness without you, so that I can pray without ceasing. Father, establish the spirit of prayer in my heart irrevocably, and teach me to pray like Jesus prayed.",
           "scriptures": [
               "Romans 8:26",
               "Psalms 103:7",
               "Hebrews 5:6-7"
           ]
       },
       {
           "title": "Father, I am tired of a life of lukewarmness, faithlessness, prayerlessness and fainting instead of living; fire me up by the spirit of prayer in this month so that I can become a man of prayer with flames in Jesus name.",
           "scriptures": [
               "Luke 18:1-8",
               "Hebrews 1:7"
               
           ]
       },
       {
           "title": "Father, baptise me and everyone in MIVwith your spirit of grace and supplication, so that I can partner with you in a life of continual intercession until your glory fill the earth as water covers the sea",
           "scriptures": [
               "Zechariah 12:10",
               "Habakuk 2:14"
           ]
       },
       {
           "title": "Father, plant a living faith in my heart, to persevere in supplication and intercession until Zion become a praise on the earth, and until all my petitions become manifested in Jesus name.",
           "scriptures": [
               "Luke 18:1-8",
               "Hebrews 11:6"
           ]
       },
       {
           "title": "Father in this month, reward my secret labours of prayers and intercession with undeniable testimonies of your mighty works in my life and ministry; show me great and mighty things beyond my asking or thinking in Jesus’s name.",
           "scriptures": [
               "Mathew 6:6",
               "Mathew 6:16-18",
               "John 14:10-11",
               "Jeremiah 33:3"
           ]
       },
       {
           "title": "Sweet Holy Spirit, empower us to pray with authority, to pray with faith, and to seek you diligently and patiently with unmovable expectation. ",
             "scriptures": [
                "Luke 11:1-13",
                "Mark 11:22-24"
           ]
          
       },
       {
           "title": "Worship and pray in the Spirit, and with understanding, asking the Lor to light your candle and quicken your spiritual senses and for the ability to become men of prayer. ",
           "scriptures": [
               "1 Corinthians 14:15",
               "Proverbs 20:27",
               "John 4:23-24"
           ]
       }
      
   ]
},

{
    "date": "August 5",
   "title": "IN THE DAYS OF YOUR POWER",
   "scriptures": [
       "Psalms 110:1-3"
   ],
   "anchor_passage": "The LORD said unto my Lord, Sit thou at my right hand, until I make thine enemies thy footstool. The LORD shall send the rod of thy strength out of Zion: rule thou in the midst of thine enemies. Thy people shall be willing in the day of thy power, in the beauties of holiness from the womb of the morning: thou hast the dew of thy youth",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Take time to sing and pray in the spirit as you approach God today with a heart of thanksgiving. ",
           "scriptures": [
              "1 Corinthians 14:15"
           ]
       },
       {
           "title": "Father thank you for the dimension of your power and glory I have experienced in my life so far. Father, it is not enough, let your power be activated in my life in this month to bring about greater works than I can ever ask or imagine. ",
           "scriptures": [
               "Luke 4:14",
               "Acts 10:38",
               "Ephesians 3:20"
           ]
       },
       {
           "title": "Father, in this month, launch me to a new experience of your power that will enable me to subdue the earth and rule over every work of the adversary.",
           "scriptures": [
               "Psalms 110:1-3",
               "Psalms 66:3"
               
           ]
       },
       {
           "title": "From today I take my rightful place, seated with Christ in heavenly place and wielding the authority of the kingdom effectively over the territory you have planted in Jesus name.",
           "scriptures": [
               "Psalms 110:1-3",
               "Ephesians 2:6",
               "Ephesians 1:20-22"
           ]
       },
       {
           "title": "Father, let the days of your power begin in my life and let it be evident as you empower me to do what Jesus did and do greater works. ",
           "scriptures": [
               "Luke 4:14-15",
               "John 14:12"
           ]
       },
       {
           "title": "Father, we welcome the days of your power in MIV, that will command multiplication of willing labourers and a great harvest of souls in every field of our reawakening and mission efforts in Jesus’s name. ",
           "scriptures": [
               "Psalms 110:1-3",
               "1 Chronicles 12:32"
           ]
       },
       {
           "title": "Father, as your church, we need the greater manifestation of your power than never, to silence every contention of hell and bring the gentile and kings to the knowledge of Christ. ",
             "scriptures": [
                "Isaiah 60:1-3",
                "Psalms 66:3",
                "Isaiah 64:1-2"
           ]
          
       },
       {
           "title": "Father, give us grace to sustain a purity, holiness, brokenness, humility and hunger that will cause us to experience the fullness of your power in our lives and ministry in Jesus’s name. ",
           "scriptures": [
               "Psalms 110:1-3",
               "Ecclesiastes 9:8"
           ]
       },
       {
           "title": "Ask the Lord to teach the church in Nigeria the right way to pray to bring about National transformation and the entrenchment of godly values in the day to day running of our nation. Father, let the true power of the salt be felt in our nation. ",
             "scriptures": ["Matthew 5:13-14"
           ]
       },
       {
        "title": "Ask God to give us wisdom to terminate the cycle of bad leadership in Jesus name.",
          "scriptures": [
        ]
    }
   ]
},

{
    "date": "August 6",
   "title": "BECOMING A BURNING AND SHINING LIGHT",
   "scriptures": [
       "Isaiah 62:1-3"
   ],
   "anchor_passage": "Because I love Zion, I will not keep still. Because my heart yearns for Jerusalem, I cannot remain silent. I will not stop praying for her until her righteousness shines like the dawn, and her salvation blazes like a burning torch. The nations will see your righteousness. World leaders will be blinded by your glory. And you will be given a new name by the Lord's own mouth.  The Lord will hold you in his hand for all to see—a splendid crown in the hand of God",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Lord, we thank you for your love and your choice of us even in our frailties, help us to love your people as well, just as Christ has loved us.",
           "scriptures": [
              
           ]
       },
       {
           "title": "Father, deliver me from every complacency and lukewarmness, let my love for you remain hot. We refuse to sit at ease in Zionin these last days. ",
           "scriptures": [
               "Revelation 3:15-19",
               "Amos 6:1"
           ]
       },
       {
           "title": "Father, help us not to be passive or complacent about your people, help our hearts to continually yearn for your fold. Make me a dependable watchman in your house and in my territory.",
           "scriptures": [
               "Genesis 18:17-19"
               
           ]
       },
       {
           "title": "Give us a heart that will not stop praying until your church become a praise and your will is established on earth as it is in heaven.",
           "scriptures": [
               "Isaiah 62:1-5"
           ]
       },
       {
           "title": "Lord, cause your righteousness to shine as dawn, let the lives of your children awaken men from the slumber of darkness. Let your light begin to grow in the lives of your people even in this dark age.Let your glory rise upon us. ",
           "scriptures": [
               "Isaiah 60:1-3"
           ]
       },
       {
           "title": "Father, let salvation blaze as a burning and contagious torch to our world, let it be that salvation becomes visible and contractable to those we come in contact with.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Father, as you work in our lives, let righteousness be visible in our lives, so visible for world leaders to notice, Let the quality of our lives be unmissable in our world.",
             "scriptures": [
           ]
          
       },
       {
           "title": "Lord, let your mouth pronounce a new name over the lives of your people, that as Jesus was announced as your Son, so we will be to our world.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Father, perpetually hold us in your hands, never let us go out of your grip, even when we try to fall by ourselves, let it be that your hand will always be present all the days of our lives. Let your mercy preserve us in your will to the end. ",
            "scriptures": [
                "2 Samuel 7:14-15"
           ]
       },
       {
        "title": "Lord, that splendid crown that you are forming with our lives will always return glory back to you, our relevance will always be in the context of you, our meaning and success will always be defined by you, in the name of Jesus.",
        "scriptures": [
            "Colossians 1:16-18"
          ]
       },
 
    {
          "title": "Cry out for mercy over your life and family; mercy and grace not to burn out. Pray for the salvation of every member of your nuclear and extended family.",
          "scriptures": [
            "Joshua 24:15"
        ]
    }
   ]
},

{
    "date": "August 7",
   "title": "PRAYER FOR THE PRESIDENT AND VICE PRESIDENT OF MIV INC",
   "scriptures": [
       "2 Thessalonians 3:1-9"
   ],
   "anchor_passage": "Finally, brethren, pray for us, that the word of the Lord may have free course, and be glorified, even as it is with you: And that we may be delivered from unreasonable and wicked men: for all men have not faith. But the Lord is faithful, who shall stablish you, and keep you from evil….For yourselves know how ye ought to follow us: for we behaved not ourselves disorderly among you; Neither did we eat any man's bread for nought; but wrought with labour and travail night and day, that we might not be chargeable to any of you: Not because we have not power, but to make ourselves an ensample unto you to follow us.",
   "Discussion_title": "Revd. Samson and Revd. (Mrs) Stellamaris Ajetomobi",
   "prayer_foci": [
       {
           "title": "Heavenly Father we thank you for preserving the lives and family of our Rev & Rev MrsAjetomobi. Thank you for the call and thank you for upholding them continually by your right hand.",
           "scriptures": [
              "Romans 1:5"
           ]
       },
       {
           "title": "Thank you, Father, for establishing them in the apostolic call with infallible proofs in the body of Christ among the nations of the earth. Thank you for your continual hedge of fire around them. ",
           "scriptures": [
               "Zechariah 2:5"
           ]
       },
       {
           "title": "Heavenly Father we pray that you strengthen with might by your spirit in the inner man; please, prune and renew them greatly in this month for them to bear more fruits in your kingdom. ",
           "scriptures": [
               "Isaiah 40:28-30",
               "John 15:2"
               
           ]
       },
       {
           "title": "Father, we ask that you strengthen them than before on the altar of prayer; baptize them afresh with the spirit of grace and supplication; please uphold them continually by your right hands. ",
           "scriptures": [
               "Hosea 12:10",
               "Hebrews 5:7",
               "Isaiah 42:1-4"
           ]
       },
       {
           "title": "Father, cause your grace to be multiplied unto your servants to keep the faith, and finish strong in life and ministry. Let every human weakness give way for your strength, power and glory to continually be made manifest. ",
           "scriptures": [
               "1 Corinthians 15:10",
               "2 Corinthians 12:8-10"
           ]
       },
       {
           "title": "In the name of Jesus, we resist the devil concerning Rev & Rev MrsAjetomobi, their family and ministry; we decree every weapon fashioned against them shall continually fail. Father, keep them from all evil and deliver them always. ",
           "scriptures": [
               "Isaiah 54:17"
           ]
       },
       {
           "title": "Father, answer all their prayers over any area of concern, and desires in their hearts in this month. Step in suddenly Lord and give them new songs to sing. ",
             "scriptures": [
                "Psalms 20:4"
           ]
          
       },
       {
           "title": "Father, open more doors of ministry unto them among the unreached groups, and confirm your words with signs following in all their engagements",
           "scriptures": [
               "Acts 16:9-12",
               "Acts 6:8"
           ]
       },
       {
           "title": "Father, cause them to continue to be the custodian of your secrets and oracle; may they remain relevant in your purpose on earth. ",
             "scriptures": [
                "Psalms 25:14",
                "Amos 3:7"
           ]
       },
       {
            "title": "Father, cause your servants to continue to enjoy the favour of hearing your voice clearly, understanding the time and knowing what you will have them do ",
            "scriptures": [
                "1 Chronicles 12:32",
                "John 5:30"
            ]
    }
   ]
},

{
    "date": "August 8",
   "title": "PRAYER FOR THE PRESIDENT, VICE PRESIDENT OF MIV INC AND THE FAMILY",
   "scriptures": [
       "Numbers 25:10-13"
   ],
   "anchor_passage": "And the LORD spake unto Moses, saying, Phinehas, the son of Eleazar, the son of Aaron, hath turned my wrath away from the children of Israel, while he was zealous for my sake among them, that I consumed not the children of Israel in my jealousy.\nWherefore say, Behold, I give unto him my covenant of peace: And he shall have it, and his seed after him, even the covenant of an everlasting priesthood; because he was zealous for his God, and made an atonement for the children of Israel. ",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Father, we are grateful for making Revd. Ajetomobi and family a blessing from you to the Church of God and this generation ",
           "scriptures": [
              "Genesis 12:2"
           ]
       },
       {
           "title": "We ask for a release of fresh anointing upon them for greater exploit and fruitfulness than before as they gracefully take the reawakening mandate from one nation to the other. ",
           "scriptures": [
               "John 14:12",
               "John 15:8",
               "Mark 16:20"
           ]
       },
       {
           "title": "Father, grant them and their family abundant supply of grace, of open doors, of labourers, of capital resource, of the spirit of Christ, and of all things needed for extending the frontiers of the kingdom in the unreached places of the earth; all things are made willing to the mandate",
           "scriptures": [
               "1 Corinthians 15:10",
               "Philippians 1:19",
               "2 Corinthians 9:8"
               
           ]
       },
       {
           "title": "Father, we pray that your covenant of everlasting priesthood over this family will endure as you cause every member of the family to discover and fulfil your purpose for them.",
           "scriptures": [
               "Numbers 25:13",
               "Psalms 89:2-4"
           ]
       },
       {
           "title": "We decree, that the rod of the wicked shall not rest upon any member of the family and we forbid afflictions or oppressions in their lives in Jesus’s name. ",
           "scriptures": [
               "Psalms 125:3"
           ]
       },
       {
           "title": "Father, cause their children to find grace in your sight, compass them with your favour and establish the works of their hands. ",
           "scriptures": [
               "Psalms 5:12",
               "Psalms 90:14"
           ]
       },
       {
           "title": "Pray that God will satisfy all their children early with His mercy, prosper them in their academics, career, marital and establish them in His purpose for their lives",
             "scriptures": [
                "Psalms 90:14"
           ]
          
       },
       {
           "title": "Ask the Father to raise more loyal children, faithful labourers, and associates for God’s servant in every nation where they minister. ",
           "scriptures": [
               "Colossians 1:7"
           ]
       },
       {
           "title": "Father, make my life a convincing witness for Jesus; a witness of genuine salvation, of your goodness, and a carrier of your wonder-working power",
             "scriptures": [
                
           ]
       },
       {
        "title": "Father, deliver unto me the hidden treasures of this nation, I begin to partake of the good and the fatness of this nation in Jesus’s name",
          "scriptures": [
             "Isaiah 1:19",
             "Isaiah 45:3"
        ]
    }
   ]
},

{
    "date": "August 9",
   "title": "REVIVAL FOR THE GLOBAL CHURCH",
   "scriptures": [
       "Matthew 16:13-19"
   ],
   "anchor_passage": "When Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, Whom do men say that I the Son of man am? And they said, Some say that thou art John the Baptist: some, Elias; and others, Jeremias, or one of the prophets. He saith unto them, But whom say ye that I am? And Simon Peter answered and said, Thou art the Christ, the Son of the living God. And Jesus answered and said unto him,\nBlessed art thou, Simon Barjona: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven. And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it. And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven.",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Let's bless the Lord Godfor the tremendous things He is doing in and through the church. Thank you, father, for the move of the Spirit that the church has experienced in time past, in various dimensions and locations across the world, we are grateful.",
           "scriptures": [
              "Psalms 86:9-10"
           ]
       },
       {
           "title": "Father, we ask for a fresh reawakening in your church in Nigeria (and in the country of your residence); such a revival that will establish your church in biblical truth, bringing us to the unity of faith and of the knowledge of the son of God so that we can establish your righteousness in our territory. ",
           "scriptures": [
               "Isaiah 62:1-3",
               "Proverbs 14:34"
           ]
       },
       {
           "title": "Father, clean up the church of every mess and filthiness that is defiling her sanctity and causing the unrighteous world to blaspheme the name of Christ. Make your church the ground of truth and a house of prayerin every nation. ",
           "scriptures": [
               "Isaiah 1:25-27 ",
               "1 Timothy3:15",
               "Matthew 21:12-13" 
           ]
       },
       {
           "title": "Father, we ask for a fresh outpouring of your spirit upon all flesh; give us the latter rain in this season and empower us for the harvest of these last days.",
           "scriptures": [
               "Zechariah 10:1",
               "Hosea 6:3",
               "Joel 2:23"
           ]
       },
       {
           "title": "We pray that the universal church will not lose her true identity in Christ. We demand a fresh revelation of Christ in the global Church, let Christ and him crucified be the goal of every kingdom adventure. ",
           "scriptures": [
               "Matthew 16:13-19",
               "1 Corinthians 2:2"
           ]
       },
       {
           "title": "We put an end to every reproach against the church of Christ in every nation; Father, let the church is reawakened to shine as light and subdue every false religion in every nation. ",
           "scriptures": [
               "John 1:5",
               "Isaiah 60:1-3"
           ]
       },
       {
           "title": "Father, unite the body of Christ in Nigeria, make us truly one, and let every wall of division hindering our impact collapse in the name of Jesus",
             "scriptures": [
                "Psalms 133:1-2",
                "John 17:21"
           ]

          
       },
       {
           "title": "Lord, restore your power to the church like the day of old. Let the supernatural become usual; let there be great manifestations of the gifts of the spirit again in our lives and the church like never before.",
           "scriptures": [
               "Psalms 74:9",
               "Hebrews 11:40"
           ]
       },
       {
           "title": "Pray against every schemeof the devil against all the redemption faith churches, ask the Lord to frustrate association of the kingdom of darkness to weaken our churches in Jesus name.",
             "scriptures": [
           ]
       }
   ]
},
    {
         "date": "August 10",
        "title": "PRAYERS FOR THE CENTRAL VISION OF MIV MINISTRY",
        "scriptures": [
            "Deuteronomy 33:18-19"
        ],
        "anchor_passage": "And of Zebulun he said, Rejoice, Zebulun, in thy going out; and, Issachar, in thy tents. They shall call the people unto the mountain; there they shall offer sacrifices of righteousness: for they shall suck of the abundance of the seas, and of treasures hid in the sand. Deut 33:18-19  ",
        "Discussion_title": "Reawakening the church to her responsibilities-Reawakening conferences, Back to Bethel, Alone with God retreats, family life conferences and outside ministrations",
        "prayer_foci": [
            {
                "title": "Thank God for the privilege of being used in the reawakening efforts of restoring the church to God and her responsibilities.",
                "scriptures": [
                   
                ]
            },
            {
                "title": "Give Him all glory for the revival He has brought to the lives/homes of ministers, and the body of Christ through our reawakening efforts.",
                "scriptures": [
                ]
            },
            {
                "title": "Pray for clear instructions from above for Rev and Rev Mrs Ajetomobi, as they seek God’s face to give directions on the for all reawakening conferences",
                "scriptures": [
                ]
            },
            {
                "title": "Pray that the word of the Lord for the season shall not be scarce in all these reawakening meetings.",
                "scriptures": [
                                     "1 Samuel 3:1","Isaiah 55:10-11"

                ]
            },
            {
                "title": "Pray that the power and the presence of God shall not be lacking in all reawakening meetings",
                "scriptures": [
                    "Luke 5:17",
                   "1 Corinthians 4:20"
                ]
            },
            {
                "title": "Father, make these meetings a place of pruning your servants for greater fruitfulness",
                "scriptures": [
                    "John 15:2",
                    "Malachi 3:3"
                ]
            },
            {
                "title": "Father, we ask for opened doors to other cities and nations where the reawakening word is needed",
                  "scriptures": [
                    "Acts 16:9"
                ]
               
            },
            {
                "title": "Pray that God will continue to be our sufficiency to host these conferences",
                "scriptures": [
                    "2 Corinthians 3:5",
                    "2 Corinthians 9:8"
                ]
            },
            {
                "title": "Ask God to strengthen the hands of everyone involved in planning/ organizing these conferences to execute them faithfully and excellently",
                  "scriptures": [
                    "2 Chronicles 15:7","Genesis 49:14","Deuteronomy 31:6","Exodus 25:40"
                ]
            } ,
             {
                "title": "Father, anoint me with your power and wisdom as a reawakening voice in my generation; use me to reprove the work of darkness and turn many to righteousness.",
                  "scriptures": [
                    "Daniel 12:3","Ephesian 5:11-13"
                ]
            }
        ]
    },







     {
         "date": "August 11",
        "title": "PRAYERS FOR HOMES, CHILDREN, TEENAGERS AND YOUTHS",
        "scriptures": [
            " 1 John 2:1"," 1 John 2:18-21"
        ],
        "anchor_passage": "And did He not make you one? Yet the vestige of the Spirit is in him. And what of the one? He was seeking a godly seed. Then guard your spirit, and do not act treacherously with the wife of your youth.  Malachi 2:15 “The glory of young men is their strength: and the beauty of old men is the grey head.” Proverbs 20:29. \n\n“I write unto you, little children, because your sins are forgiven you for his name's sake.” “Little children, it is the last time: and as ye have heard that antichrist shall come, even now are there many antichrists; whereby we know that it is the last time. They went out from us, but they were not of us; for if they had been of us, they would no doubt have continued with us: but they went out, that they might be made manifest that they were not all of us. But ye have an unction from the Holy One, and ye know all things. I have not written unto you because ye know not the truth, but because ye know it, and that no lie is of the truth.” 1 John 2:12, 18-21",
        "Discussion_title": "",
        "prayer_foci": [
            {
                "title": "Heavenly Father, we thank you for the homes you have given us in MIV, thank you for our children, teenagers and Youths all over the MIV Ministry and the Redemption Faith Church. Thank you for giving us these gifts. Amen.",
                "scriptures": [
                   
                ]
            },
            {
                "title": "Father, we pray for all our homes and families let the virtues of Christ-like love abide in every family, let the spirit of forbearance and mutual honour rule every home",
                "scriptures": ["Ephesian 5:25"
                ]
            },
            {
                "title": "Heavenly Father, let the cord of God's love, peace and unity be seen in every family in the MIV ministry. Cause every couple in MIV to make definite progress in become One and fulfilling the divine purpose for their union",
                "scriptures": ["Malachi 2:15","Genesis 2:24"
                ]
            },
            {
                "title": "We receive for all our children, teens and youths the discerning ability by the Spirit so that they are able to discern and escape the wolves of this world parading themselves as sheep in order to deceive and destroy these young ones",
                "scriptures": [
                                   

                ]
            },
            {
                "title": "Heavenly Father, help our children and teens to practice the truth that they are being taught in the Church and to follow the prompting of the Holy Spirit at all times. Make it that they will not be deceivable in this end of time",
                "scriptures": [
                  
                ]
            },
            {
                "title": "Heavenly Father, open the eyes of our children and teens to the revelation of the power that resides in them, so that they are able to resist the devil and discern his subtle devices",
                "scriptures": [
                    "Ephesians 1:17-19"
                ]
            },
            {
                "title": "We pray that all our teens and children will come into the light and knowledge of the Lord, and that henceforth they will progress to maturity and skilfulness by the help of the Holy Spirit. We shall surely see evidence and fruits of growth in them for the true light now shines on them! Amen",
                  "scriptures": [
                    "1 John 2:8"
                ]
               
            },
            {
                "title": "We pray for all round security and protection for every child and teen associated with the MIV Ministry as well as the Redemption Faith Church",
                "scriptures": [
                 
                ]
            },
            {
                "title": "Heavenly Father, deliver our youth and young people from the canker of strange and immoral relationships that devour years and glories in this present age.",
                  "scriptures": [
                ]
            } ,
             {
                "title": "We pray that our teens, children, youth and young people shall be filled with the Holy Spirit and the power of God shall be fully activated in them. Give them hearing ears, and seeing eyes to follow your will as they make decisions and choices in life",
                  "scriptures": [
                    "Joel 2:28-29"
                ]
            },
        {
                "title": "We pray that the Lord will empower our youth and envision them for greatness in Christ. They will work their own work and eat their own bread. Great ministers of the gospel and anointed professionals shall arise from among them in Jesus name. They will work right, earn right and eat right, and have more than enough! Amen",
                  "scriptures": [
                ]
            }, {
                "title": "Father, we frustrate every strategy of the devil against our homes, we degree all the devices of the devil to separate husbands and wives or sow bitterness in their hearts shall not prosper in Jesus name. We decree, no room for unforgiveness in our homes in Jesus name. Father, grant every man and every woman wisdom to build our homes what God desire it to be",
                  "scriptures": [
                    "Job 5:12","Ephesian 4:26-27","Proverbs 14:1"
                ]
            }
         ]
    },






     {
         "date": "August 12",
        "title": "PRAYERS FOR REDEMPTION FAITH CHURCHES, THEIR PASTORS AND LEADERSHIP TEAM",
        "scriptures": [
            "Acts 9:31","Matthew 16:18-19"
        ],
        "anchor_passage": "And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it. And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven” Mat 16:18-19\n\n“Then had the churches rest throughout all Judaea and Galilee and Samaria and were edified; and walking in the fear of the Lord, and in the comfort of the Holy Ghost, were multiplied”. Acts 9:31 ",
        "Discussion_title": "",
        "prayer_foci": [
            {
                "title": "Thank God for building His church in all the Houses, for establishment, growth and increase",
                "scriptures": [
                   "Matthew 16:18",
                   "1 Corinthians 3:16"
                ]
            },
              {
                "title": "Thank God for giving us pastors after His heart and enduing them with grace to grow each assembly",
                "scriptures": [
                   "Jeremiah 3:15"
                ]
            },
            {
                "title": "Pray that God will make all our pastors and leaders of RFC true shepherd like Christ and God will empower them with grace to nurture every member to maturity and nurture every assembly to great multiplication.",
                "scriptures": ["Jeremiah 23:4",
                "Jeremiah 3:15"
                ]
            },
            {
                "title": "Pray that the lamp of God in every House (RFC) will be kept burning; the fire on the altar shall not be quenched; every assembly shall nurture their cooperate altar to the point of subduing every contending force in the territory of their abode.",
                "scriptures": [
                    "1 Samuel 3:3","Leviticus 6:13"
                ]
            },
 {
                "title": "Pray that the word of God will not be scarce and the manifested power of the Holy spirit shall continually be evident in these churche",
                "scriptures": [
                    "Acts 6:7","Acts 2:17","1 Samuel 3:21"
                ]
            },





            {
                "title": "Pray that God will make each assembly a living church, and Zion indeed where men will find deliverance, where men will be discipled after Christ and men will possess their possession,",
                "scriptures": [
                                     "Obadiah 1:17"

                ]
            },
            {
                "title": "Father, make every RFC a place of edification, comfort, true worship, genuine fellowship, effective discipleship, and fruitful Christian service",
                "scriptures": [
                    "Acts 9:31",
                   "Romans 8:29"
                ]
            },
            {
                "title": "Command every obstacle & resistance against growth where our local assemblies are located to give way; ask the Lord to make room for us in those communities and give us abiding fruits",
                "scriptures": [
                    "Zechariah 4:6",
                    "Genesis 26:22"
                ]
            },
            {
                "title": "Pray that shout of rejoicing and testimonies will break forth in each of these centres this month as the Lord visits in a special way, meeting all our members at the points of their need",
                  "scriptures": [
                    "Jeremiah 30:19"
                ]
               
            },
            {
                "title": "Pray for peace and prosperity in the homes of all our resident pastors; ask the Lord to give them victory over every raging of the darkness.",
                "scriptures": [
                 
                ]
            },
            {
                "title": "Pray that genuine Christ-like love will be the ruling spirit in every assembly to the extent that many others will come to know Christ by the demonstration of this love.",
                  "scriptures": [
                    "John 17:21","John 13:35"
                ]
            } ,
             {
                "title": "Pray that every ordained leaders in all our centres will walk worthy of their call and bear fruits in every good work they have been called to do in the house of God.",
                  "scriptures": [
                ]
            }
        ]
    },







     {
         "date": "August 13",
        "title": "MIV MISSION EFFORTS, OUR MISSIONARIES, MISSION SCHOOL AND MISSION CONFERENCES",
        "scriptures": [
            "Mark 16:20","Matthew 24:14"
        ],
        "anchor_passage": "And they went forth, and preached everywhere, the Lord working with them, and confirming the word with signs following. Amen. Mark 16:20\n\nAsk of me, and I shall give thee the heathen for thine inheritance, and the uttermost parts of the earth for thy possession. Psalm 2:8 \n“And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come.” Matthew 24:1",
        "Discussion_title": "MIV TANZANIA || OYO STATE FIELDS-MELE MUKU, OLANLA, LALEYE/ELEKURU AND KUPALO",
        "prayer_foci": [
            {
                "title": "Thank God for sustaining Pastor Ayo Olayiwola and his family and for enabling them to remain steadfast and be fruitful labourer in the field.",
                "scriptures": [
                   "Acts 10:38"
                ]
            },
            {
                "title": "Thank God for the family, wife and children and diverse testimonies happening and that God will continually move them forward for His glory. Amen",
                "scriptures": [
               
                ]
            },
            {
                "title": "Father, cause the land of Lihimaniyao in south East Tanzania (99% Muslim) to be fully opened for the gospel; we pull down the stronghold of Islam in the hearts of the people in Jesus’s name",
                "scriptures": [
                    "1 Corinthians 16:9"
                ]
            },
            {
                "title": "Ask the Lord to grant Pastor Ayo the unction, wisdom, capacity and resources to raise more indigenous missionaries that will reach the unreached people of Tanzania",
                "scriptures": [
                                 

                ]
            },
            {
                "title": "Father, we ask for abundant provision to meet all family needs, and for the provision of land & resources to build the MIV Tanzania mission base",
                "scriptures": [
                
                ]
            },
            {
                "title": "Pray for the revival among believers and the Church of Tanzania ",
                "scriptures": [
                 
                ]
            }, 
             {
                "title": "---OYO STATE FIELDS-MELE MUKU, OLANLA, LALEYE/ELEKURU AND KUPALO---",
                "scriptures": [
                 
                ]
            },

            
            {
                "title": "Let’s thank God for sustaining pastors Odeh John, Dennis Chuckwuamaka, Ebenezer Akinyoola, Pastor Taiwo Oyeyipo and Omoniyi who are serving in our fields in Oyo state among a variety of tribes including Igede, Togolese, Yoruba, Igbo, Hausa, and so on. Thank God for the peace of God across these fields",
                  "scriptures": [
                  
                ]
               
            },
            {
                "title": "Pray that God will draw men and women to the churches on these fields and establish them in Christ. Father, through the MIV mission efforts, let there be a multiplication of disciples of Christ in these lands",
                "scriptures": [
                 
                ]
            },
            {
                "title": "Pray that God will visit these lands with His revival power to end all negative movement of occults and satanism",
                  "scriptures": [
                ]
            } ,
             {
                "title": "Pray that all the mission efforts in these fields (such as Generation Next Project - towards reaching the children and teenagers in the land through Vacation Bible School) will receive right partnership and supports.",
                  "scriptures": [
                ]
            } , {
                "title": "Pray for our church building and mission house projects on these fields will receive adequate funding for completion.",
                  "scriptures": [
                ]
            } , {
                "title": "That God will encourage all our covenant partners and supporter and strengthen them to do more and give them amazing testimonies in all their endeavours.",
                  "scriptures": [
                ]
            } , {
                "title": "Pray for God’s breath upon the mission work at Laniba. Pray that God will raise for Himself a living and strong church in that community in this season",
                  "scriptures": [
                ]
            }
        ]
    },




     {
         "date": "August 14",
        "title": "HIS PURPOSE, OUR MANDATE: REACHING THE UNREACHED AT ALL COST",
        "scriptures": ["Mark 16:20"
           
        ],
        "anchor_passage": "“And they went forth, and preached everywhere, the Lord working with them, and confirming the word with signs following. Amen. Mark 16:20 ",
        "Discussion_title": "RFC-MIV Gambia || KWARA STATE MISSION FIELDS",
        "prayer_foci": [
            {
                "title": "Praise God for His constant wisdom and grace in all matters of decisions and policy making",
                "scriptures": [
              
                ]
            },
            {
                "title": "Ask God to keep showing the leaders and members of MIV/RFC Gambia favour, grace and strength for the work and the vision",
                "scriptures": [
                
                ]
            }, {
                "title": "Pray for more capable, committed and available men to handle different areas of the ministry work in MIV/RFC Gambia",
                "scriptures": [
                
                ]
            },
            {
                "title": "Thank God for all our Partners and Supporters. Pray that God will enlarge their coast and bless them on every side.",
                "scriptures": [
                ]
            },
            {
                "title": "Pray that God will help raise more partners to support every aspect of the work",
                "scriptures": [

                ]
            },
            {
                "title": "Pray that God will help raise more partners to support every aspect of the work.",
                "scriptures": [
                 
                ]
            },
            {
                "title": "Ask God for necessary logistics to run the ministry work without much stress and limitations.",
                "scriptures": [
                  
                ]
            },
        
            {
                "title": "Pray that MIV/RFC Gambia shall greatly increase and shall never be small in all areas.",
                "scriptures": [
                 
                ]
            },
            {
                "title": "---KWARA STATE MISSION FIELDS---",
                  "scriptures": [
                   
                ]
            } ,
             {
                "title": "Let’s Appreciate God for the mission work among Baruba people, and for the families of Pastors Dauda Adamu and Matthew Aweda that are labouring with their team on the land.",
                  "scriptures": [
                ]
            },
             {
           "title": "Thank God for Pastor John Olulana and His family and the work the Lord has committed to their hands",
           "scriptures": [
              
           ]
       }, {
           "title": "Please thank God for healing and restoration of Mrs Dauda’s health. Thank God for defending them and upholding them continually.",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray for the salvation of indigenous Barubas people; and for grace for them to be discipled and established in Christ.",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray that the present members of the church will grow unto maturity and become labourers for Christ.",
           "scriptures": [
              
           ]
       }, {
           "title": "In agreement, we break the holds of Islam, Idolatry and immorality over the entire Baruba land (Gbongboru, Damera, Kobi Aro, Kubure, Gbirinu, Bonigoro, Gobo Gbiya and Gwanara lands) in Jesus name, and we enforce the kingdom of god upon the land and all that is within amen. Thank you Father for answers.",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray that the lord send more labourers into his vineyard ",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray for God to settle Accommodation and other challenges and also for speedy completion of  the ongoing Mission House Building in gbongboru. ",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray that the Lord brake every altars of ISLAM and of the darkness in Kwara State.",
           "scriptures": [
              
           ]
       }
        ]
    },

    {
    "date": "August 15",
   "title": "ACTIVATING THE SPIRIT OF PRAYER",
   "scriptures": [
       "Ephesians 6:18"
   ],
   "anchor_passage": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered.\n Romans 8:26 Praying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints; - Ephesians 6:18",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Heavenly Father, we thank You for the gift of the Holy Spirit, who helps our weaknesses and intercedes for us in prayer. Help us to activate the Spirit of prayer in our lives.",
           "scriptures": [
              "Romans 8:26"
           ]
       },
       {
           "title": "Our Father, we ask for the grace and wisdom to pray always, with all prayer and supplication, in the Spirit, and to deliberately watch over the territory you have planted us and prayerfully establish your kingdom there.",
           "scriptures": [
               "Ephesians 6:18"
           ]
       },
       {
           "title": "Thank You, Father, for the examples of prayerful people in the Bible, such as Daniel, Hannah, and Jesus. Help us to follow their examples. Father, in your mercy, put the engine of prevailing prayer within me.",
           "scriptures": [
               "Daniel 6:10",
               "1 Samuel 1:10-18",
               "Luke 6:12"
               
           ]
       },
       {
           "title": "Father, we ask for the Spirit's help to pray effectively, cause us to master the art of prevailing and resultful prayer as we learn to pray with understanding, to pray with faith, pray according to your will and pray until the answer comes",
           "scriptures": [
               "Romans 8:26-27","1 Corinthians 14:15"
           ]
       },
       {
           "title": "Our Father, we ask for the strength to persevere in prayer, to overcome hindrances, and to keep praying until we see answers",
           "scriptures": [
               "Luke 18:1-8","Galatians 6:9"
           ]
       },
       {
           "title": "Father, activate our prayer lives, ignite our hearts with Your fire, and fill us with Your passion, that we may pray effectively and make prayer and intercession a lifetime habit",
           "scriptures": [
               "Luke 3:16","Acts 2:3-4"
           ]
       },
       {
           "title": "-----MIV MOROCCO-----",
             "scriptures": [
           ]
          
       },
       {
           "title": "Appreciate God for the Dahouds and the family for the work the Lord is doing through them in Morocco",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that the Dahouds will continually be filled with the power of God, to bring many to the knowledge of Jesus Christ",
             "scriptures": [
           ]
       },
        {
           "title": "Pray for unity and fresh zeal for all workers working with them in Morocco",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray for 2 new believers KhalId and Monir that got saved recently for protection from being spotted for persecution and that they will begin to grow  in their walk with the Lord.",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray for open home for house Church for brethren to meet for fellowship.",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray for Labourers to enter Mauritania",
           "scriptures": [
              
           ]
       }, {
           "title": "Pray for Saïd who was bailed recently from the police for sharing the gospel. He has graduated, Pray for a job for him. Thank you Father for answers.",
           "scriptures": [
              
           ]
       }
   ]
},

{
    "date": "August 16",
   "title": "HIS PURPOSE, OUR MANDATE: REACHING THE UNREACHED AT ALL COST",
   "scriptures": [
       "Mark 16:20","Acts 6:7"
   ],
   "anchor_passage": "And the word of God increased; and the number of the disciples multiplied in Jerusalem greatly; and a great company of the priests were obedient to the faith” Acts 6:7\n“And they went forth, and preached everywhere, the Lord working with them, and confirming the word with signs following. Amen. Mark 16:20",
   "Discussion_title": "MIV SOUTHERN AFRICA",
   "prayer_foci": [
       {
           "title": "Thank God for His help and favour over the MIV work in Southern Africa.",
           "scriptures": [
              
           ]
       },
       {
           "title": " Pray that God will baptise all MIVSA brethren with unquenchable passion for souls and kingdom building. That everyone will be useful, effective and fruitful tool in the hand of God.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that all our converts will abide in Christ, become faithful disciples and labourers in the vineyard",
           "scriptures": [
               
               
           ]
       },
       {
           "title": "Pray that brethren in MIVSA will truly love God and love one another. Ask God to cause all MIVSA brethren to enjoy the favour of God and of men.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that God will give all MIVSA leaders sincere hearts to work together and advance the cause of God and baptise them with the wisdom and love needed to lead the people of God",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that God will bless MIVSA with properties and places of worship",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that God will bless us with properties or land that will serve as our City Church in Johannesburg and a Community Centre (and church) in Pretoria.",
             "scriptures": [
           ]
          
       },
       {
           "title": "Pray that God will bless MIVSA with businesses (wisdom, capital, facilities) so that we can have finances to support the work of MIV missions, our brethren and the community.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that MIVSA will grow beyond the current five centres. ",
             "scriptures": [
           ]
       },{
           "title": "Pray that we will enter new territories in South Africa and new Nations in Southern Africa ",
           "scriptures": [
              
           ]
       },{
           "title": "Pray for wisdom, grace and power for Pastor Omotayo & Adeola Arotiba as they lead the MIVSA work.",
           "scriptures": [
              
           ]
       }
   ]
},

{
    "date": "August 17",
   "title": "BECOMING A CHANNEL FOR UNDERSTANDING OF MYSTERIES THROUGH PRAYER",
   "scriptures": [
       "Daniel 2:15-18","Daniel 2:46-47"
   ],
   "anchor_passage": "Then Daniel replied with discretion and wisdom to Arioch, the captain of the king’s bodyguard, who had gone out to execute the wise men of Babylon; he said to Arioch, the king’s captain,\n“Why is the decree from the king so harsh and urgent?” Then Arioch explained the matter to Daniel. So Daniel went in and asked the king to appoint a date and give him time, so that he might reveal to the king the interpretation of the dream.” \n\nThen Daniel returned to his house and discussed the matter with Hananiah, Mishael, and Azariah, his companions,  in order that they might seek compassion from the God of heaven regarding this secret, so that Daniel and his companions would not be executed with the rest of the wise men of Babylon. Then King Nebuchadnezzar fell face downward and paid respect to Daniel [as a great prophet of the highest God], and gave orders for an offering and fragrant incense to be presented to him [in honor of his God]. The king answered Daniel and said, “Most certainly your God is the God of gods and the Lord of kings and a revealer of mysteries, since you have been able to reveal this mystery!” Daniel 2:15-18,Daniel 2:46-47 AMP",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Father, we want to thank you for the preservation of our lives over the years and thank you for placing us in different spheres of influence",
           "scriptures": [
              
           ]
       },
       {
           "title": "Lord, give us discretion and wisdom to speak with men in authority where we are planted, and thus bring about righteous changes in the society",
           "scriptures": [
               
           ]
       },
       {
           "title": "We ask for grace for right utterance, even when negotiating with men who carry contrary evil mandates against our lives so that we can speak with a wisdom and spirit that will make them to bow to our God",
           "scriptures": [
               "Acts 26:12-29"
               
           ]
       },
       {
           "title": "We receive boldness to stand before Kings to plead the cause of men in our generation and bring the manifestation of the spirit to the table to deliver many from destruction in the name of Jesus",
           "scriptures": [
               
           ]
       },
       {
           "title": "Lord, let our proposals, projects, applications and utterances receive the favour of kings in the name of Jesus.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Lord, we receive the company of godly men (strengthener of our faith) in times of distress, to war a good warfare in agreement and receive your promises in Jesus name.",
           "scriptures": [
               
           ]
       },
       {
           "title": "In this season of fasting and prayers, Lord, we receive mercy from You over diverse matters that have been troubling us, over issues that have been troubling our hearts in the name of Jesus. Give us light and understanding Lord, open our eyes to decode every spiritual mystery surrounding our lives, families, career and ministries in Jesus name. Let every secret be revealed",
             "scriptures": [
                "Deuteronomy 29:29"
           ]
          
       },
       {
           "title": "Lord, grant compassion to us regarding mysteries and secrets that are troubling the hearts of men in our communities and nations, including those troubling the hearts of our leaders, in the name of Jesus.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Lord, cause men to fall face downwards before You as the Most High God through your revelation in us. Let kings come to the knowledge of You as God of gods and Lord of kings and a revealer of mysteries, giving Glory to your name and Your Kingdom, in the name of Jesus",
             "scriptures": [
           ]
       },
        {
           "title": "Pray for the salvation of the sould of your family members, neighbours, and fellow workers",
             "scriptures": [
           ]
       }
   ]
},

{
    "date": "August 18",
   "title": "MIV EUROPE || MIV OKUNMOBA",
   "scriptures": [
       
   ],
   "anchor_passage": "",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Give thanks on behalf of all families that are newly settling in the Europe & addition of new members to us. Let's also thank God for the successful take off of RFC, Edinburgh in June, 2024 and the progress of the RFC, Shrewsbury. Specifically, thank God, for answering our prayers to send labourers.",
           "scriptures": [
              
           ]
       },
       {
           "title": "Pray that God will envision all MIV Europe brethren. The Holy Spirit will baptise us with His fire to be living witnesses and to confront the godlessness around us. We shall subdue the land and be mighty for God. We shall not loose anyone or our children to the world. ",
           "scriptures": [
               
           ]
       },
       {
           "title": "RFC Edinburgh- that this work shall be established and attract many nationals. Rev 7:9. God will embolden His servants to preach His word",
           "scriptures": [
               "Acts 4:29 "
               
           ]
       },
       {
           "title": "RFC Shrewsbury- That the days of His power come among us for willing workers and effective witnessing. ",
           "scriptures": [
               "Psalms 110:3"
           ]
       },
       {
           "title": "We trust God for all our clusters across UK & Germany, to wax stronger and emerge as strong churches.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that the Lord will be merciful to the church in UK and Europe; restore her lost glory, heal her backsliding, put an end to her desolation and make her inhabited again",
           "scriptures": [
               "Isaiah 62:1-4"
           ]
       },
       {
           "title": "---MIV OKUN MOBA---",
           "scriptures": [
               
           ]
       }, {
           "title": "Thank God for His mercies and grace upon Pastors Taiwo & Bose Ajayi and family and their team. Father, we are grateful for fighting their battles in OkunMoba and giving us victory again and again in the face of a lot of difficulties.",
           "scriptures": [
               
           ]
       },
     
       {
           "title": "Thank God for Miv College And Leadership Academy Mobathe school arm of the ministry for how the Lord has been transforming the lives of these children giving them hope in Him.",
             "scriptures": [
           ]
       },
       {
        "title": "Ask God for His unending mercies to remain upon this ministry. Ask God to bless all her outreaches in the Moba field with great harvest of souls.",
          "scriptures": [
        ]
    },
    {
        "title": "Pray that the Lord of harvest will send more labourers into His harvest field.",
          "scriptures": [
        ]
    },
    {
        "title": "Pray that the Lord will cause His light to shine brighter in Daddy Lois community and the souls of men held up in darkness will be liberated.in Jeus name.",
          "scriptures": [
        ]
    },
    {
        "title": "Pray that all the converts in the land will be strengthened and sustained in the face of persecutions.",
          "scriptures": [
        ]
    },
    {
        "title": "Pray that all resources needed (human, financial and materials) to sustain this vision will be abundantly supplied from time to time.",
          "scriptures": [
        ]
    },
    {
        "title": "Pray that the Lord will revive the passion for global mission in the body of Christ in this season.",
          "scriptures": [
        ]
    },
    {
        "title": "Ask the Lord to bless all our partners beyond their widest imagination for being part of the great commission.",
          "scriptures": [
        ]
    }
   ]
},

{
    "date": "August 19",
   "title": "MIV SENEGAL || DIVINE WELL GLOBAL FOUNDATION( DWGF)",
   "scriptures": [
       "2 Corinthians 9:8-11"
   ],
   "anchor_passage": "And God is able to make all grace abound toward you; that ye, always having all sufficiency in all things, may abound to every good work: (As it is written, He hath dispersed abroad; he hath given to the poor: his righteousness remaineth for ever. Now he that ministereth seed to the sower both minister bread for your food, and multiply your seed sown, and increase the fruits of your righteousness;) Being enriched in every thing to all bountifulness, which causeth through us thanksgiving to God. ",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Thank God who has been the strength and help of the family of Pastor Segun and his wife as they serve in Senegal. Thank God for the work: new converts, our strength and help now and the years past ",
           "scriptures": [
              
           ]
       },
       {
           "title": "Ask the Lord to establish all their new converts (including former Muslims and catholics) in the faith and enable them to continue disciples of Christ. Pray that the works of the Holy Spirit will be evident in their lives and they will all become labourers for Christ.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that the Lord will strengthen the home fellowships and that the move of God will be evident every time they gather. ",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that the Lord will perfect all things concerning the outreaches/crusades in August at fatick ,Ngohe,Dakar and Pout regions. Pray that a great revival will break forth in these communities as the Lord confirm His word with signs and wonders.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray for sound health for the family of Pastor Segun, the Lord will perfect the healing of the daughters wound and there will be abundant provision of financial resources for the mission work as well as the family.",
           "scriptures": [
               
           ]
       },
         {
           "title": "---DIVINE WELL GLOBAL FOUNDATION( DWGF)---",
             "scriptures": [
               
           ]
          
       },
      
       {
           "title": "Let's specially thank God over for DWGF for the vision, the beginning, the sustainance and the impact it has made in giving hope to underserved children.",
             "scriptures": [
               
           ]
          
       },
       {
           "title": "Ask the Lord to grant Rev Mrs Stella Ajetomobi, the team and the partners the grace, the resources, and the wisdom that they need to execute every project God has put in their hearts",
           "scriptures": [
            
           ]
       },
       {
           "title": "Pray for multiplied results for every efforts put into every project.",
             "scriptures": [
           ]
       },
       {
        "title": "Pray that the Lord will perfect all that concerns the volunteers, prosper the works of their hands and give them great opportunities. We receive supernatural intervention for them in every area of need.",
          "scriptures": [
        ]
    },
    {
        "title": "Ask the Lord to give unto Rev Mrs Stella Ajetomobi clearer vision on the assignment on this organization, the necessary social capital, strategies, resources and all round favour to continue to be a blessing to many through the DWGF. Thank you, Father, for answers.",
          "scriptures": [
        ]
    }
   ]
},

{
    "date": "August 20",
   "title": "MIV BRAZIL, SOUTH AMERICA || MIV, COTE D'IVOIRE AND TOGO",
   "scriptures": [
       
   ],
   "anchor_passage": "",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Let's give thanks and praise to God for the country of Brazil and for what God is using Pastors Abiola & Hannah Rasaq to do in the continent of South America ",
           "scriptures": [
              
           ]
       },
       {
           "title": "Let's pray that God will strengthen them, and grant them wisdom and sound health to continue to fulfil His purpose. Pray for open door and favour to reach other countries in South America.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Let's pray and plead for God's mercy over South America, Ask the Lord to expose and judge every spiritual falsehood in Brazil; that Jesus Christ alone will be exalted as Lord in Macaé, the whole of Brazil and the South America.",
           "scriptures": [
               
               
           ]
       },
       {
           "title": "Let's pray that God will give them permanent properties in the land for worship & training center and residence. Pray that the Lord will raise for them financial partners.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray that the people the Lord has given them will continue to abide in the Lord, and become faithful labourers for Christ.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Let's pray that the Lord will cause the heart of the people of Brazil to be open to receive the whole gospel. ",
           "scriptures": [
               "Acts 16:14"
           ]
       },
       {
           "title": "Let's pray for their proposed mission project and outreaches to the Terena India tribes, Quilombolas tribes, Ciganos tribes, the Marahon and others.",
             "scriptures": [
           ]
          
       },
       {
           "title": "Let's pray that every pillars sustaining the LGBT movement and every other strange practices in Brazil be destroyed in Jesus mighty name.",
           "scriptures": [
               
           ]
       },
       {
           "title": "---MIV, COTE D’IVOIRE AND TOGO---",
             "scriptures": [
               
           ]
          
       },
       {
        "title": "Thank God for His faithfulness over Pastors Christian Koffi and Emmanuel Knuckles who are serving in Cote d'Ivoire and Togo respectively among the Akan Dioula and Ewe people groups.",
          "scriptures": [
        ]
    },
    {
        "title": "Pray that will make them fire brands for Him in these countries and that God will use them for the revival of the nation",
          "scriptures": [
            "Judges 15:4-5",
            "Jeremiah 51:20"
        ]
    },
    {
        "title": "Pray that the gate of hell will not prevail against them and they will escape every snare of the enemies in Jesus's name.",
          "scriptures": [
        ]
    },
    {
        "title": "Pray that God will give them the people and the resources of the land for building and for educational missions ",
          "scriptures": [
        ]
    }
   ]
},


{
    "date": "August 21",
   "title": "MIVGAMBIA || MIV GHANA(KUMASI)",
   "scriptures": [
       
   ],
   "anchor_passage": "",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Thank God for the wonderful things God is doing in Gambia through Pastor Bayo James family and team.",
           "scriptures": [
              
           ]
       },
       {
        "title": "Praise God for His constant wisdom and grace in all matters of decisions and policy making",
        "scriptures": [
           
        ]
    },
    {
        "title": "Ask God to continue to show the leaders and members of MIV/RFC Gambia favour, grace and strength for the work and the vision",
        "scriptures": [
           
        ]
    },
    {
        "title": "Pray for capable, committed and available men to handle different areas of the ministry work in MIV/RFC Gambia",
        "scriptures": [
           
        ]
    },
    {
        "title": "Thank God for all our Partners and Supporters. Pray that God will enlarge their coast and bless them on every side.",
        "scriptures": [
           
        ]
    },
    {
        "title": "Pray that God will help raise more partners to support every aspect of the work eg Financially, Morally and Prayers.",
        "scriptures": [
           
        ]
    },
    {
        "title": "Ask God for necessary logistics to run the ministry work without much stress and limitations. Ask the Lord to increase MIV/RFC Gambia greatly increase ",
        "scriptures": [
           
        ]
    },
    {
        "title": "Pray for good health for the Gambia team. Pray for divine healing and restoration of health.",
        "scriptures": [
           
        ]
    },
       {
           "title": "Pray that God will raise men to support all the projects in the Gambia, especially the permanent site project. Pray that MIV/RFC Gambia shall greatly increase and shall never be small in all areas.",
           "scriptures": [
               
           ]
       },
      
        {
           "title": "---MIV GHANA(KUMASI)---",
           "scriptures": [
               
           ]
       },
       {
           "title": "Thank God for His goodness and mercies over Pastor Peter Ilesanmi and his wife serving in Ghana. Thank God for the gradual growth the work in Ghana is experiencing",
           "scriptures": [
           ]
       },
       {
           "title": "Ask the Lord for grace, strength and wisdom to break traditional barriers and cultural beliefs, and get men established in the faith",
           "scriptures": [
           ]
       },
       {
           "title": "Pray for the stability of brethren and commitment to the things of God.",
           "scriptures": [
           ]
       },
       {
           "title": "Ask the Lord to grant more hunger for God in the heart of their members ",
             "scriptures": [
           ]
          
       },
       {
           "title": "Ask the Lord to raise reliable and dependable helpers for our assignment.",
           "scriptures": [
           ]
       },
       {
           "title": "Pray for God's protection over the family.",
             "scriptures": [
           ]
       }
       ,
       {
           "title": "Pray for the provision of landed property for MIV in the Land.",
             "scriptures": [
           ]
       }
   ]
},

{
    "date": "August 22",
   "title": "MIV REPUBLIC OF BENIN REPUBLIC || BAYELSA STATE FIELDS-OLOIBIRI, OGBIA, AKEPILA",
   "scriptures": [
   ],
   "anchor_passage": "",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Let's thank God for His mercies, grace, and favour upon Pastor &Mrs Ebenezer and the impact of the MIV mission efforts in the Republic of Benin ",
           "scriptures": [
              
           ]
       },
       {
           "title": "Pray that God will make the vision of establishing a centre in the southern Benin Republic (Cotonou) a reality; we receive abundant financial provisions to make it happen.",
           "scriptures": [
           ]
       },
       {
           "title": "Ask the Lord to establish the Gurubani church in Parakou and terminate every contention against the growth of that church in Jesus’s name; We receive abundant provision for the completion of Grubani church in Jesus’s name.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Ask the Lord to keep the family of Pastor Ebenezer, to preserve them and provide for all the children’s educational needs.",
           "scriptures": [
           ]
       },
       {
           "title": "Pray that Benin Republic will experience revival in this season, and God will draw the heart of the people of Parakou to Himself",
           "scriptures": [
               "Psalms 85:6",
               "John 6:44"
           ]
       },
       {
           "title": "---BAYELSA STATE FIELDS-OLOIBIRI, OGBIA, AKEPILA---",
           "scriptures": [
               
           ]
       },
       {
           "title": "Appreciate God on behalf Pastors Adebayo, and Matthew and their families for the mercy and grace they have been enjoying, for safety, provision and good health.",
             "scriptures": [
           ]
          
       },
       {
           "title": "Ask the Lord to open the eyes of understanding of the converts on these fields to His faithfulness and His words so that they can become rooted in Christ and committed to His service.",
           "scriptures": [
           ]
       },
         {
           "title": "Ask the Lord to grant the church members in this field true conviction and conversion",
             "scriptures": [
           ]
       },
       {
           "title": "Pray for provision for the completion of all our projects in Ogbia field, Oloibiri Field and Akepilai Field. ",
           "scriptures": [
           ]
       },
       {
        "title": "Pray for the numerical and spiritual growth of the church in these fields",
          "scriptures": [
        ]
    },
    {
        "title": "Pray for the school in Akepilai Field that God will cause it to grow and God will use it to bring about will have a lasting impact on the lives of the pupils/",
          "scriptures": [
        ]
    },
    {
        "title": "Ask the Lord to open unto the missionaries new doors of ministry",
          "scriptures": [
        ]
    }
   ]
},

{
    "date": "August 23",
   "title": "MISSIONS AND LEADERSHP ACADEMY || MISSION RESEARCH AND MOBILIZATION",
   "scriptures": [
       "Mark 3:14-15", 
       "Psalms 68:11"
   ],
   "anchor_passage": "And he ordained twelve, that they should be with him, and that he might send them forth to preach, And to have power to heal sicknesses, and to cast out devils. Mark 3:14-15",
   "Discussion_title": " ",
   "prayer_foci": [
       {
           "title": "Thank God for the sustenance of the school and for helping Pastors Lazarus, Ebenezer Akinyoola and all the workforce as they oversee this academy ",
           "scriptures": [
              
           ]
       },
       {
           "title": "Pray that the Lord will continue to use this school to raise anointed, wise, faithful and thoroughly furnished more labourersthat will be sent into the harvest field.",
           "scriptures": [
           ]
       },
       {
        "title": "Pray that the leadership of the school will be stronger and more courageous to take the school to the promised land.",
        "scriptures": [
        ]
    },
    {
        "title": "Pray that God will continue to supply the resources needed to sustain this school.",
        "scriptures": [
        ]
    },
       {
           "title": "That God will give us the right affiliation that will upgrade our program to a national and  international academic standard",
           "scriptures": [
               
           ]
       },
        {
           "title": "---MISSION RESEARCH AND MOBILIZATION---",
           "scriptures": [
               
           ]
       },
       {
           "title": "Thank God for the activities of the mission mobilisation offices and His grace upon Pastor  Funmi Ikemand pastor Ebenezer, and the mission awareness team, as they labour in Ibadan, Lagos, and Port-Harcourt mobilisation offices",
           "scriptures": [
           ]
       },
       {
           "title": "Ask the Lord to renew the passion of our mobilisers for greater fruits from this work",
           "scriptures": [
           ]
       },
       {
           "title": "Pray for strength and anointing for the team; so that they will not get weary in raising more awareness and support for missions. Ask the Lord to give them wisdom for greater effectiveness",
             "scriptures": [
           ]
          
       },
       {
           "title": "Ask the Father to raise helpers for us, and to give us men who will give generously for kingdom expansion",
           "scriptures": [
           ]
       },
       {
           "title": "Pray that the Spirit of God will stir up the body of Christ to get more deeply involved in missions as we await the coming of Christ.",
             "scriptures": [
           ]
       }
   ]
},

{
    "date": "August 24",
   "title": "A HOLY AND FLAMING BRANCH || HEADQUARTER MINISTRY OFFICE",
   "scriptures": [
       "Isaiah 4:2-6","John 15:5"
   ],
   "anchor_passage": "In that day shall the branch of the LORD be beautiful and glorious, and the fruit of the earth shall be excellent and comely for them that are escaped of Israel. And it shall come to pass, that he that is left in Zion, and he that remaineth in Jerusalem, shall be called holy, even every one that is written among the living in Jerusalem: When the Lord shall have washed away the filth of the daughters of Zion, and shall have purged the blood of Jerusalem from the midst thereof by the spirit of judgment, and by the spirit of burning.\nAnd the LORD will create upon every dwelling place of mount Zion, and upon her assemblies, a cloud and smoke by day, and the shining of a flaming fire by night:\nfor upon all the glory shall be a defence. And there shall be a tabernacle for a shadow in the day time from the heat, and for a place of refuge, and for a covert from storm and from rain.",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Heavenly Father, I thank you for the gift of seeing this day and time of the year. Thank you for answers to all prayers since the beginning of the month. Amen.",
           "scriptures": [
              
           ]
       },
       {
           "title": "Father, no matter what characterize the seasons of my life, make me remain an abiding branch in you, let no pressure or pleasure of this world be able to detach me from the vine, Jesus Christ. Amen.",
           "scriptures": [
               "Romans 8:35-37"
           ]
       },
       {
           "title": "By the power and fire of the Holy Spirit, Lord make me into a flaming branch full of your Spirit and fire for your service in my generation.",
           "scriptures": [
               "Psalms 104:4",
               "Acts 6:8"
               
           ]
       },
       {
           "title": "Father, as an abiding branch, make me fruitful, and let my fruit be excellent and glorious before God in heaven and men on earth. Let my fruitfulness attract glory to your name. ",
           "scriptures": [
               "John 15:5-8"
           ]
       },
       {
           "title": "Let my life and communication be befitting for holiness among the living in this world. ",
           "scriptures": [
               "Ephesians 4:1-3"
           ]
       },
       {
           "title": "Heavenly Father, as I burn for you as a holy and flaming branch, let the shadow of Your Presence be over me to shield me from strange heat and cover me from strange storms and rains that drain and dry up fire. ",
           "scriptures": [
               "Psalms 28:7-8"
           ]
       },
       {
           "title": "Let us ask the Lord for the exaltation of our horns like that of the unicorn. Father, make me strong on the altar. We shall not be weak inlife; No Issachar shall be a weakling in the things of God.We receive wisdom to rule and reign in our individual field in Jesus name. ",
             "scriptures": [
                "Psalms 92:10",
                "Daniel 11:32",
                "Zechariah 12:8"
           ]
          
       },
       {
           "title": "Let us ask the Lord for new release of life, grace and glory to permeate the very fabric of our being, that newness and sharpness with strong sensitivity will be the descriptions of our life from this month onwards. ",
           "scriptures": [
               "Isaiah 4:2-6"
           ]
       },
       {
           "title": "Let us pray for fresh understanding into the mysteries of God. That the word of God will not no longer be concealed from our eyes of the spirit, we will hear God clearly and gain understanding for executive execution of His purposes for our lives.",
             "scriptures": [
           ]
       }
     
       ,
         {
           "title": "---HEADQUARTER MINISTRY OFFICE---",
           "scriptures": [
               
           ]
       },
       {
           "title": "Thank God for Pastor Yinka Olawuyi and the team of staff He has given us that are labouring at the church office. Ask the Lord to give them the wisdom and skills for excellent administrative delivery in His vineyard.",
             "scriptures": [
           ]
       } ,
       {
           "title": "Pray that God will use everyone working in the office to cause the mandate to grow and that they will be true representatives of Christ.",
             "scriptures": [
           ]
       } ,
       {
           "title": "We forbid anyone among them from being used by the enemy against the ministry in Jesus’s name",
             "scriptures": [
           ]
       } ,
       {
           "title": "Pray that they will not miss their reward as they engage in uncalculated labour in this ministry.",
             "scriptures": [
           ]
       }
   ]
},

{
    "date": "August 25",
   "title": "YIELDED VESSEL || ILARO MISSIONS WORK",
   "scriptures": [
       "Jeremiah 18:1-6"
   ],
   "anchor_passage": "which came to Jeremiah from the LORD, saying, Arise, and go down to the potter's house, and there I will cause thee to hear my words. Then I went down to the potter's house, and, behold, he wrought a work on the wheels.\nAnd the vessel that he made of clay was marred in the hand of the potter: so he made it again another vessel, as seemed good to the potter to make it. Then the word of the LORD came to me, saying, O house of Israel, cannot I do with you as this potter? saith the LORD. Behold, as the clay is in the potter's hand, so are ye in mine hand, O house of Israel.",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Heavenly Father, thank You for taking interest in me, your beloved, to be used of you in this season and time of my life and generation. Thank you for including me in your agenda for this age, and for finding me worthy to play a strategic role in your eternal plan for this generation. Amen.",
           "scriptures": [
              
           ]
       },
       {
        "title": "Everything in me struggling to yield to the Lord, for His use and glory, I order and compel you to begin to yield fully without any reservations in Jesus name.",
        "scriptures": [
           
        ]
    },
    {
        "title": "Heavenly Father, irrespective of my level of understanding or comprehension of what you want to do with me, I yield myself to you as a voiceless clay in the hand of the wisest potter. I desire to have no voice of my own, no identity of my own but the ones you give me. Amen.",
        "scriptures": [
           
        ]
    },
    {
        "title": "I may look marred (unattractive) right now because of the process I am undergoing in your hand, but please insist on me, and make me into that vessel that will reveal your ingenuity, beauty, and glory to the world of my generation, and even of generations to come that will hear of what you did with me.",
        "scriptures": [
           
        ]
    },
    {
        "title": "Heavenly Father, do with me as you please until I become a vessel unto honour, and a vessel that pleases you. Amen.",
        "scriptures": [
           
        ]
    },
    {
        "title": "Heavenly Father, if what I am now doesn't please you, remake me o Lord. Remake me from what I have made myself or what circumstances have made me, into that which is made by You.Father, make me a pure revelation and manifestation of the man God made.",
        "scriptures": [
           
        ]
    },
       
       {
           "title": "The word of God that will reveal my present state to me in relation to the state God intends and purposes for me, let it come to me speedily by the Spirit; let it not tarry anymore. Father, make cause me to be fully yielded and cooperative with you my Maker until I become all that you ordained me to be.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Pray for the salvation of your loved ones, relatives, neighbours and colleagues at work",
           "scriptures": [
               "John 10:16"
           ]
       },
         {
           "title": "---ILARO MISSIONS WORK---",
           "scriptures": [
             
           ]
       },
      
       {
           "title": "Let's thank God for the beginning of the mission work in Ilaro, Ogun state and for how he is helping Pastor Ayorinde to oversee the work.",
           "scriptures": [
           ]
       },
       {
           "title": "Pray that the hearts of the student of Ilaro Polytechnic will be opened to the gospel and that many souls will be saved among them.",
             "scriptures": [
           ]
          
       },
       {
           "title": "Pray that the presence of God will br evident in all the meetings of the Issachar student fellowship in the land.",
           "scriptures": [
           ]
       },
       {
           "title": "Pray that the Lord will protect his servant and family all the time and establish the family in the land as they reach out to the students and indigenes of Ilaro.",
             "scriptures": [
           ]
       }
   ]
},

{
    "date": "August 26",
   "title": "REMEMBER NIGERIA OH LORD ",
   "scriptures": [
       "Psalms 147:14"
   ],
   "anchor_passage": "He maketh peace in thy borders, and filleth thee with the finest of the wheat",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Father, we thank you for your continued intervention at every point in the affairs of our Nation Nigeria, despite everything, you remain our God, blessed be your name forever. ",
           "scriptures": [
              "Psalms 124:1-3"
           ]
       },
       {
           "title": "Father, long enough! You've ignored Nigeria long enough. We've looked at the back of your head long enough, Father we cry for mercy; show up now please and turn around our captivity. ",
           "scriptures": [
               "Psalms 13:1",
               "Psalms 126:1", 
               "1 Timothy 1:16"
           ]
       },
       {
           "title": "Lord, please make up for the bad times of Nigeria with some good times; Nigeria has seen enough evil to last a lifetime, Father arise and put an end to all these evils.",
           "scriptures": [
               "Psalms 90:5"
               
           ]
       },
       {
           "title": "Father, we pray for peace in the land, silence in the noise of the enemies of Nigeria. We declare healing for those who have been hurt and wounded in one way or the other.",
           "scriptures": [
               "Isaiah 25:5"
           ]
       },
       {
           "title": "Help us to navigate this difficult season in Nigeria by providing wisdom, discernment, and courage and political will to our leaders to know what to do and to do it according.",
           "scriptures": [
           ]
       },
       {
           "title": "Fulfill your prophecies over the Nation Nigeria 'Nigeria will be known for corruption worldwide but the tide will turn and Nigeria will also be known for righteousness worldwide. Many shall take hold of him that is a Nigerian, saying, “We will go with you, for we have heard that God is with you.”’ —S. G. Elton. Let there be no delay, let there be no postponement. Let righteousness spring forth from all facets of our national life.",
           "scriptures": [
           ]
       },
       {
           "title": "Father, deliver Nigeria from the grip of the wicked, we terminate every contention against the prophetic agenda for Nigeria in Jesus's name. ",
             "scriptures": [
                "Jeremiah 15:21",
                "Isaiah 49:24-26"
           ]
          
       },
       {
           "title": "Nigeria arise and shine. Come out of darkness, violence, anarchy, shame and obscurity. Arise and fulfil your prophetic destiny.",
           "scriptures": [
               "Isaiah 60.1"
           ]
       },
       {
           "title": "Father, pour out your blessings upon Nigeria, that we may experience prosperity, stability, and harmony. In the name of Jesus, we pray for restoration, transformation, and hope for Nigeria. May your light shine upon our nation, bringing peace, progress, and prosperity to every corner of our land. Amen.",
             "scriptures": [
           ]
       }
       ,
       {
           "title": "Father, let the fame of Nigeria spread abroad. Let every other nation favour her and go out of their way to do her good. ",
             "scriptures": [
                "Mark 1:28"
           ]
       }
       ,
       {
           "title": "Father reawaken your church in Nigeria to take her rightful place in every sector and defend your name oh God.",
             "scriptures": [
           ]
       }
      
   ]
},

{
    "date": "August 27",
   "title": "ANOINT MY HEAD WITH OIL",
   "scriptures": [
       "1 Samuel 16:11-13"
   ],
   "anchor_passage": "And Samuel said unto Jesse, Are here all thy children? And he said, There remaineth yet the youngest, and, behold, he keepeth the sheep. And Samuel said unto Jesse, Send and fetch him: for we will not sit down till he come hither. And he sent, and brought him in.\nNow he was ruddy, and withal of a beautiful countenance, and goodly to look to. And the LORD said, Arise, anoint him: for this is he. Then Samuel took the horn of oil, and anointed him in the midst of his brethren: and the Spirit of the LORD came upon David from that day forward. So Samuel rose up, and went to Ramah.” 1 Samuel 16:11-13.\n\n“Thou preparest a table before me in the presence of mine enemies: thou anointest my head with oil; my cup runneth over. Surely goodness and mercy shall follow me all the days of my life: and I will dwell in the house of the LORD forever.” Psalms 23:5 - 6.",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Heavenly Father, thank you today for the things you have put in place for my dominion upon the earth. Thank you for the gift and power of the Holy Spirit freely given to us your beloved ones in this generation.",
           "scriptures": [
              
           ]
       },
       {
        "title": "The grace that handpicks a man for unprecedented favour, influence and effort, Heavenly Father, please give it to me.",
        "scriptures": [
           
        ]
    },
       {
           "title": "My head! Become the target of God's anointing in my generation in Jesus name.",
           "scriptures": [
           ]
       },
       {
           "title": "That gathering where my relevance and glory is to be announced, hold speedily and now! Let there be a supernatural and divine orchestration that will bring it to pass now! In Jesus name.",
           "scriptures": [
               
           ]
       },
       {
           "title": "By the urgency of the divine assignment and ordination of God for me, let the anointing of the Spirit locate me speedily. Let me become another man: man of the anointing, today!",
           "scriptures": [
           ]
       },
       {
           "title": "The Spirit of God that moves a man forward by the anointing, perform your anointing work in my life, and move me forward in Jesus name.",
           "scriptures": [
           ]
       },
       {
           "title": "All divine facilitators of the divine mandate concerning my life and destiny, begin active work towards my progress now in Jesus name.",
           "scriptures": [
           ]
       },
       {
           "title": "Heavenly Father, anoint my head with the oil of the Holy Spirit for dominion,and for subduing my sphere of influence, the enemies' presence notwithstanding. I enter into dominance and abundance by the overflowing anointing of the Holy Spirit upon me henceforth.",
             "scriptures": [
           ]
          
       },
       {
           "title": "Let your oil upon my life attract the gentiles and even kings to the saving knowledge of Christ in Jesus name. ",
           "scriptures": [
               "Isaiah 60:1-3"
           ]
       },
       {
           "title": "Father, cause me to arise as a deliverer in my lineage, in my community and nation to destroy every goliath in my generation. Father, raise true deliverers for our nation Nigeria in Jesus name.",
             "scriptures": [
                "Obadiah 1:21",
                "Isaiah 52:1-2"
           ]
       }
   ]
},

{
    "date": "August 28",
   "title": "GREATER FRUITFULNESS IN OUR REAWAKENING AND MISSION EFFORTS",
   "scriptures": [
       "Acts 19:17-20"
   ],
   "anchor_passage": "And this was known to all the Jews and Greeks also dwelling at Ephesus; and fear fell on them all, and the name of the Lord Jesus was magnified. And many that believed came, and confessed, and shewed their deeds. Many of them also which used curious arts brought their books together, and burned them before all men: and they counted the price of them, and found it fifty thousand pieces of silver. So mightily grew the word of God and prevailed Acts 19:17–20",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Lets bless the name of the Lord for the vision of the MIV and for the favour, fruits and exploits He has been giving us in all our reawakening and mission efforts.",
           "scriptures": [
              
           ]
       },
       {
           "title": "We pray that in this new year, the Lord God Almighty will move mightily among us and through us, the name of Christ shall continually be magnified our conferences and programmes.",
           "scriptures": [
           ]
       },
       {
           "title": "We pray that by our outreaches and conferences the name of Jesus will spread to new territories, peoples, and audience, and that the word of God shall continually prevail and be glorified. Amen.",
           "scriptures": [
            
               
           ]
       },
       {
           "title": "Let's pray for open doors for greater fruitfulness for our mission and reawakening efforts, we break forth to the right and to the left planting churches and making Jesus known",
           "scriptures": [
               "Isaiah 54:2-3"
           ]
       },
       {
           "title": "We pray that by us, and by our obedience to the gospel commission this year, the word of God will breakthrough new grounds, prevail and permeate the unreached places of the earth. Father, open the door of the middle east(Bahrain,Iran, Iraq, Israel and Occupied Palestinian Territories, Jordan, Kuwait, Lebanon, UAE, Oman)unto us for a lasting and fruitful mission engagement in Jesus name. ",
           "scriptures": [
               "Acts 2:8-9"
           ]
       },
       {
           "title": "Everywhere we take the gospel campaign to, or that we have already stationed the gospel campaign, the fear and reverence of the Lord will be upon and over all the people and land. And as a result, they shall not be able to resist the gospel we bring to them. Amen",
           "scriptures": [
           ]
       },
       {
           "title": "We ask that all of our programmes, outreaches and campaign will consummate to greater harvests and glorification to the name of God our Father and of our Lord Jesus Christ. Amen.",
             "scriptures": [
           ]
          
       },
       {
           "title": "Father, cause MIV to enter a new season of your power from this time onwards; let mighty miracle be performed by the hands of all our missionaries to make Jesus known in their various fields in Jesus name.",
           "scriptures": [
           ]
       }
   ]
},

{
    "date": "August 29",
   "title": "MY GATES SHALL BE OPENED CONTINUALLY, THEY SHALL NOT BE SHUT",
   "scriptures": [
       "Isaiah 60:9-11"
   ],
   "anchor_passage": "Surely the isles shall wait for me, and the ships of Tarshish first, to bring thy sons from far, their silver and their gold with them, unto the name of the LORD thy God, and to the Holy One of Israel, because he hath glorified thee. And the sons of strangers shall build up thy walls, and their kings shall minister unto thee: for in my wrath I smote thee, but in my favour have I had mercy on thee.\n\nTherefore, thy gates shall be open continually; they shall not be shut day nor night; that men may bring unto thee the forces of the Gentiles, and that their kings may be brought.Isaiah 60:9 – 11. Thus saith the LORD to his anointed, to Cyrus, whose right hand I have holden, to subdue nations before him; and I will loose the loins of kings, to open before him the two leaved gates; and the gates shall not be shut; I will go before thee, and make the crooked places straight: I will break in pieces the gates of brass, and cut in sunder the bars of iron: And I will give thee the treasures of darkness, and hidden riches of secret places, that thou mayest know that I, the LORD, which call thee by thy name, am the God of Israel. Isaiah 45:1 – 3.",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Father, thank you for your grace and strength since the beginning of the month, thank you my season of harvests of answers have come.",
           "scriptures": [
              
           ]
       },
       {
           "title": "Father, I thank you for opening unto me gates that cannot be shut,thank you for deliverance from every affliction, thank you for bringing me to a new season of grace and fruitful prayer life henceforth.  ",
           "scriptures": [
               "Revelation 3:8"
           ]
       },
       {
           "title": "Heavenly Father, raise for me helps from far and near, from amongst familiars and strangers, in Jesus name. Let my helper not be few.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Father glorify me by the events you will permit in and around my life henceforth. Let events that serves as signs of someone the Lord has glorified begin to take their turns in my life in Jesus name.",
           "scriptures": [
           ]
       },
       {
           "title": "Heavenly Father, Let my gates of abundance by the Lord continually remain open for me, in every season, let them never ever be shut. By your right hand, keep my gates of supernatural supplies and abundance open forever, in Jesus name.",
           "scriptures": [
           ]
       },
       {
           "title": "Heavenly Father, Let my gates remain open, and let the wealth and resources of the nations and their rulers become accessible by me without any hindrance or limitation in Jesus name.",
           "scriptures": [
           ]
       },
       {
           "title": "As the one anointed and held up by the Lord, I subdue nations and territories, and command their gates to open for me in Jesus name.",
             "scriptures": [
           ]
          
       },
       {
           "title": "By the anointing of the Holy Spirit upon me, I gain spread and increasing influence in all areas and spheres of life I feature in or will feature in, in the name of Jesus.",
           "scriptures": [
           ]
       },
       {
           "title": "Heavenly Father, as I break through and into new grounds by your word, please go before me and make my journey and passage easy and comfortable. Remove every opposition and obstacle before me, in Jesus name.",
             "scriptures": [
           ]
       },
       {
           "title": "By the revelations, insights and unveilings of the Lord, I receive access to wealth, treasures and riches hidden or kept away in secret, undisclosed or undiscovered places of the earth or Spirit realm. They are made bare and brought to the surface for my exploitation in Jesus name.",
             "scriptures": [
           ]
       },
       {
           "title": "Thank you for opened heaven upon the Prayer conference this week, thank you father that you will not pass me by, thank you father for the release of your fire upon everyone that will be gathered. Father, do something eternal in our lives in this conference; do something that we will never recover from in Jesus name.",
             "scriptures": [
           ]
       }
   ]
},



{
    "date": "August 30",
   "title": "PRAYER FROM MIV LIBERIA MISSIONS",
   "scriptures": [
   ],
   "anchor_passage": "Liberia, a nation located on the West Coast of Africa with an area of 111,370 square kilometers bounded in the west  by Sierra Leone, in the East by Cote D’ivoire, in the north by Guinea Conakry and in the South by Atlantic ocean with the population of about 5 Million People (2022 Census data} with the capital located in Monrovi",
   "Discussion_title": "",
   "prayer_foci": [
       {
           "title": "Thank God also for the working of the Holy Spirit through the lives of our Second and Third generation missionaries.",
           "scriptures": [
              
           ]
       },
       {
           "title": "Thanks God also with us for the provisions for the sustenance of the efforts through our Board, Partners and Friends of the missions. ",
           "scriptures": [
           ]
       },
       {
           "title": "Pray for more outpouring of the Holy Spirit, increasing grace and more fruitful impact through our efforts in Liberia.",
           "scriptures": [
               
           ]
       },
       {
           "title": "Ask the Lord to breathe upon our Church Planting, Training and Discipleship efforts in the nation of Liberia that through it more kingdom labourers shall be released by the Lord to the field of harvest.",
           "scriptures": [
           ]
       },
       {
           "title": "Pray for the MIV Liberia School of Strategic Evangelism and Missions which is in progress that God will use it to raise more laborers for the end time harvest. Also commit the MIV/STEM/ SET 11 that as we go for the First Practical Outreach in August 16th to 18th, in Bomi County that God will confirm his words with signs and wonders and establish our labor with more souls into the Kingdom.",
           "scriptures": [
            "Acts 2:42-47"
           ]
       },
       {
           "title": "Pray for more kingdom Partners and helpers for the Liberia Missions, and that God will meet our partners at the points of their needs and stair up their hearts towards this great mandate",
           "scriptures": [
            "Philippians 4:19"
           ]
       },
       {
           "title": "Pull down every stronghold rising against our missionary efforts in Liberia. Pray against the influence of drugs, immorality, alcoholism, violence, corruption, against every manipulations of witch crafty in the Land.",
             "scriptures": [
                "Isaiah 49:24-26"
           ]
          
       },
       {
           "title": "Ask the Lord to send us help concerning the ongoing construction project of the MIV Liberia Leadership & Missions and Prayer Resorts",
           "scriptures": [
            " Zechariah 4:6",
            " Zechariah 4:7",
            " Zechariah 4:9"
           ]
       },
       {
           "title": "Ask God to grant us wisdom to establish a permanent base, structure and make lasting discipleship in Liberia, Sierra Leone and Guinea Conakry. Also, pray for gifts of men apportioned to our mandates in due season.",
             "scriptures": [
           ]
       },
       {
           "title": "Pray with us as we coordinate the Counseling Committee for the Global Crusade with Pst. Kumuyi of DEEPER LIFE BIBLE CHURCH in November 2024 for Liberia",
             "scriptures": [
           ]
       },
       {
           "title": "Pray with us for provisions to extend the MIV Missions to Guinea Conakry and Sierra Leone.",
             "scriptures": [
           ]
       },
        {
           "title": "Furthermore thank God for all our missionary children and pray that God will send timely help in relation to their education and upkeep",
             "scriptures": [
           ]
       },
        {
           "title": "Pray for the families of Odedeles , Moses, Francois and Dennis with other members of the team for protection, guidance, provisions and renewed grace",
             "scriptures": [
           ]
       }, 
       {
           "title": "Finally thank God because He will do exceeding, abundantly above all we can ask or think through His power at work in us. Amen",
             "scriptures": [
           ]
       }
   ]
}

]


