[
    {
        "date": "January 1",
        "title": "THE BEGINNING AND THE END",
        "reference": "Revelation 1: 7-17",
        "scripture": "I am Alpha and Omega, the beginning and the end, the first and the last. Revelation 22:13",
        "text": " No matter how fast you are, you cannot outrun God. Before you start the race, He is the Alpha. When you are ending the race, you will meet Him there as the Omega. It is futile to embark on any journey in life hurriedly without giving God His place in your desires and aspirations. \n\nThe God who was, the God who is, and the God who is to come is the Sovereign-Strong God. He is the Almighty. Not only is it impossible to outrun or outsmart God in your ambitions, there can be no lasting and meaningful success in life's pursuits if the Lord is not in it. \n\nBegin your projects, business, plans, career pursuit, ministry programs, journey of three hundred and sixty-five days and beyond, and every other thing with God. Commit them into the hand of God in prayer. Trust God to help you and God, who is the beginning will start with you. He will go ahead of you to secure your success and smooth enterprise. He will bring all agitations over your life to a standstill. Whatever poses itself as an obstacle to your progress and joy will be crushed by God's mighty power (Isaiah 48:12-13). When you are completely yielded to God in your decision making, the First and the Last will place His right hand of power over you to grant you boldness, speed and success. Do not be afraid, Jesus says to you as you navigate this hitherto uncharted course (Revelation 1:17). Every step of the year will be to your benefit if you will only trust in God absolutely.",
        "action_plan": "Before you take further steps into the unknown territory, ask the Lord to lead you with His map.",
        "thoughts": " I'm the One who named you! I'm the One. I got things started and, yes, I'll wrap them up (Isaiah 48:12, MSG).",
        "prayer": "Lead me Lord by Your Spirit into this new year. Guide all my steps. Be ahead of me to direct and behind me to defend me in Jesus' name. Amen."
    },
    {
        "date": "January 2",
        "title": "THE INCOMPARABLE GOD",
        "reference": "Isaiah 40:15-27",
        "scripture": "To whom then will you liken Me, or to whom shall I be equal? says the Holy One. Isaiah 40:25",
        "text": " Men reign in tenures and seasons. The president quits his seat when his tenure in office is over. A king dies and he is replaced by another after his reign. Sometimes coup d'etat takes away stubborn military leaders. Price and award winners change. \n\nThe gold medallist today may not be the celebrity of tomorrow. This shows the corruptibility of human trophies and achievements. But our God reigns supreme and forever. There is no change of tenure with Him. He was not appointed; He cannot be terminated-no death; no coup; no retirement from office. \n\nOur God has neither rivals nor equals. He cannot be compared to anyone or anything. He is unequalled, unparalleled and beyond comparison. From eternity past to eternity future, He is the never-changing constant. Such a supreme being deserves our worship without reservation since He is not expiring tomorrow or at any time. It is futile to trust in man or horses: they all will perish. God, our creator, is the Potter while we are the clay (Isaiah 64:8). He is the Shepherd; we are the sheep (Psalms 100:3). He is the Vine and we are the branches (John 15:1-2). Our variable life can only be made certain if we depend solely on the constant God. Our limited knowledge can only be expanded by His limitless wisdom. We fluctuate with the seasons of life but the strength of Jehovah keeps us steadfast and sure. He is the immoveable Rock. If we hold on to Him, we will never be moved too.",
        "action_plan": "Pray about every decision you take today. Be intentional in asking the Lord for direction.",
        "thoughts": "Know ye that the LORD, He is God: it is he that hath made us, and not we ourselves; we are his people, and the sheep of His pasture (Psalms 100:3).",
        "prayer": "There is no me without You Lord. My branch is a function of the Vine. I am Yours, and You are mine, Lord Jesus."
    },
    {
        "date": "January 3",
        "title": "DIVINE ILLUMINATION",
        "reference": "Genesis 1:1-5",
        "scripture": "\"The sun shall no longer be your light by day, nor for brightness shall the moon give light to you; But the LORD will be to you an everlasting light, And your God your glory. Isaiah 60:19",
        "text": " One of the most important considerations when people are moving house is the availability of electricity in the community. Whereas you can get a lot of work done during the day, it is not so at night. You can move around more easily during the day than at night. \n\nThe darkness that prevails at night limits what you can do ordinarily. Hence the consideration for the availability of electricity. With electric power, the darkness of the night is pushed aside as light comes on. There is something about light that makes the heart lighter. At creation, the earth was covered in darkness till God spoke light into being. Then He separated the darkness from the light and made a distinction between day and night. This distinction has remained throughout the ages as we receive light form the sun in the daytime and from the moon at night. In fact, man has gone as far as to tap into the energy from the sun to power devices and even light up the night.  \n\nConsider then our focus verse for today - the Lord Himself will be our light, not the sun or moon. If the One who called the light we now enjoy into being says He Himself will be our Light, how great will that Light be! Nothing can be hidden from us when the Lord is our Light. No more obscurity; no more confusion. Even the hidden riches of the Gentiles shall become exposed to us for the taking. And He is not just our Light for a day, but for eternity!",
        "action_plan": "Ask the Lord Jesus to illuminate your path, especially where you think there is confusion or uncertainty.",
        "thoughts": "For a man whose Light is the Lord, men will wonder at the accuracy of his predictions, efficiency of his labour, effectiveness of his service life.",
        "prayer": "In Your Light Lord we see light. Let this Light shine into all the corners and crevices of my life and brighten my path."
    },
    {
        "date": "January 4",
        "title": "EXPERIENTIAL KNOWLEDGE OF GOD",
        "reference": "1 John 1:1-10",
        "scripture": "That which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked upon, and our hands have handled, of the Word of life. 1 John 1:1",
        "text": " Our faith in God often needs a God-touching experience to be kept alive. The text above revealed that John was truly persuaded and convinced about His Master when he wrote: From the very first day, we were there, taking it all in-we heard it with our own ears, saw it with our own eyes, verified it with our own hands. \n\nThe Word of Life appeared right before our eyes; we saw it happen! And now we're telling you in most sober prose that what we witnessed was, incredibly, this: The infinite Life of God Himself took shape before us. A songwriter wrote: Let me touch You and see if You are real. The children of Israel knew about God but they did not know God. They lacked a God-touching experience. Little wonder they wanted a god (a golden calf) they could see and touch. \n\nA God-touching experience burns in the heart of the recipient. Jacob could not shake off the reality of Yahweh after his post-fight dislocated joint. God was real to Moses after the burning bush experience. Paul needed no soothsayer to tell him that Jesus is Lord after the Damascus Road encounter. Now is the time to touch the Lord and see that He is real in your life. Like Moses, touch Him in devotion until He shows you His glory. Like Paul, touch Him in prayer until you experience His third heavens. Like the disciples, touch Him in communion until you see Him transfigured. Stay connected until He burns His love into your spirit.",
        "action_plan": "Stop quoting the experience of others about God. Desire (in a personal retreat) a life-changing encounter that you can always relate to.",
        "thoughts": "A man without a personal experience of God will soon be swept away by the cunning craftiness that pervades the world today.",
        "prayer": "Lord Jesus, I want to know You as I am known with no doubt in me about your Being."
    },
    {
        "date": "January 5",
        "title": "ON THE LORD'S DAY: WITHOUT HIS PRESENCE",
        "reference": "Exodus 33:1-6",
        "scripture": "And when the people heard this bad news, they mourned, and no one put on his ornaments. Exodus 33:4",
        "text": " When you hear the term bad news what comes to mind? Probably that someone has died, a job loss or something or other of that nature. Here we see something of a very different nature being termed bad news. \n\nThe people went into mourning not because of a death or any such thing but because God told them to go on without Him.\n\nSomeone may be tempted to think there is no problem with the statement in the first three verses of our reading today. After all God was only saying He wouldn't go personally with them, He would still send His angel. \n\nThe children of Israel did not receive the news of God not going with them pleasantly. They mourned. If you have ever tasted the grace of God, if you have ever witnessed the power of His outstretched arm, if His hand has ever been revealed to you, you will never desire a moment without the Lord's presence. The children of Israel had seen God at work and hence, were sad to know He would no longer go with them. When God is present, we enjoy the weight of His glory. \n\nEven the greatest of mountains skip like ram before His face. Sweet is bitter if the Lord is not in it. Success is a mirage if the Lord has departed from us. Losing God's presence is losing everything. Being without His presence is the definition of vulnerability. It is time to desire God's presence in daily fellowship and personal spiritual discipline of prayer and word study.", 
        "action_plan": "Ask the Lord to be present in all you do today: eating, meeting people, working, sleeping, everything.",
         "thoughts" :"When the Lord's presence leaves a man, it is a time of mourning.",
         "prayer": "Lord, I don't want to live without Your presence in my life. Guide me by Your Spirit Lord that I may not focus on the works of Your hand to the detriment of a relationship with You. Amen."
    },
    {
        "date": "January 6",
        "title": "THE EDGE OF HIS PRESENCE",
        "reference": "Exodus 33:12-17",
        "scripture": "\"For how then will it be known that Your people and I have found grace in Your sight, except You go with us? So, we shall be separate, Your people and I, from all the people who are upon the face of the earth.\" Exodus 33:16",
        "text": " Going to an unfamiliar institution to seek for a job can be a nerve-wracking experience. If you were attending an interview in a company, you might be visibly anxious because your fate is unknown among many other similar job seekers. But what if you had a strong recommendation note from the company's CEO to be presented to the panel of interviewers? Certainly, your state of mind will be different. \n\nYou will be more relaxed as you approach the premises. The letter in your hand will bring assurance of a positive outcome. The note in this example is like having the presence of the company's CEO with you as you go. That note says to anyone, this person is favoured already. Anyone in the company who reads the note has no choice but to grant your request because of the name of the writer. \n\nThis is what Moses demanded as he requested God's presence. The only thing that could differentiate the Israelites from the surrounding nations was the presence of the Lord. Coming from a life of slavery, they had no chance against the warring tribes they were going to meet. In the same way we need the presence of the Lord to conquer everything that is coming against us in our world today. We face the same challenges of life that the world faces daily. In a highly competitive world, we need a special enablement that will give us an edge and leverage where others struggle.",
         "action_plan": "Identify areas of your life endeavour where the terrain seems to be saturated. Ask the Lord for a lifting by His presence.",
         "thoughts": "The presence of the Lord in the life of the believer makes all the difference.",
         "prayer": "Father, let Your presence speak for me everywhere I go today. Give me an edge of favour in Jesus' name. Amen."
    },
    {
        "date": "January 7",
        "title": "A MAN OF HIS PRESENCE",
        "reference": "Exodus 33:7-11",
        "scripture": "So, the LORD spoke to Moses face to face, as a man speaks to his friend. And he would return to the camp, but his servant Joshua the son of Nun, a young man, did not depart from the tabernacle. Exodus 33:11",
        "text": " Joshua the son of Nun and the servant of Moses did not come into prominence until he, along with Caleb brought a positive report when they returned form spying the Promised Land. In Numbers 14:6-9 we see Joshua and Caleb trying to convince the people of their ability in God to conquer the land. \n\nThis singular act of confidence in God saw them becoming the only two who were above 20 years at the time of the Exodus who entered the Promised Land. In fact, Joshua was chosen to lead the people as Moses's successor. \n\nWhat was the secret of Joshua's confidence? He was a man of God's presence. Beyond serving Moses, he developed his own relationship with the Lord. In our reading for today we see the people worshipping from afar, at their tent doors while Moses went to the tabernacle. Even Moses left the tabernacle to go to his own tent. But Joshua lived in the tabernacle. He did not depart from the tabernacle. He was with Moses and the 70 elders who had a meal with God in Exodus 24 and he stayed with Moses through the 40 days on the mountain. No wonder he was able to do exploits for God. Before conquering Jericho, he went out meditating and received instructions for the battle (Joshua 5:13-6:5). He was the one who commanded the Sun to stand still (Joshua 10:12-13). If you are going to conquer the world with great exploits, be ready to spend time in God's presence.",
        "action_plan": "Be determined to go out for the Lord and do great works for Him. But first, tarry and be endowed with His presence.",
        "thoughts": "A man who is constantly on his knees before God comes out standing tall before men.",
        "prayer": "If I am going to do much for You Lord, I must be much with You. May my constant desire be to remain ever in Your presence dear Lord. Amen."
    },
    {
        "date": "January 8",
        "title": "RULE OVER YOUR SPIRIT",
        "reference": "Proverbs 25:21-28",
        "scripture": "Whoever has no rule over his own spirit Is like a city broken down, without walls. Proverbs 25:28",
        "text": " The fire kindled by the emotions of many have erupted into pride, anger, revenge, malice, hatred, and the like. This fire of untamed emotions is the reason the world continues to tolerate all kinds of sexual pervasiveness. This evil of being yourself has damaged the minds of many people and they cannot withstand little pressures. \n\nA little disagreement in the home, the couple is filing for divorce. A brief moment of misunderstanding, decades of friendship are thrown away. No one is calm enough to look for ways to mend the broken hedges. The above scripture emphasises the need for emotional continence. It is easier to lose your temper than to keep your cool. It sounds more reasonable to retaliate than to play the fool who turns the other cheek. Indeed, a man who can tame his emotions is stronger than one that takes a whole city! More than ever before, you will be tempted to get angry and sin; people who are close to you will deliberately or unintentionally make you angry. \n\nYour ego will want to speak in the face of insult. Your love for convenience will want to override your love for God. Your life is a walled and fortified city. If you allow your emotions to ruin things, your walls will be broken down and wild beasts will come in and dominate. But if you tame it using the strength supplied daily by Jehovah Sabaoth, your gated city will be defended. It will only be accessible to noble character and lifestyle.",
        "action_plan": "Set boundaries over your emotions: 1)Take a brief moment before you reply to text messages and emails especially when you are hurt. 2)Forgive anyone who has hurt you. 3) Go and reconcile.",
        "thoughts": "He that is slow to anger is better than the mighty; and he that rules his spirit than he that takes a city (Proverbs 16:32).",
        "prayer": "Lord, I submit my emotions to You. Give me inner strength to curtail its excesses and outward grace to express its virtues. Amen."
    },
    {
        "date": "January 9",
        "title": "THE INNER STRENGTH",
        "reference": "Psalms 118:5-17",
        "scripture": "The Lord is my Strength and Song and is become my Salvation. Psalms 118:14",
        "text": " Many marriages fail while homes break more easily and readily today because of lack of inner strength to persevere and withstand adversity. The same life stressors that make someone depressed and suicidal have no effect on another man with inner strength. We can learn of inner strength from palm tree. \n\nAlthough delicate-looking, palm trees are quite resilient. God has given them such strength that they can withstand windspeeds of up to 145 miles per hour. Even hurricanes that uproot other trees and destroy buildings leave palm trees unscathed. Emotional strength is a God-given internal resilience that allows you to bend without breaking. A life endowed with such ability may bend, but he snaps back with such a momentum that ensures accomplishment. He simply shakes off the beast of disappointment, loss or dire need into the fire of prayer and praise and they do him no harm (Acts 28:5). \n\nThere are dull moments in life: periods of grey clouds, cold and wet days with no ray of sunshine. But the Lord gives us spiritual energy to overcome in difficult times. Today, get a loading dose of inner strength from the words of Jesus Himself: In this godless world you will continue to experience difficulties. But take heart! I've conquered the world\" (John 16:33b). With this word of assurance, get into your day and face each challenge with the knowing smile of a conqueror on your face. It is well with you.",
        "action_plan": "Note the intimidating tasks ahead of you today. Pray until the burdens of the tasks are lifted. Then go ahead and do as the occasion demands. Victory shall follow in Jesus name.",
        "thoughts": "While outward displays of strength only touch the surface of the problem, inner strength demolishes evil from the root.",
        "prayer": "In the name of Jesus, I receive the emotional strength I need for each day. I master the challenges I face and conquer the obstacles on my way. I will not succumb to fear of failure or defeat. Amen."
    },
    {
        "date": "January 10",
        "title": "A CALM SOUL",
        "reference": "Psalms 42:1-11",
        "scripture": "Why are you cast down, O my soul? And why are you disquieted within me? Hope in God; For I shall yet praise Him, The help of my countenance and my God. Psalms 42:11",
        "text": " Have you ever waited for something, and it seems to be eluding you? The more you long for it, the farther it appears to go. Gradually your anticipation and excitement begin to give way to desperation, then discouragement and finally doubt and depression. \n\nSuch was the case of Abraham after he had believed God that he would have a son, but he became tired of waiting because his strength of waiting failed. He asked, God, I go childless and the heir to all my belongings is this slave-boy. \n\nThen he got a reassurance in God (Genesis 15:2-3). Hope deferred makes the heart sick (Proverbs 13:12). But the medicine for the weary life is to speak the Word of God again and again to your desperate soul. No one can address your soul like you. Command it now: Come on Soul! Get up from the dust of self-pity and listen to the word of the Lord. The strength of Israel never fails. His Word is always yes and amen. He is coming through for you right now. Say this to every depressing situation in your life and watch the Lion of the Tribe of Judah come through for you. There is no time for depression: there is only time to prepare for celebration of accomplishment. Keep putting your hope in God. Keep on keeping on. You are closer to your victory than when you started. The strength of hope is reinforced by your constant rumination on the promises of God from His Word.",
        "action_plan": "For every anxious worry you have, write down scriptures that strengthen your faith, trust and hope in God.",
        "thoughts": "The strength of the rope of hope is reinforced by the promises in the word of God.",
        "prayer": "Every head bowed in shame shall be lifted. Every thirst in my soul shall be filled with the Living Water. Every longing in my heart shall be met today in Jesus' name. Amen."
    },
    {
        "date": "January 11",
        "title": "LIGHT UP YOUR WORLD",
        "reference": "Matthew 5:13-20",
        "scripture": "Nor do they light a lamp and put it under a basket, but on a lampstand, and it gives light to all who are in the house. Matthew 5:15",
        "text": " The influence of light cannot be overemphasized. There is something about light that makes it attractive: the colour, the illumination, the energy and the warmth. Little children in the village will gather around a fire in the evening as they play. \n\nIn addition, to giving them light to see, it also keeps them warm from the cold. Even flies gather around the fire. In the morning, everyone anticipates the first light. Without any noise, it shoots out from the sky and brightens the day. The flowers sprout in the direction of the sunlight and plant lives are thrilled by it. \n\nJust as an unlit candle is not fulfilling its destiny, a Christian who is not manifesting the life of Christ is not fulfilling purpose (1 Peter 2:9). When you are lit up for God, men will generally flock towards you. You become the centre of attraction. You bring a rare wisdom to the table that is superior to all existing argument. You trade with such an uncommon strategy that only the Holy Spirit can inspire. You teach with such an unusual authority that attracts men to your destiny. You lead with such grace that it is easy to follow you. Shine and burn for God, beloved; and people will queue to watch your life. Stop hiding your candle under the table. Ask the Lord to ignite you afresh with His Spirit and power. He will empower you with great wisdom in the marketplace, rare potential for good capacity delivery, and sound mind that beats the imagination of your teachers.",
        "action_plan": "Pen down any two (2) reasons why you are not manifesting excellence in your life endeavours. What practical steps will you take to address them? Ask the Lord Jesus to make your life glow with honour.",
        "thoughts": "I am a carrier of Jesus: the greatest influence the world needs for a positive change.",
        "prayer": "Let my life have a more superior quality than the ones around me that I may pour from the riches of Your love and grace in me to all who thirst and hunger for life in Jesus' name. Amen."
    },
    {
        "date": "January 12",
        "title": "ON THE LORD'S DAY: WOMAN THOU ART LOOSED",
        "reference": "Luke 13:10-17",
        "scripture": "So, ought not this woman, being a daughter of Abraham, whom Satan has bound-think of it-for eighteen years, be loosed from this bond on the Sabbath? Luke 13:16",
        "text": " It was the Sabbath, the day of rest but here was a daughter of Abraham who was under the bondage of oppression by the devil. She never had rest from her troubled health. She was bent over and could not stand tall among her peers. \n\nThe devil did not care whether it was Sabbath or weekday, he troubled her health day and night. Daytime immobility and pain, nighttime of sleeplessness and worries over her infirmity. And this terrible oppression continued unabated for eighteen years. What was amazing is that this woman would not miss church. She never said, I am tired and weary and in despair, I don't think I will fellowship with God's people today. \n\nShe had attended well over 900 Sabbaths like this since her infirmity started. Like she would normally do, there she was at her seat, attentive to the teachings of Jesus. It was supposed to be a Bible Study, not a miracle service (Luke 13:10). The service began like any other one but ended on the highest note any of the parishioners could ever wish for in over eighteen years! Hallelujah. No two of the Lord's Days are the same. Every time you come to His presence, come with an expectation. Whatever burden has bowed your head in shame is about to be lifted. It may not look like it at the beginning, but Jesus is coming for you. You have loaded your heavens with prayers, it is time for Him to fill your eyes with tears of joy.",
        "action_plan": "Write out that situation that bows your head in shame. Drop it before God, in His sanctuary as you pray.",
        "thoughts": "Jesus is saying to you today: Daughter (Son), thou art loosed from thine infirmity!",
        "prayer": "Father, I cast all my cares, worries and burdens that have bowed my head low before You today. Make this day a special day of deliverance for me in Jesus' name. Amen."
    },
    {
        "date": "January 13",
        "title": "COURAGE TO FACE CHALLENGES",
        "reference": "Acts 20:17-31",
        "scripture": "But none of these things move me; nor do I count my life dear to myself, so that I may finish my race with joy  Acts 20:24",
        "text": " Paul, Barnabas, and other disciples showed a tremendous courage in the face of oppositions and trials, and they came out victorious. Apostle Paul set his face like a flint, made the Lord his succour and fulfilled the task of reaching out to the gentiles despite the persecutions (Acts 20:24). \n\nPeter and the other apostles on the other hand remained in Jerusalem, also fulfilling their own God-given mandate. Have you discovered your portion in the Kingdom service? Then pursue it with passion and bravery so you can attain God's goal for your life. When you are a daring believer, you will convince your employer to choose a godly way of actualizing a goal even if the method is unpopular. A daring person is a risk taker, but he must be courteous, respectful, and polite in making godly choices.\n\n He is not intimidated by threats of withdrawal of privileges when taking a stand for godly choices. She trusts the Lord to raise help for her as she stands out in honour of God's name. Like Joseph, facing opposition, hostility, or delayed promotion is not enough to deter a courageous believer. Don't be fearful: the Lord will defend you. However bitter the situation may be, put your trust in God. He will vindicate you. By faith, David subdued kingdoms and Daniel stopped the mouth of lions (Hebrews 11:32-34). The host of heaven is waiting to add your name to the Divine Book of Exploits as you remain unflinching in the face of opposition.",
        "action_plan": "What challenges have you run away from previously? Face them now with courage knowing that the Lord is backing you up.",
        "thoughts": "Courage in the face of challenges and opposition is the requirement to subdue nations.",
        "prayer": "Dear Lord, I make a pledge to live for You. Whatever difficulty I may face, at home, work, or elsewhere, help me to remain steadfast and true to the principles of Your word in Jesus' name. Amen."
    },
    {
        "date": "January 14",
        "title": "THE LIFE OF MORE",
        "reference": "Philippians 3:1-16",
        "scripture": "Not as though I had already attained, either were already perfect: but I follow after, if that I may apprehend that for which also I am apprehended of Christ Jesus. Philippians 3:12",
        "text": " There is a life of superlative: a life that is not satisfied with average and mediocrity. A person who loves to stand before kings and not mean men will pursue this life of more. However, it does not come cheap: it comes with persistence and a resilient character. \n\nIt is a life that consistently looks towards the goal in Christ. It is a life that is deaf to market noises, blind to the threats of limitation and insensitive to the menace of boundaries. A man who will soar with wings like eagles must visualize himself above the storms and rise towards the Sun of righteousness. Such was the life that Paul lived. While he was content with being rich or poor, abounding or being abased, he was never satisfied with having only a little in God. He would not listen to the praise of men when he accomplished a task for God: he pressed on for more. \n\nHe was never deterred by the criticism of the opposition; he pursued the cause of Jesus relentlessly. He would set a target in Christ and not stop at anything until his hand had held the promise and his chest had breasted the tape of his accomplishment in God. Such a life of more befits us as is of becoming saints. Beloved, what is your past spiritual achievement? What goals did you attain previously in an area of endeavour? They pale in comparison to where the Father is taking you to. Do not settle yet. Dust yourself out of the sand of complacency, it is time to seek the Father for a new height, a new task and a new mission in life and ministry.",
        "action_plan": "Check where you are becoming complacent. Pick up from there and advance."
    },
    {
        "date": "January 15",
        "title": "GIVE MORE",
        "reference": "Proverbs 11:23-28",
        "scripture": "There is one who scatters yet increases more; and there is one who withholds more than is right, but it leads to poverty. Proverbs 11:24",
        "text": " Sometimes what you have that seems inadequate to you God sees as an abundance that is more than enough to be shared. Life is not about self-gratification but bringing joy and meaning to others. This is the true definition of being rich. The poorest man who ever lived is the rich man who lived for himself. Testimonies abound in the Bible of men and women who made impact, not because they had much but because they gave more. The measure of your wealth is by your giving and not by your material possession. We have some biblical examples who gave. \n\nRahab gave the roof in her little accommodation to save the Israelite spies and thereby saved her entire household from destruction (Joshua 2:1-16). The widow of Zarephath gave her last meal to rescue the life and ministry of Elijah (1 Kings 17:8-16). The little boy gave his lunch of five loaves and two fish to meet the need of 5000 hungry men (John 6:9-13). The widow in the temple gave her last money for God's work (Mark 12:42-43). These people influenced the lives and destinies of others by their giving. Beloved, you can achieve more by giving more. \n\nYour talents and giftings, your wisdom and encouragement, your money and possessions are all given to you by God, not to be stored away to rot inside of you or in a bank. Determine to be a giver of courage, money, love, help, substance, and everything that the Father has blessed you with.",
        "action_plan": "Give something to someone in need today"
    },
    {
        "date": "January 16",
        "title": "DO MORE",
        "reference": "1 Timothy 4:11-16",
        "scripture": "'Take heed to yourself and to the doctrine. Continue in them, for in doing this you will save both yourself and those who hear you.' 1 Timothy 4:16",
        "text": " Why do people go to the gym or work out? They are either building more muscles or burning off fat. In this way, physical exercise helps to reduce the unwanted fat in the body, replacing it with the needed muscles for physical strength. \n\nExercise, defined as a conscious and purposeful movement of various body parts, is needed to accomplish this. The more exercise a man does, the closer he gets to this goal of fat removal and muscle building. And when he stops the workout, the muscles begin to lose their tone and fat reaccumulates. There is no vacuum in life. If you stop meditating on the word, you will lose the muscle of God's knowledge you once had. This will be replaced by the unwanted fat of reliance on inferior human knowledge. \n\nIf you no longer practice the presence of God, you will gradually be preoccupied with human reasoning and the practice of worldliness. A prayerless Christian fills the void of prayer with a life of worries, doubts, and anxieties. If you stop to worship the Lord in praise, you will inadvertently be complaining and grumbling. Plan to do more. You have been praying for a few minutes, move to the next level. When you do not feel like worshipping God, just be there in His presence, singing unto Him until you flow in. If you have been giving before, increase your giving. Always strive to do more and not less. That is how to build spiritual muscles and do away with spiritual potbelly.",
        "action_plan": "Identify some lifestyle and personal spiritual discipline you need to do more of."
    },
    {
        "date": "January 17",
        "title": "EAT MORE",
        "reference": "John 6:22-29",
        "scripture": "Do not labour for the food which perishes, but for the food which endures to everlasting life, which the Son of Man will give you, because God the Father has set His seal on Him. John 6:27",
        "text": " A brother was glad to listen to the testimony of a lady who just got a job she had really desired for some time. She resolved that she would go back to the church where her prayers were answered and give some money to God's work in the church. She frequently went back to the church to pray for more help from God. However, something was missing in the whole of the testimony: the lady did not seem to have had a personal encounter with the Lord. She enjoyed the miracle of provision and would like to come for more from the same source. Such was the story of the Jews here who ate the physical bread from Jesus. \n\nThey desired to see Him for more bread. Sadly, they did not long for the spiritual bread that would satiate them forever. God asked: Why do you spend your money on junk food, your hard-earned cash on cotton candy? (Isaiah 55:1-2). Jesus made it clear in the passage above that the people needed more than physical food. \n\nThey needed to eat His flesh and drink His blood: this was the ultimate desire of Jesus when He met their temporary needs. The point was to get them into a deeper communion. Thankfully, the brother in the story above led the young lady to Christ. He said to her afterwards: these four things are your commitment to Christ: regular study of the Bible, prayer, fellowship with brethren and witnessing for Christ. If you will do these, you are set for healthier spiritual food that will make you robust in faith.",
        "action_plan": "Increase the quality of your study-both secular and spiritual",
        "thoughts": "Eat good spiritual meal; eat quality and not just quantity; eat for a lasting satisfaction; eat for strength and sustenance.",
        "prayer": "Feed me Lord with the bread of life. Let my hunger for you ever grow. May I continue to desire more of You until I see You face to face, in Jesus' name. Amen."
    },
    {
        "date": "January 18",
        "title": "HELP MORE",
        "reference": "Luke 6:27-36",
        "scripture": "But love your enemies, do good, and lend, hoping for nothing in return; and your reward will be great, and you will be sons of the Most High. For He is kind to the unthankful and evil. Luke 6:35",
        "text": " Have you ever felt the need to stop being good to people because they never appreciate it? Many an act of ingratitude continually irritate our good works, making them look like thankless jobs. \n\nThe people for whom you are fasting are busy feasting. Some are repaying evil for the good you do. Others backbite for the kind gesture you show. Some will try to take your position at work because you dared to open up to them. Sadly, many bowels of mercy and kindness have been shut against people who are in genuine need because of the past experiences of the benefactor. Jesus was no stranger to that kind of attitude from men, but He did not stop doing good everywhere He went. Where were those 5000 He fed during His trial? Where were the lepers, the blind, the multitudes that listened to Him and those who enjoyed the miracles He performed? Whatever the response from men, Jesus was not distracted from His course: He came to help mankind, to save us and to destroy the works of the devil. He would not react to people's hostility. \n\nHe focussed on the purpose for which He left His throne above to mingle with us. Yes, people will continue to need help. That is why God strategically positioned you to help them. Unfortunately, many of the recipients of your help will not be mature enough to appreciate it. Do not allow your past experiences to deny you of the blessing of helping others. When you see another brother, sister, or neighbour in need, be ready to help.",
        "action_plan": "Despite people who have rewarded you evil for the good you did to them, be determined not to stop helping people in need.",
        "thoughts": "That only one of ten lepers showed gratitude to Jesus after they were healed did not interrupt His healing ministry.",
        "prayer": "Father, I know that I have been hurt by many who repaid me badly for the good I did to them. I ask You to strengthen me never to give up on helping and doing good as You help me in Jesus' name. Amen."
    },
    {
        "date": "January 19",
        "title": "ON THE LORD'S DAY: STRENGTH OF COMMUNION",
        "reference": "Leviticus 26:1-12",
        "scripture": "And five of you shall chase an hundred, and an hundred of you shall put ten thousand to flight: and your enemies shall fall before you by the sword. Leviticus 26:8",
        "text": " There is strength in numbers, especially when they are united. The Lord encourages His church to be united in purpose. If believers could have the same mind and speak the same spiritual language, we will be indivisible by the wiles of the enemy and will be a formidable force against the kingdom of darkness. Not forsaking the gathering of the brethren is for the building up of one another. \n\nWhile individual Christians may have their weakness, the strength we generate as a corporate body of believers cannot be withstood by the devil. The strength of communion is in the realisation that you are not alone. In times of joy, there are brethren who celebrate with you. In times of sorrow there are brethren who bear your burden. In times of weakness, there are those who are strong and can fill in the gap until you become strong again. In every way, the Lord surrounds us with men and women linked to us by the blood of the Lamb. \n\nLittle wonder the devil keeps attacking the body of Christ from within because he realizes we are invincible from outside. Stop being a lone-ranger Christian, complaining that the church is not worth it. A Christian who is not united with other believers is part of the problem of the church because he allows a loophole for the devil's entrance. Always defend the faith. Defend the brotherhood. Never speak evil of the church. It is your source of strength.",
        "action_plan": "Today, join your faith with another believer to pray concerning the church of God. Invest time and resources in supporting a brother or sister in need.",
        "thoughts": "Division in the body is the fastest way to weaken the power and influence of the Church in the world.",
        "prayer": "Father, I choose to be among the builders and not the destroyers of the fabric of our Christian faith in Jesus' name. Amen."
    },
    {
        "date": "January 20",
        "title": "GOD LEADS US (1)",
        "reference": "Joshua 3:1-6",
        "scripture": "And they commanded the people, saying, When you see the ark of the covenant of the Lord your God, and the priests, the Levites, bearing it, then you shall set out from your place and go after it. Joshua 3:3",
        "text": " A very patient and caring father can lead a vulnerable child through an unaccustomed terrain. He will hold his trembling little hand and guide him gently as the little one follows. A child who follows the leading of an experienced father cannot go wrong. \n\nIn the same vein, God has always been in the business of leading His own. He led Abraham from the familiar environment of his homeland through an unknown area to the promised land. It takes a level of faith and trust to follow into the dark and unknown. \n\nIn our text, God led Israel by the ark of the covenant and the priests carrying it. The ark symbolizes the presence of God. These days, we are led by the Spirit of God Who is the presence of God (Romans 8:14). When we place our tiny hands in His, we are surrendering our calendars for His divine agenda. We are ready for a change of plans if He so desires. We recognize our limitations and His limitless pathways. We will wait until He signals, stay until He beckons, pray until He answers. We are willing to be corrected, reprimanded, instructed, reproved for our good. Beloved, do not be in a hurry when you are with the Father. Rest in His love and be willing to follow as He leads. Let Him perfect His work in you. Cultivate the habit of asking for His leading even in the smallest detail of your daily life. God is interested in you and will direct you if you commit your ways into His hands.",
        "action_plan": "Follow God's leading; ask Him for direction. If He is not leading you there, do not dare.",
        "thoughts": "Waiting for divine leading is like pulling on a sling: the retreating missile advances with great momentum when released.",
        "prayer": "You are my only help. Lead me, heavenly Father. Guard, guide, keep and feed me, in Jesus' name. Amen."
    },
    {
        "date": "January 21",
        "title": "GOD LEADS US (2)",
        "reference": "Psalms 31:1-5",
        "scripture": "For You are my rock and my fortress; Therefore, for Your name's sake, lead me and guide me. Psalmss 31:3",
        "text": " The memory verse for today makes it clear that one of the reasons why God is interested in leading and guiding us is for the sake of His name. We are His children, and we are called by his name. We have seen parents who speak sternly to their children about taking a particular course of action. \n\nThey show more concern than they would ordinarily do for other children because the family name is at stake if the children misbehave. In the same vein, God desires to lead, guide, and direct us because He is a stakeholder in what we do: we are His offspring. God is not an intruder: He responds when we call on him and invite Him into a situation in our lives. He desires to instruct and lead us in the way to go in life, but He requires us to ask for His intervention and direction. \n\nWhen in life we face challenging times or a new chapter of life, it is wise to seek the face of the Lord for the right way to go. This we do with an attentive, inner spiritual ear: And thine ears shall hear a word behind thee, saying, this is the way, walk ye in it, when ye turn to the right hand, and when ye turn to the left (Isaiah 30:21). Remove distractions from your way. As you meditate on the words of Jesus, be quiet in your spirit as you allow Him to speak to your inner man. It does no good to hurry in and out of His presence while he is still busy downloading the instructions for the day to you. Your patient waiting on the Lord for direction will save you time and untold hardship.",
        "action_plan": "Make up your mind to ask for direction from the Lord. He is willing to show it to you.",
        "thoughts": "God is ready to lead; are you willing to follow?",
        "prayer": "Lord, I will follow Your lead as You preserve me in Your presence and I shall be free from error and terror. In Jesus name. Amen."
    },
    {
        "date": "January 22",
        "title": "A DARING SPIRIT",
        "reference": "Acts 7:17-27",
        "scripture": "And Moses was learned in all the wisdom of the Egyptians and was mighty in words and deeds. Acts 7:22",
        "text": " A new king reigned in Egypt and began an ethnic cleansing of the Israelites. God divinely secured Moses' life and he was adopted by Pharaoh's daughter. By divine grace he obtained the best education and training available as an Egyptian prince. \n\nHe became mighty in words and deeds. However, he refused to enjoy the palace privileges and chose to dare the devil. Moses recognized his roots and identified with the Hebrews. He realised that living and dying with a divine purpose is better than briefly enjoying the pleasures of sin (Hebrews 11:24-26). Stepping out in confidence, he attempted to assuage the sufferings of his brethren. \n\nThings took a wrong turn however and he was forced to flee into Midian (Exodus 2:11-15). To his credit though, we see that his zeal was an attempt to set right the wrongs happening around him. This is what is expected of us as believers. We cannot afford to be in a place where evil prevails and remain quiet. We must be known as people who stand for the right no matter what the circumstances or consequences. It is always proper and right to speak up against evil. A daring spirit cannot be intimidated. Let us shake off all forms of intimidation and manipulation by the devil and wicked men. In maintaining God's standard, we must live courageously with a victorious attitude. Never compromise your biblical stand because of the pressures around. Action Points: Do a situation analysis, have a good understanding of the problems and then you can start working on proffering solutions. Thought for the day: The world of possibilities awaits the daring person as he moves from one realm of discovery to another. Prayer: Father, I resolve to yield to no intimidation or manipulation of the devil no matter how compelling they are. I choose to uphold Godly standards to the glory of Your holy name in Jesus' name. Amen."
    },
    {
        "date": "January 23",
        "title": "THE HIDDEN CANDLE",
        "reference": "Matthew 5:13-20",
        "scripture": "Nor do they light a lamp and put it under a basket, but on a lampstand, and it gives light to all who are in the house. Matthew 5:15",
        "text": " Why would someone desire to hide his light? One reason a candle can be conveniently hidden under a table or bed is if there is no fire on it at all. It is useless and ineffective. It can neither hurt a fly nor give illumination to the surroundings. \n\nA child can play with it and even break it. Such is the coldness in the life of a man whose altar lacks the fire of the Holy Ghost. He is by no means a threat to the works of darkness. The scripture says, Can a man take fire in his bosom, and his clothes not be burned? (Proverbs 6:27) A life that advertises mediocrity is unworthy of celebration and will attract nothing of significance. The light of such a life cannot shine; it will remain in obscurity because no one is attracted to a failed life or project. Anyone whose life emits wickedness will hide from the light. Jesus said: So the wicked hate the Light and try to hide from it, for their lives are fully exposed in the Light. \n\nBut those who love the truth will come out into the Light and welcome its exposure, for the Light will reveal that their fruitful works were produced by God (John 3:20-21). If you are not proud to tell others about your faith in Christ, perhaps your life is not matching your profession. The people who run to such a life and light cannot be guaranteed security, safety and settlement. If your candle is hidden, could it be because it carries no attractive light because it is hiding a life of sin?",
        "action_plan": "Purposefully tell people around you about your faith today. It will save you from being lost in a permissive world.",
        "thoughts": "A fire-less candle is either trying to hide something evil or something evil is trying to hide it.",
        "prayer": "Father, I want to be a light of the world, shining brightly for You, exposing darkness, and dissolving doubts about Christ in the minds of the people in Jesus' name. Amen."
    },
    {
        "date": "January 24",
        "title": "REMOVING THE COVERING",
        "reference": "Isaiah 25:1-12",
        "scripture": "And He will destroy on this mountain the surface of the covering cast over all people, And the veil that is spread over all nations. Isaiah 25:7",
        "text": " The passage we read has a vivid imagery of what the Lord does, it makes one marvel. A version says: It is his breath that made the sky clear, and his hand that killed the escaping monster. \n\nWe serve the omniscient God who can handle any situation that comes our way. The only requirement for His intervention is that you have been translated from the kingdom of darkness into the kingdom of His dear Son. Once this criterion is met, He welcomes you with open arms and handles your situation with the great power that has done the great wonders we see listed. \n\nMany people have laboured in obscurity. They have acquired every necessary qualification for their desired position but have not been employed. They do all the work in their office but someone else receives the prize for their efforts. Some people try to please their spouse, but all they get in return is ingratitude. Many students study hard but are not rewarded for their hard work. These people put in so much, but their output is not impressive. Anyone struggling in this kind of obscurity is labouring behind a covering cast by the enemy. But the Lord has come for you today to remove the covering cast over your life and efforts (Isaiah 25:7). He has come to destroy the veil that is hiding your potential and reveal your true value. The heavens over your head will no longer be brass. It shall give rain in abundance and bring fruitfulness to your field of endeavour.",
        "action_plan": "Keep asking for more, keep seeking God and keep knocking on the door.",
        "thoughts": "He will destroy the covering cast over all people, and the veil that is spread over all nations.",
        "prayer": "Breathe on me, Lord Jesus I pray. Today I declare that every cloud hiding my efforts and keeping me in obscurity be blown away by Your breath in Jesus name. Amen."
    },
    {
        "date": "January 25",
        "title": "THE PROOF OF LOVE",
        "reference": "1 John 5:1-5",
        "scripture": "For this is the love of God, that we keep His commandments. And His commandments are not burdensome. 1 John 5:3",
        "text": " The proof of your love is in your commitment to the Lord. Your love is revealed in your personal drive towards the Lord. It is demonstrated by how much sacrifice you can make for Him. When God gives you access to some pleasures in life, it is often to check your level of commitment. \n\nYou must not fail the test. There is nothing you can access on earth: car, house, position, or any other luxury that can compare with God's reward. If your drive, devotion, and steam begin to drop because of earthly luxury, your love for the Lord is questionable. Check your level of commitment! Your love for God should drive you beyond your will. You may receive an instruction from the Lord that takes you out of your comfort zone. \n\nConsidering your will and convenience, you may be tempted to disobey. But your love for God constrains and drives you to complete obedience. A lifestyle driven by love for God convicts and compels onlookers. Just as God's love for us compelled Him to give His only Son on the cross for us, our love for Him should prompt us to make sacrifices too. The required sacrifice may be more than your possessions - it may be your life. Remember Stephen who was stoned to death by the Jews. His speech, attitude and life were so compelling that the Jews could not afford for him to remain alive. But heaven welcomed him a great ovation (Acts 6:15; 7:55). It is better not to have lived than for your life not to be impactful for the Lord Jesus Christ.",
        "action_plan": "Measure your love for God by your commitment to prayer, obedience to His word and to your personal and corporate fellowship.",
        "thoughts": "We spell our love for God both in words and in deeds.",
        "prayer": "Dear Lord, accept my heart of devotion and set my heart on fire to serve You fervently. I silence every distracting voice that is seeking my attention in Jesus' name Amen."
    },
    {
        "date": "January 26",
        "title": "ON THE LORD'S DAY: GOD OF ALL POSSIBILITIES",
        "reference": "Genesis 18:1-15",
        "scripture": "\"Is anything too hard for the LORD? At the appointed time I will return to you, according to the time of life, and Sarah shall have a son\". Genesis 18:14",
        "text": " When the Lord appeared to Abraham in the plains of Mamre and said in nine months' time his wife Sarah, will give birth to a son, Sarah laughed because she was quick to make some human calculations. Both husband and wife had considered their ages and the state of their physical bodies (verse 11). \n\nTheir reaction to this word of prophecy portrayed a latent spirit of fretfulness. Perhaps there had been a temporary failure in Abraham's ability to absolutely submit to God's time and way, of accomplishing His promise. Their unbelief did not reduce the effect of God's word. Nine months later, barrenness was conquered. Are you passing through certain difficult situations at the moment? Have you received reports that make the natural heart of a man to fail or faint? Do you think you have waited so long for an answer to a prayer request? Is there a cross you are carrying presently? \n\nDoes it seem that the weight of the cross is so heavy on you? Mary and Martha thought Jesus was late. But when Jesus got to the scene, He commanded life back to Lazarus. Let your faith be strengthened in the Lord. Put your trust in the word spoken by God, either through His servants or the written word of God. If God did the miraculous for Abraham and Sarah, Mary, and Martha, I am convinced that He will do much more for you. There is nothing impossible for God to do for us (Matthew 19:26; Luke 1:37).",
        "action_plan": "Check if what you are up to seems bigger than you. Then, it is in the realm of God's interest.",
        "thoughts": "When we are discouraged with a sense of our own impotence, consider the power of God, and hand the matter over to God.",
        "prayer": "Father, by faith I present all difficult situations in my life to you today, remembering that You are the LORD, the God of all flesh: and there is nothing too hard for You (Jeremiah 32:27)."
    },
    {
        "date": "January 27",
        "title": "WORK ENTHUSIASTICALLY",
        "reference": "1 Corinthians 15:51-58",
        "scripture": "So,  be strong and immovable. Always work enthusiastically for the Lord, for you know that nothing you do for the Lord is ever useless. 1 Corinthians 15:58 (TLB)",
        "text": " Every Christian is a workman for God. God knows our frames (Psalmss 13:14) and He created us with different potentials, assigning us to tasks according to our varying abilities.\n\nHe calls us into service as His co-labourers and strengthens us until we become the best that we can be. He expects us to serve enthusiastically with the whole of our heart (our passion), strength (our ability) and mind (our thought processes). Our service to God is intended to bring Him glory and benefit our fellow men. When we accomplish this, we bring joy to the Lord's heart. In our human frame we are frail and can become weary. \n\nSometimes challenges arise or our best efforts yield minimal results. While this may be discouraging, we must remember that the Lord is not a taskmaster. He sees everything we have put in and understands our frailty. He is waiting for us to call out to Him to renew our strength and give us more grace. We must not draw back or allow fatigue to have a foothold. As our focus verse says, nothing we do for God is ever useless. It may seem like the seed sown will not germinate but keep watering. The result will show forth soon. Endeavour to put in more effort in your ministry. Like a resolute soldier, determine to remain at your duty post. Turn your eyes away from every distraction and set your face like a flint. The strength of the Lord will come through for you as you stay steadfast.",
        "action_plan": "Discover your areas of strength and deploy the same in the service of God.",
        "thoughts": "The Lord is committed to His faithful servants making them soar like eagles.",
        "prayer": "Dear Lord, strengthen my weary heart as I stay resolute at my duty post. I receive the grace not to fail in my service to You in Jesus name. Amen."
    },
    {
        "date": "January 28",
        "title": "ENDURE TO ENJOY",
        "reference": "Matthew 25:14-30",
        "scripture": "\"His lord said to him, 'Well done, good and faithful servant; you were faithful over a few things, I will make you ruler over many things. Enter into the joy of your lord'. Matthew 25:21",
        "text": " The master committed different talents to the three servants based on their individual capabilities. Two out of the three servants were diligent and faithful, making gains as they did business with their talents and receiving commendation and honour. \n\nComparably, while matriculation ceremonies into an academic institution of learning are heralded with joy, the convocation is marked with greater celebration. The latter signifies the completion of a course of study. Only those who laboured diligently are awarded their certificates and laurels.\n\n We, as God's stewards have been called by the Lord Jesus who gave us gifts to profit withal (Ephesians 4:8). God wants us to own the work which He has committed. Diligence, integrity, and faithfulness are required for efficiency. Every point of service is to bring praise, honour, and glory to the Lord as we labour for Him (1 Peter 1:7). He promises to reward His faithful servants at His return. At His appearing, the Lord Jesus Christ will pronounce honour on His faithful servants. No Presidential or Vice Chancellor's handshake to graduating doctoral students is comparable. Serve God with all your strength, having an expectation of the coming incomparable honour. Serve with faithfulness and commitment. Let your service move God to take notice of you. Let it cause God to mark you out for excellence.",
        "action_plan": "Set before you what you want to achieve, then work towards your goal enduring the hardship along the way.",
        "thoughts": "The faithful servants of Jesus Christ shall not be put off with bare commendation; all their work shall be rewarded.",
        "prayer": "Heavenly Father, may I not be an unprofitable servant or a failure in ministry, business, and life. Strengthen me to serve for eternal rewards in Jesus Name, Amen."
    },
    {
        "date": "January 29",
        "title": "THE FATHER'S PRIDE",
        "reference": "Isaiah 51:1-16",
        "scripture": "And I have put My words in your mouth; I have covered you with the shadow of My hand, That I may plant the heavens, Lay the foundations of the earth, and say to Zion, 'You are My people Isaiah 51:16",
        "text": " God desires to see His purpose in you. He formed and then transformed you to be an answer to the questions in the hearts of men. When people say it is impossible to live right, the Lord simply points them to you. When they lose hope in the sanity of the society, the Lord asks them to take a cue from your family. \n\nYour life becomes God's sure answer to their doubts about the prosperity of the soul and illumination of the mind. God boasts in the transformational work He has done in you and the positive effect of it on your society. \n\nThe Father looks down from heaven with a knowing smile when we give Him pleasure by a life that radiates His glory. Yes! He specially crafted us for that purpose. We were not accepted in the beloved (Ephesians 2:12-13) until He formed us, bringing us out of miry clay. Now we are chosen from among men to bring honour and praise to His holy name. He desires us to light the world, teaching by words and ways what men should do and how they should live. The Lord has infused the strength of the Holy Ghost into us, setting us apart for His glorious use. Beloved, look at yourself in the mirror today. See a life redeemed, recreated, refined, and reformed. Live as an answer to the question in someone's mind about God. Be a joy to the sorrowful heart: listen and encourage. Be the light to the darkened soul: show them the love of Jesus. Be a help to the lame and lonely.",
        "action_plan": "See yourself as God's pride and the solution to the questions around you today.",
        "thoughts": "When men's questions multiplied, God designed you as an answer to them: are you in?",
        "prayer": "Lord, position me at the corridor of Your will. Enlist me as one of the carriers and executors of Your divine plans for the day, in Jesus' name. Amen."
    },
    {
        "date": "January 30",
        "title": "CREATING AN IMAGE OF GOD (1)",
        "reference": "Isaiah 44:9-20",
        "scripture": "And the rest of it he makes into a god, his carved image. He falls down before it and worships it, prays to it and says, \"Deliver me, for you are my god!\" Isaiah 44:17",
        "text": " God formed you from the dust and brought you into an exalted position of authority and responsibility. In His infinite wisdom, He chose a reason for your living: to show forth His praise. \n\nSadly, the sculptor in our text today had a different idea of how God should look. His mind could not appreciate the beauty and glory of God beyond a carved piece of wood. So, he formed a god for himself with an inferior idea of whom He really is. \n\nToday, there are subtle ways in which people have named God, imagined God, or dressed God for themselves by their imagination. God is God and he does not need the approval of men for relevance. Since he was not appointed, He has no terms of office and cannot be overthrown. His supremacy and sovereignty are unquestionable. We cannot carve Him with the knife of our artistry. We cannot mould Him into the shape of our own imagination. The exact image of God is expressed in His Son, Jesus Christ. He is the beloved Son in whom God delights. He gives us the right perspective to the Father and delivers us from wild imaginations about the Father. Close your eyes to the world of forces around you. Stop forming God based on your situation. He is beyond that! He was God before the challenges and will still be God afterwards. Let God be as real to you as the unchanging One despite your changing conditions. Then, the revelation of His true image will make a positive change in all your life experiences.",
        "action_plan": "Today, see the world through the eyes of God. Let your mind create a life of possibility in God.",
        "thoughts": "Those who draw the picture of God with eyes on the world systems will end up drawing a caricature of Him.",
        "prayer": "As I close my eyes in prayer, Lord Jesus reveal Yourself unto me. Lead me to the Father that I may no longer paint God in my own ways in Jesus' name. Amen."
    },
    {
        "date": "January 31",
        "title": "CREATING AN IMAGE OF GOD (2)",
        "reference": "Matthew 16:13-17",
        "scripture": "When Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, whom do men say that I the Son of man am? Matthew 16:13",
        "text": " If you must create an image of God, be sure to reproduce Him correctly. In the elementary school, we reproduced the picture of an object by tracing out the original. We placed a piece of tracing paper on the page containing the drawing of the object. \n\nThe tracing paper is transparent, and you can see the object clearly through it. The picture is better replicated than if it was drawn without the tracing paper. In the same way, we can trace the exact image of God if our life is transparent and placed side by side His own. Jesus asked two questions in our text today. First, what people thought about Him. Second, what the disciples thought about Him. \n\nLike the analogy above, we cannot accurately describe God or form Him in our imagination without an intimate and transparent relationship with Him. Every time we take our eyes off Jesus, we lose a description of Him. But if we are constantly intimate in prayer and word study, unashamedly transparent in our act of worship, we will have an accurate formation of God in our heart and our God-view will shape our world view. Never take your eyes off Jesus. Look unto Him always as the Author and Finisher of your faith (Hebrews 12:2). The second key is to be intimately apposed to him (paper on paper). Learn to practice His presence. The third key is to become transparent: a vessel through which Christ's glory can shine absolutely and His image can be seen clearly.",
        "action_plan": "Let this question, what will Jesus do in my situation? guide your actions, speech and thoughts today",
        "thoughts": "The only vessel who can accurately describe God is one that is transparent, permitting God through and through.",
        "prayer": "Lord Jesus, reveal Yourself to me so that I can accurately describe You to the world. Make me a yielded and transparent vessel through whom You can shine Your Light and blow Your trumpet. Amen."
    },
     {
        "date": "February 1",
        "title": "SUSPENDED ON HIS WORD",
        "reference": "Hebrews 1:1-5",
        "scripture": "and upholding all things by the word of His power, when He had by Himself purged our sins, sat down at the right hand of the Majesty on high. Hebrews 1:3",
        "text": " Suspension bridges are constructed on beams of concrete whose strength has been determined and certified by the structural engineer as fit to bear the weight of heavy equipment and automobiles crossing the bridge. \n\nSimilarly, there is an unseen beam that suspends the world since creation so that it has remained thus far: it is the Word of God's power. Every time you look at our universe, see it hanging over the invisible and invincible Word of God. If God removes the word of His power, the entire world will crumble. \n\nThis picture of the world hanging on the Word of God is relevant in our daily lives. The God of all creation has given a word that will carry you when your strength is little. Friends and family may offer to help but their joint effort can only yield little or no results. You may be crumbling under the enormous weight of the cares and burdens that life has thrown at you. But there is a God in heaven who directs the affairs of men. His Word suspends the whole universe in a balance. With the right appropriation of the Word, you will be lifted far above and beyond. Every plan, purpose, and preparation of the heart of man that is not hinged on the commanding power of God's Word lacks the backbone for support and sustenance. It will crumble. Pronounce the invisible but powerful Word that sustains the universe into the walks and work of your day. You will be given the needed stamina for sure success.",
        "action_plan": "Speak the word of His power into your situation. Hang all the loose ends of your life on it. It will suspend and sustain them.",
        "thoughts": "Remove His Word from the world, the centres will never hold, it shall come crashing down.",
        "prayer": "Almighty Father, let the Word of Your power that suspends the universe sustain me through the waters of life. May I not drown but walk on Your word to my destiny today in Jesus name. Amen."
    },
    {
        "date": "February 2",
        "title": "ON THE LORD'S DAY: SAVING LIVES",
        "reference": "Mark 3:1-6",
        "scripture": "Then He said to them, \"Is it lawful on the Sabbath to do good or to do evil, to save life or to kill?\" But they kept silent. Mark 3:4",
        "text": " We can address the question Jesus asked the Pharisees on a Sabbath day freely because the answer is clear and simple: do good and save life on the Sabbath. However, the tradition of men that the religious leaders upheld placed more importance on religious rites than saving lives and doing good. \n\nThe hardness of the heart of the Pharisees made them not amenable to reasonable change. Why would they prefer that the man with a crippled and paralysed hand remain in such a deplorable state even on a Sabbath? Restoration of human lives, human dignity and redemption of their souls is priced above all other religious exercises. \n\nIsaiah 58 tells us how God judges our fasting. He places more importance on our reaching out to the people with His love than the pious Pharisaic look on people when they fast. So beyond the service of today, endeavour to perform an act of kindness. There are so many crippled hands in the church who need help. They are brethren who cannot feed their families, pay school fees, need encouragement, or have some health challenges. No withered hand should leave our congregation today without help. Let us deliberately seek them out and shower them with the compassion and love of Christ and the help they need. Jesus would not let them go without straightening their hands and restoring their function. We should emulate our Master by giving help to those who need it.",
        "action_plan": "Be intentional to meet some needs of brethren in church today.",
        "thoughts": "The joy of His presence is that the need of one of us is a concern for all of us.",
        "prayer": "Lord, it is with great joy that I go to church to fellowship with other believers today. Do a great work and straighten every spiritually defective hand by your Word in Jesus name. Amen."
    },
    {
        "date": "February 3",
        "title": "HANDS READY TO HELP",
        "reference": "Psalmss 119:173-176",
        "scripture": "Let thine hand help me; for I have chosen thy precepts. Psalmss 119:173",
        "text": " In the tag-team of WWF wrestling competition, there are pairs of competitors but only one of them fights in the ring at a time. There have been instances when the one in the wrestling ring has been beaten to stupor and all he could manage to do was to stretch forth his hand to his partner outside the ring for help. \n\nThe beaten and battered fighter summons all his strength and courage to just touch the tip of the outstretched hand of his partner. As soon as there is physical contact, the energized and refreshed partner comes in, charging to the rescue. \n\nSometimes life deals us a large dose of trouble. The wickedness of this world and the trials and temptations hit us left, right and centre until we are dazed and unable to continue for lack of strength. It is at such times that we need to turn to the help available outside the wrestling ring of our known strength. When we are at our wit's end, we need to engage our Senior Partner. Look outside the box of life and see the outstretched hands of the Lord who has been waiting all along to take on the enemy on our behalf and save us from all our troubles. The Psalmsist was not a stranger to the battles of life. But he was also accustomed God's workings. Jehovah Sabaoth's remains the outstretched hands ready to come to the rescue: a very present help. This may just be the right time for you to quit the pretence and shake His hand in prayer. Let the Lord fight your battle for you as you hold your peace.",
        "action_plan": "As life challenges feel overwhelming, ask God to take over from your tired self.",
        "thoughts": "When real help is what we need, there is only one sure source: turn to the Lord.",
        "prayer": "Lord, I am tired and weary. May Your hand be ready to help me. When in debt, in despair, in doubt and dejected, I look towards you for Your strong hand is always stretched out to help me. In Jesus name. Amen."
    },
    {
        "date": "February 4",
        "title": "CONFIDENT ASSURANCE",
        "reference": "Proverbs 3:21-26",
        "scripture": "Do not be afraid of sudden terror, Nor of trouble from the wicked when it comes;  For the LORD will be your confidence, And will keep your foot from being caught. Proverbs 3:25-26",
        "text": " Self-confidence is not walking into a room thinking you are better than everyone. It is walking in not comparing yourself to anyone at all. However, God-confidence is walking into the room not comparing yourself with anyone but with the Lord's potential in you. \n\nWhen the Lord is your confidence, He becomes your yardstick of performance in life. When you lose confidence, it is because you have lost fellowship with God. But when His presence is real in your life, your confidence is solidly unshaking. He is your Commander in-Chief. The scripture above tells us not to lose our confidence. This means that someone can be confident today and then lose it tomorrow. \n\nPrayerlessness, sinful lifestyle, lack of meditation on God's Word, wrong association, evil thoughts, and meditations can make one lose confidence in God. Do away with them. Stay focused in prayer and faith. Keep on looking to God unwaveringly. Peter looked at the waters of life and his confidence in Jesus were swept away. Life brings its tides and waves, but let your anchor hold within the veil of the Lord Jesus. If your confidence in God is waning, get back to the foot of the Cross. You can renew your absolute trust in the redemptive work of Christ. Do away with the life of conspiracy theories that have filled the air; let Christ be the only Rock you know, affirm, and believe. Remember that all other grounds are falsehood and sinking sand.",
        "action_plan": "Say to yourself over and over again: Lord Jesus, You are my Confidence.",
        "thoughts": "Take away the believer's confident assurance in the Lord, and he will be left without a defence.",
        "prayer": "Eternal Father, I will not throw away my confidence in you. No man, world or devil will take it from me in Jesus name. Amen."
    },
    {
        "date": "February 5",
        "title": "THE MASTERMIND",
        "reference": "Genesis 1:1-5",
        "scripture": "For God, who commanded the light to shine out of darkness, hath shined in our hearts, to give the light of the knowledge of the glory of God in the face of Jesus Christ. 2 Corinthians 4:6",
        "text": " Have you ever been to a construction site? The boss or supervisor is not the hefty man lifting the construction materials; neither is it the artisan banging heavy metals as he puts the pieces together. \n\nIt is not even the guy shouting at the workers, running from pillar to post. It is that quiet man in the corner, with one hand to his forehead and a pen in his hand, looking at sheets of building plan spread on a large surface and making some notes on the paper. That is the man with the idea. He is the one responsible for all the movement you see on that construction site. Every big project ever accomplished began with an idea, a thought in the heart of someone, or a need that stares you in the face. \n\nNecessity is the mother of invention; but every invention begins with a step of the first light. Until there is an illumination in your heart and an idea in your mind, you may not be able to thoughtfully form a process for building a good project. So God commanded the light to be. He commanded illumination-ideas, notions, concepts, designs-to spring forth. This forms the springboard for accomplishing everything else. Today, you can see the light of idea, illumination and understanding. The same God who commanded light to shine out of darkness is able to give you the right inspiration. The knowledge that is needed for your daily work in God and the inspiration required for excellent delivery in your secular life endeavours are given when God enlightens your mind.",
        "action_plan": "Before attempting to solve any problems today, ask God for inspiration and ideas that are superior to human methods.",
        "thoughts": "When our hearts are illuminated by God, we see clearly what we need to do.",
        "prayer": "O Lord, grand me wisdom from above in all my doing. Show me the way to go and how to achieve purpose in life in Jesus name. Amen."
    },
    {
        "date": "February 6",
        "title": "WORKING WITH GOD",
        "reference": "Joshua 6:1-11",
        "scripture": "And the LORD said unto Joshua, See, I have given into thine hand Jericho, and the king thereof, and the mighty men of valour. Joshua 6:2",
        "text": " Working with God can be rewarding. It helps us to build a great success in life with strength to spare. There is no way that Israel would be able to enter a fortified and walled city like Jericho without a supernatural intervention. \n\nAs soon as they heard about Israel's plan of invasion, they shut their city tight. The security was so air-tight that, had God not intervened, it would have been a practically impossible task. When God helped them to collapse the wall which was the defence of the city, the rest of the conquest became easy. With God as your main partner, you can destroy every evil city. Every wall of resistance against you at work will fall if you remain on the Lord's side. Everyone who monopolizes the business opportunities in your area of trade will be moved by the Lord. No lecturer can victimize you because you refuse to bow to their pressures. \n\nYou have decided to partner with Jesus; your project will gain speed for completion. Working with God gives wings to your ministerial efforts. You do ministry on the platform of God's supernatural strength and not human efforts. Even if the economy is shut down so that no success comes in or goes out, God asks you to see: He has given you victory. This means there is a way out for you when you partner with God. His projects have been time-tested. He never suffered defeat or loss. Parting the Red Sea, then Jordan, then sinking Jericho's wall are all proof of His accomplishment.",
        "action_plan": "Ask the Lord to show you how to locate the gaps in the tightly-shut gates to your success (Joshua 6:1-2).",
        "thoughts": "If your plans are hampered by limited experience and resources, God can help with circumstances beyond your control.",
        "prayer": "Lord Jesus, I partner with you in all my life pursuits. Guide me to the path of success. Amen."
    },
    {
        "date": "February 7",
        "title": "QUALITY OF DELIVERY",
        "reference": "Ecclesiastes 9:1-10",
        "scripture": "Whatever your hand finds to do, do it with your might; for there is no work or device or knowledge or wisdom in the grave  Ecclesiastes 9:10",
        "text": " Excellence is the character of God. It is a standard above the ordinary. It entails doing ordinary things extraordinarily. It is more of a habit than an art. It shows in everything one does. \n\nIt is an attitude and a way of thinking. From our text, God has a trademark of excellence, and He wants all believers to imitate Him, doing all we have the opportunity and ability to do with a touch of diligence and vigour and a class of quality and excellence. Believers are expected to pursue excellence by being consistent, diligent and persistent in pursuing their goal. Whatever you are called to do in life, no matter how big or small, do it with the flavour of excellence. \n\nApproach every work in life as the only opportunity to show your God-given ability in that area. If you are called to clean the floor, do it like Michelangelo would do a painting or Beethoven would compose a piece of music or Shakespeare would do a poem. Let heaven and earth pause for a second to make a good remark about how well you do your work. That is excellence. Excellence is a spirit, and it is given by the Lord. You can ask the Lord to put in you that spirit. When you pursue after a great quality rather than just quantity, it will single you out among peers and place you on a pedestal of greatness. The glory and beauty of God reflects on you as you allow Him to lead you into a life of quality delivery. Do not cut corners in achieving an end. Through diligent work, make your delivery an excellent one.",
        "action_plan": "Today, go for excellence and quality delivery. Don't be lazy in your work; be diligent.",
        "thoughts": "He whose life is spent in ease, mediocrity and idleness should doubt altogether his faith.",
        "prayer": "Lord, as I strive towards excellence, help me to understand the responsibility that comes with serving God and the role you have assigned to me in life."
    },
    {
        "date": "February 8",
        "title": "FOCUS ON THE MISSION",
        "reference": "1 Corinthians 9:24-27",
        "scripture": "'Therefore, I run thus: not with uncertainty. Thus, I fight not as one who beats the air'. 1 Corinthians 9:26",
        "text": " The reason why a shoe with a sharp-pointed heel will have a meaningful impact in the sand is because it is focused on a point while a flat-based one will make only a brief impact. This is a great lesson for being focused and undistracted in life. \n\nPaul was a focused man as he demonstrated during his earthly life and ministry. He refused to waste his energy on things that will yield no profit at all. He knew it is useless to spread yourself thin on all fronts while your impact becomes limited. He maximized God's grace upon His life. Many believers are encumbered with irrelevant matters while the main issues of the kingdom are left unattended. Their aspirations are more about material than spiritual things. \n\nJesus challenged the Pharisees to reverse the order and put first things first: weightier matters of the Law (Matthew 23:23). Paul wasn't beating the air. He ran with a purpose and so should we. We also need to be undistracted in life. There is no wisdom in biting more than you can chew. Do as much as the Lord gives you the ability and do it well. Distraction slows you down and reduces your efficiency. You should have an aim, a goal or an objective in all your efforts in life. Concentrate all your energy on your vision. Be a full-time Christian who is real-time serious about the big-time purpose God has given you to pursue. Prioritise matters of faith, righteousness and holiness in your dealings.",
        "action_plan": "In prioritising, categorise the items in your schedule by their degree of urgency and measure of importance.",
        "thoughts": "Do not follow everyone everywhere for everything so you will not be prone to anything and achieve nothing.",
        "prayer": "Lord, help me to wear the muffler of the Spirit to limit the effect of the noise pollution of the world around me. Amen."
    },
    {
        "date": "February 9",
        "title": "ON THE LORD'S DAY: INGREDIENTS OF WORSHIP",
        "reference": "Psalms 100:1-5",
        "scripture": "Enter into his gates with thanksgiving, and into his courts with praise: be thankful unto him, and bless his name. Psalms 100:4",
        "text": " When you are going to church to worship the Lord, remember to go with the items of worship. The first one you must remember to come with is your voice. If God has given you a voice that can be heard, then come with a joyful noise and shout of triumph unto Him. \n\nWhen you shout, your troubles are drowned with the walls of Jericho. Secondly, serve the Lord with gladness. If you are ministering in any form as a worker, do it cheerfully with a smile on your face. \n\nSome people desire to serve but God turned them down; be grateful. Next, you must have a song: a hymn, a spiritual song of worship and praise. You don't need to be in the choir to sing. Sing with the voice God has given you. Come with a heart of gratitude. Do not give God an attitude because of your requests that are still pending. Be thankful for what He has done already and be grateful for what He is yet to do or has refused to do. For He alone is God: He is the Shepherd, and you are His sheep. Therefore, follow His leading. As He inhabits Your praise, He will come down and rain upon you more blessing. You do not need to be begged to praise the Lord. Let your heart be full of praise. Enter His gate with thanksgiving. Come into His courts with praise, be thankful and bless His name. Therefore, prepare your heart, your voice, a song and an instrument of worship and appear before the King in your best attire as a grateful child who has come to worship.",
        "action_plan": "Confirm these are ready: your heart; your voice; a song; an instrument of worship; a cheerful disposition and a nice attire.",
        "thoughts": "A heart that is prepared to meet with the Lord will never come back from the heavenly throne empty handed.",
        "prayer": "Father, I thank You that You counted me worthy among the living today. I give You all the praise and celebrate Your faithfulness in Jesus' name. Amen."
    },
    {
        "date": "February 10",
        "title": "THE BLUEPRINT",
        "reference": "Exodus 35: 31-35",
        "scripture": "And to devise curious works, to work in gold, and in silver, and in brass, and in the cutting of stones, to set them, and in carving of wood, to make any manner of cunning work. Exodus 32-33",
        "text": " God wants us to do things following the instructions. When He asked Moses to build Him a house, He gave him the exact pattern to follow. Any deviation from the set pattern would have resulted in a disaster. God had a reason for every measurement and every material strength. \n\nThe originality and ingenuity of God's pattern cannot be mistaken. It is not a copy of an already established pattern or process. Nothing like it has ever been built before. And in following the specific instructions of God, Moses was able to build to God's taste. When a person looks up to God for revelation, he achieves originality in his work. If you ask the Lord for the divine template for marriage, you will never fall into the same error many people before you fell into. \n\nIf you ask God for grace and guidance in life and ministry, you will not measure achievements in human terms but God's. With the gracious combination of the spirit of wisdom, understanding and knowledge at work, we can do something differently. We can be led of God to do things right and correctly. God's blueprint for life is found in His word. The reason you must feed on it is because your life depends on it. If you follow it, you can never go wrong. If you are not making a headway in your pursuit, go back to the word and search out what is written concerning you. Every answer to every life question is coded in His word. Find it!",
        "action_plan": "Search through the Bible. Find a word that addresses your mission for the day. Prayerfully apply it and trust God for favour.",
        "thoughts": "Lasting legacies that can withstand all pressures are built on godly principles.",
        "prayer": "Father, through Your Word, I receive instructions for the day and directions in my way. I live by Your word in Jesus' name. Amen."
    },
    {
        "date": "February 11",
        "title": "FROM THE LITTLE IN YOUR HANDS",
        "reference": "2 Kings 4:1-7",
        "scripture": "Tell me, what do you have in the house? And she said, Your maidservant has nothing in the house but a jar of oil. 2 Kings 4:2",
        "text": " When the poor widow whose children were about to be sold into slavery ran to Elisha, she was pointed back to the little she had at home which she despised and counted as not important. To her, it was just a pot of oil, not an oil company. \n\nThis is like the story of Moses when the Lord asked him about the rod in his hand. In the two cases above, both did not see the importance of the little they had. Who would have thought that the deliverance of Israel would come from a rod? Or that the salvation of the widow's household would be from a jar of oil? The Lord wants you to look inwards today. He has deposited something in you that will be needed for the deliverance and salvation of many. \n\nIf you think you do not have a job, have you thought about that skillset God has graced you with? Have you ever used that special and peculiar gifting of God in you? Giftings appreciate with use. If you kill the brilliant ideas, they will never materialise. If you despise the days of little beginning, greater appointments will never show up. If you fan to flame the little fire, soon you will have great fire for heat and light. Maybe you have called whatever you have just a jar of oil like the widow; just a rod like Moses or just a lunchbox like the disciples. The small business you are doing; your little experience at work; your small congregation; your certificate; and even your little faith. They are God's instrument to take you to the next level. Don't despise them.",
        "action_plan": "What little strength do you have? Think of how you can maximise it for greater good and exploits.",
        "thoughts": "God wants to bless what you have. If you have nothing; there will be nothing to multiply.",
        "prayer": "Lord Jesus, I present before You today the little I have. I pray you will multiply and bless it for Your glory. Amen."
    },
    {
        "date": "February 12",
        "title": "PROVISION THROUGH FAITH",
        "reference": "Matthew 6:25-32",
        "scripture": "If God so clothes the grass of the field, will He not much more clothe you, O you of little faith? Matthew 6:30",
        "text": " Faith, as a living thing, has the capacity to grow or die. The daily necessities of life can sometimes leave us weary as we struggle trying to make ends meet. Dwelling on the negativity of life can choke faith to death. \n\nBut when our faith looks up to the Giver of life and Supplier of all needs (including food, clothing and shelter) our faith will rise to embrace these supplies. The distractions come from what we allow into our thoughts. Think impossibility, you will experience impossibility. If you speak possibility, you will have whatsoever you desire in prayer. Faith works with persuasive declaration. Speak by the authority of faith to your life-your family, your work, your spirit. \n\nBe persuaded that God's Word can never lie. The declaration you make in faith becomes the manifestation you see in life. Your faith works for you first before it can work for somebody else. When you look at things from the negative angle nothing works. Don't allow fear to grip your thoughts and make you believe things will be difficult. If things are not working, work it out by faith. See the glorious end, even in the current sufferings. Dwell on God's help in time past. Think about it and you will be encouraged to trust Him for greater things as time goes by. If God can supply the needs of His creation, how much more will He supply that which His children need for daily living! Our little faith, provided it is alive and active, can fetch daily needs.",
        "action_plan": "Identify a lingering problem. Speak to this mountain repeatedly in faith until it moves.",
        "thoughts": "As long as it is alive, keep feeding your faith life through God's Word. It will grow.",
        "prayer": "Father, as I practice this faith principle let every supply be on time. I will not lack shelter, clothing or food in Jesus' name."
    },
    {
        "date": "February 13",
        "title": "DESIRE IN PRAYER",
        "reference": "Mark 11: 22-24",
        "scripture": "Therefore, I say to you, whatever things you ask when you pray, believe that you receive them, and you will have them. Mark 11:24",
        "text": " As Christians, we must realize that there is none in heaven or on earth in whom we can put our trust without being disappointed (Psalms 73:25). Therefore, we must repose unwavering trust in God, believing that He will do what we ask from Him as we carefully commit everything into His hands. \n\nHannah exercised faith as she prayed to God in Shiloh. She was desperate, prayed with the whole of her heart and was passionate about her request. And God answered her prayer by giving her a son, Samuel (1 Samuel 1: 10-16). Hezekiah exercised faith as he prayed to God requesting for healing and God added fifteen years to him (Isaiah 38:5). It was because of his true repentance and prayer that God turned away his wrath and said, I have heard your prayer, I have seen your tears; surely, I will add to your days fifteen years. \n\nIf you have faith and ask in accordance with the will and promises of God, you shall receive. Faith sees the fulfilment of a request before it happens. Believe that you receive them; that they are yours from the time you ask for them. Faith is needed in everything in life. You must have faith to pray. You need faith to be able to access things from God and not really your tears. It is not your tears that make things to happen in your life; it is your faith. Your faith in Christ guarantees your victory and success for you in life.",
        "action_plan": "Keep speaking to your mountains. Keep declaring what you desire in the name of Jesus",
        "thoughts": "Faith is active partnership with the invisible God to get things done in the physical.",
        "prayer": "Thank You Lord Jesus because I know you have answered before I even see the result as I pray in faith (Bring your requests before the Lord, believing)."
    },
    {
        "date": "February 14",
        "title": "SUBTLE COMPROMISE",
        "reference": "Colossians 3:1-10",
        "scripture": "If then you were raised with Christ, set your mind on things above, not on things on the earth. Colossians 3:1-2",
        "text": " The devil deploys tactics that make compromise pleasurable and unnoticed until the believer has gone far. He would not ask you to change suddenly else he will be easily discovered. A gradual stepping back is the way into the life of ungodliness. \n\nThis compromise happens with what we feed our minds on. Like a frog being exposed to a gradual temperature change, many believers are constantly being exposed to a life of compromise until they reach the conclusion that some principles of the kingdom do not matter. In our pluralistic world, there is so much relativity. \n\nPeople now say things like we listen, we don't judge for things that are obviously immoral and ungodly. Getting comfortable with what we disliked before for Christ's sake depicts gradual loss of spiritual hearing and spiritual sight to the corrupt worldly systems. But we will not lose our spiritual vigour in this evil world. Beloved, we will judge through the eyes of Christ.  If Christ remains our object of reference in all we do, the worldly influences leading to spiritual compromise will not catch up with us. Watch out for subtle compromise. A Christian who forgets his calling in Christ and gradually adjusts to his worldly environment is living dangerously. Over time, things he would have condemned outrightly begin to look harmless, appealing and fun. Let us fix our gaze on things above. Let the things on heart be judged by what is done in heaven.",
        "action_plan": "Stand for the truth in God's word even if it is unpopular or looks unappealing in the world's eyes.",
        "thoughts": "In the devil's compromise scheme, there is no sudden slips, only subtle blunders.",
        "prayer": "I don't want to be adjusted to this world Lord. Grant me the grace to set my gaze on things of eternal value in Jesus' name. Amen."
    },
    {
        "date": "February 15",
        "title": "EXCUSES ACHIEVE NOTHING",
        "reference": "Joshua 17:14-18",
        "scripture": "The mountain country is not enough for us; and all the Canaanites who dwell in the land of the valley have chariots of iron. Joshua 17:16",
        "text": " Excuses never get the work done. Asked why they were unable to conquer the enemy in the mountain country, the children of Joseph said it was because of the sophisticated armoury of the Canaanites-chariots of iron. \n\nAlthough they were called great people, Manasseh would not see themselves as such as they got intimidated by the enemy and began to give excuses for their failure to advance in battle. Every time you focus on the strength of the enemy, you lose sight of the back-up of the Lord to give you victory. \n\nHonestly, the enemy you are afraid of is aware of the spiritual power in your possession and would do everything to blindfold you from realising this God-given potential to conquer him. Joshua repeatedly called the tribe of Manasseh the great people because he needed to let them know who they were in the Lord and what havoc they could wreck to the devil's camp. As long as you do not see yourself as strong in the Lord and in the power of His might, victorious Christian life will continue to elude you. Beloved, the devil's joker has been revealed today: it is the blindfold. Take it off your eyes. You are great in the Lord. You are a conqueror. You can achieve God's purpose for your life. No devices of the devil against your life will prosper. No strategy of the enemy is strong enough to stop you on your victory match.",
        "action_plan": "Identify the strengths where weaknesses abound; see the opportunities where threats seem to be strong.",
        "thoughts": "A farmer who blames the weather, the seed and his tools for not planting, will have no harvest when the time comes.",
        "prayer": "Lord, I choose not to complain about my challenges and situation. I will rather look up to You, Lord my sure Help and Defence."
    },
    {
        "date": "February 16",
        "title": "ON THE LORD'S DAY: QUENCH MY THIRST, LORD",
        "reference": "John 7:32-39",
        "scripture": "Jesus stood and cried, saying, if any man thirst, let him come unto me, and drink. John 7:37",
        "text": " Thirst is a strong desire to be filled with water or drink. This desire is a function of dryness: the drier; the thirstier. Be a vessel ready for the filling of the Holy Spirit. \n\nThis you do by emptying yourself of self and releasing your life completely for the grand entrance of the King of Glory. The reason many are not enjoying the life of Christ is because they have not emptied themselves of the life of flesh. When we still hold on to the old lifestyle of doubts and fear, malice and hatred, self-righteousness and self-conceit, where is the space for the Lord to tabernacle? Is anyone thirsty? This was the great announcement of Jesus on the last day of the feast. \n\nOnly those who thirst will be filled. No one can thirst for God if they have already had their fill from drunken lifestyles and riotous living.  No one can be hungry for God if their souls are satiated with food from the rewards of wickedness. There must be a purging from the old to get the new. You must be dissatisfied with your old level and desire a new level in all your life endeavours. You must long for a better life and be uncomfortable with your current state in life. Keep desiring and He will keep giving you more. Jesus was not satisfied with speaking of a river; He referred to the experience of the rivers of life. Add stream to stream, torrent to torrent, river to river. Beloved you are yet to see God's fullness in your life. Empty yourself of the old, desire the new and see the blessings overflow.",
        "action_plan": "Have a strong desire to meet with the Lord as you fellowship with other believers in His presence today.",
        "thoughts": "Your life is no longer an imitation of obedience; it is the outpouring of the Holy Spirit from within.",
        "prayer": "Holy Spirit, I thirst for You; I long for your filling in spirit, in skills, in all life endeavours in Jesus' name. Amen."
    },
    {
        "date": "February 17",
        "title": "PERSISTENCE IN PURPOSE",
        "reference": "1 Samuel 17:26-31",
        "scripture": "Then he turned from him toward another and said the same thing; and these people answered him as the first ones did. 1 Samuel 17:30",
        "text": " Imagine walking on a very slippery floor, chances are that you might fall. The implication of this is that you need a little friction (or resistance) between your feet and the floor to ensure the necessary grip to move you forward. \n\nResistance or opposition to your purpose is not a reason to quit the cause; but a reason to summon courage and move on, fixing your eyes on the purpose and the prize. Unfortunately, many have abandoned projects due to the distractions of persecution, opposition, intimidation and harassment on the way. \n\nLet us learn a lesson or two from the determination of David. He asked questions from the army but met with Eliab's negative remarks about his purpose. Because he was a man on a mission, David simply turned away from Eliab and got answers elsewhere. Soon, the king heard about his purpose and was ready to help him achieve it. If David had succumbed to his brother's opposition, he would negatively affect his path to the throne of Israel. But he refused to be stopped. He kept asking questions. The dissatisfaction in your heart about what you see in your workplace, neighbourhood, colleagues, the society and the church is from God. He placed the thirst and hunger in your heart; troubling your soul to ask questions and act. Beloved, that is purpose defined.  Will you fulfil purpose or allow intimidation?",
        "action_plan": "Do not be quick to quit today. Try another method. Keep the hope alive.",
        "thoughts": "If the road to excellence was smooth, then it will be too cheap to be a thing of honour.",
        "prayer": "I will not give up my quest for God and greatness. I will keep asking questions in prayer and action until the answers come. Amen."
    },
    {
        "date": "February 18",
        "title": "THE REPORTS OF MEN",
        "reference": "Acts 6:1-7",
        "scripture": "Therefore, brethren, seek out from among you seven men of good reputation, full of the Holy Spirit and wisdom  Acts 6:3",
        "text": " There was a great need for men of honour and reputation to render some noble services in the early church. This was crucial because they would be managing people's daily needs and would be entrusted with the responsibility of the church welfare purse and financial resources. \n\nPeter's request was: Brethren, look ye out among you for men of honest report. This implies that the people had the responsibility and honour of selecting who will manage their resources and they better open their eyes and choose right. The records of our lives are embedded in the hearts of people. \n\nApparently, there would have been some in the church who could not be trusted because of their carelessness and dishonesty; the people were watching. There would be some who did not show any form of care about the welfare of others: the people noted that too. There were those who loved the Lord and loved God's people in words and actions, the people took note of that as well. And now the time to put all these qualities and habits they had seen in the brethren into consideration had come. These seven men had been faithful among the many believers over the time, and they were known to the brethren. Men have your report card with them. Your commitment to the things of God or the lack of it. Your sensitivity or otherwise to the needs of others. Your being instant in season and out of season is known to them.",
        "action_plan": "Reflect on this: If God asked people to say what they know about you, what would that be?",
        "thoughts": "Sometimes, the brethren are God's eyes for judging our commitment and character.",
        "prayer": "Heavenly Father, let faithfulness be reflected in my life and labour, both private and public, and in all I do for all men to see in Jesus' name. Amen."
    },
    {
        "date": "February 19",
        "title": "THE TRIAD OF GENUINE LOVE",
        "reference": "1 Timothy 1:1-6",
        "scripture": "Now the end of the commandment is charity out of a pure heart, and of a good conscience, and of faith unfeigned. 1 Timothy 1:5",
        "text": " Love is a word that is most frequently used but most notably misused. While there are many counterfeits, we are going to talk about the genuine love as described by the Word of God. \n\nThe Bible calls it the end of all commandments. Genuine love is produced by God and He has given the ability to reproduce such only to His children by virtue of regeneration. Fake love is on the increase because when anything is precious and frantically sought after by men, others tend to profit by making the counterfeit. Many who claim to love are only showing a conditional type of love. \n\nOthers show kindness for ulterior motives or personal gains. But the love from a pure heart is unconditional, edifying and enduring. The love of God knows no boundary of race or gender. It transcends the height of family ties. It is colour-blind but God-sensitive. Everything we can imagine as the commandment of God is fulfilled in love. God sheds His love abroad in our hearts by the Holy Spirit. Love does no wrong to his neighbour, therefore it is the fulfilment of the law (Romans 13:8-10). A believer who will produce this kind of love must have the virtues Apostle Paul described above: a clean heart, a right conscience and a true faith. If our Christian faith is characterised by this triad, we shall be producing the Godkind of love that is so much in high demand but scarce to find in our world today.",
        "action_plan": "Do a checklist of the triad of love in your life today: clean heart, right conscience, true faith.",
        "thoughts": "All the commandments are summed up in one thing: to love as God loves.",
        "prayer": "Let me love, not just in words, but indeed. Let me love, not only when it is convenient but as a lifestyle in Jesus' name. Amen."
    },
    {
        "date": "February 20",
        "title": "THE SUPERLATIVE CHRISTIANITY",
        "reference": "Matthew 5:13-16",
        "scripture": "Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven. Matthew 5:16",
        "text": " If our Christianity would be attractive to the world, it must be because our light has shone beyond any light they have ever seen. When Jesus said, Let your light so shine, He was not implying that our lights never shone. \n\nHe was saying that it needed to shine with such an intensity that it will catch the attention of the passers-by-an excelling light. Jesus announced His arrival on earth with a star brighter than anyone had seen; so, the wise men were attracted to it, tracing its path as it led them to Jesus. People who aim for mediocrity in life never attract appreciation. John was quietly baptizing in the bush but with a difference. So people left the cities to see him. \n\nThere were people who did miracles before Jesus but when He came on scene, people knew some strange person was around. There were other missionaries beside Paul, but he took his calling to a greater dimension. David wasn't the first king or Psalmsist in Israel, but he is almost synonymous to Psalmss because he took his passion for the work to a newer dimension. What then does it take to shine beyond average? It means that you are not complacent, sitting down on your old success-this is one of the evils that have plagued our world today. It means that you have the courage to be different, to work harder, study more and pray more. Our goal in life is to aim for the Star-to be like Jesus in excellence.",
        "action_plan": "Endeavor to make an indelible impact on others by the acts of your Christian virtues.",
        "thoughts": "Those who dare to be different are the celebrities of the society. There is no prize for mediocrity.",
        "prayer": "I aim for the lofty heights in Christ. I refuse to be discouraged. I challenge the enemy called Average. I am going higher in Christ. Amen."
    },
    {
        "date": "February 21",
        "title": "LET IT BE UNTO ME AS YOUR WORD",
        "reference": "Luke 1:26-38",
        "scripture": "Then Mary said, Behold the maidservant of the Lord! Let it be to me according to your word. And the angel departed from her. Luke 1:38",
        "text": " Mary knew how to maximize the word of prophecy through faith. She was going to experience what had never happened to anyone before: how does a virgin conceive? There is no way this can be explained in human terms. \n\nIn the world of probability, the answer is zero. In the world of possibility, the answer is No. it is only in the realm of great faith that such an utterance from the angel of the Lord stood a chance of being allowed a space in the heart of men. This gives credence to the power that backs the Word from the throne of Grace. When God's Word goes ahead of Him in form of prophetic utterances, no one can explain it. \n\nIt defies the reasoning of the noble. It insults the best of intelligence. It belittles the wisest of men. It confuses the experience of the old. The word travels like a wildfire and consumes every obstacle on its road to delivery. No devil could stop the message of the immaculate conception and miraculous birth of Jesus. Great obstacles simply gave way to the fireballs of Yahweh's utterance as they marched on to actualization. And Mary was willing to be the sole recipient. God has dispatched His word of grace to your life. He has spoken great things concerning His children and it shall surely come to pass. But you need the faith of Be it unto me according to Your Word to attract this uncommon blessing.  Will your faith hasten the delivery, or will your unbelief repel the miracle?",
        "action_plan": "What does the word say about you today. Say Yes! to all of it.",
        "thoughts": "Faith is the tracking device on those to whom God's prophetic declaration will become a reality.",
        "prayer": "My soul says Yes to Your will, Your word, and Your way. Let it be unto me according to Your Word in Jesus name. Amen."
    },
    {
        "date": "February 22",
        "title": "GOD FREES US FROM WORRIES",
        "reference": "Philippians 4:1-7",
        "scripture": "Be careful for nothing; but in everything by prayer and supplication with thanksgiving make your requests known unto God. Philippians 4:6",
        "text": " Worries and anxieties are chokers of the life of faith. They don't help us to overcome our difficulties but make it absolutely impossible to deal with them. Instead of worry, let us reassure ourselves that the Lord is at hand. \n\nLet us repeat it to ourselves that God's abiding presence is here with us: Emmanuel. For this is a great cure for anxiety. Say it when you are irritated, anxious or worried. Say it until there is no room for doubt and fear. Say it until it shines the bright light of hope into your heart again, dispelling the gloom of darkness. Until we feel His presence so close and so real, we may not be able to fully trust that our prayers are heard and will be answered speedily. Until you can hear Hello your telephone conversation is not going through. \n\nWe need to always practice the presence of God. It is not a temporary feeling of love towards God. It is an absolute surrender of our heart unto Him in prayer. It is a place of consciousness of His ever-abiding presence where we talk to Him as our heavenly Father through His Son, Jesus. Hold fellowship with the Lord even amid daily business. Lift your heart often for a moment into the atmosphere of His presence. Rise above the intellectual into spiritual fellowship with God. Be calm in your spirit and let the Lord speak a word of comfort to you-this is a foretaste of heavenly paradise!",
        "action_plan": "Identify your sources of worry. Bring them all to God in prayer. Be sure to leave them with the Lord. Don't go back with them.",
        "thoughts": "God's presence does to worries what light does to darkness.",
        "prayer": "I know that my worries and cares have lingered on because I have not tarried enough in Your presence. Let Your abiding presence dispel all my fears and worries today in Jesus' name. Amen."
    },
    {
        "date": "February 23",
        "title": "ON THE LORD'S DAY: OBEDIENCE IN GIVING",
        "reference": "Proverbs 3:1-10",
        "scripture": "Honor the Lord with your possessions, and with the first fruits of all your increase: Proverbs 3:9",
        "text": " There is a trend recently in these last days prohibiting believers from giving to the Lord. The argument of the crusaders of this unscriptural message is that the substance or money is given to the pastors and not God. \n\nSome claim the money or tithes should be given to charity and not to the house of God. Others say this practice is Old Testament (But Abraham's blessings are not!). Those who understand the principles of giving to the Lord have continued to give and even more. \n\nGod, on His part, has not denied them the blessings that He promised. The Lord seeks to bless those who will obey His instructions. The heart and the substance of the giver are important to the Lord. The Lord loves a cheerful, and not a calculative giver. If there was no mentioning of tithes and offerings in the Bible, some people's hearts will struggle to give. Many have joined themselves to the generation of Cain who would offer unto the Lord as they feel and not what the Lord requires. Some even help to calculate in their little minds how rich God would be from their offerings as if He survives on their taxes. Beloved, do not be part of those who loathe giving to the Lord because of fund misappropriation. Obey the Biblical injunctions by giving to the Lord and be blessed. Leave the managers of the funds to be accountable to God. Prepare yourself first as a living sacrifice to God, then give your ALL to Him including your substance.",
        "action_plan": "Prepare yourself, your heart and your offering as you go to the house of the Lord. Your offering is part of your worship.",
        "thoughts": "A ready heart prepared for the Lord is always willing to give.",
        "prayer": "Father, may I not join myself to the wicked generation of Cain who twist Your Word. My ALL belongs to You: my money and my life. Do with them as You choose in Jesus' name. Amen."
    },
    {
        "date": "February 24",
        "title": "WHAT DO YOU STAND FOR?",
        "reference": "Ephesians 4:11-14",
        "scripture": "That we should no longer be children, tossed to and fro and carried about with every wind of doctrine,  Ephesians 4:14",
        "text": " It is wisdom and great dignity for a man to be known for something and to stand by it. Consistency at your duty post is a mark of honour and respect. \n\nThere are names of great men around us whom we refer to in different disciplines and aspects of life because of what they stood for. They were not given to changing with the tides and currents of life. When things were favourable, they stood for what they believed. When the adversity of life beat hard against their convictions, they were never deterred nor perturbed: they still stood. \n\nIf a man who would not stand for something, he will fall for anything. A Christian who would not stand up for the Lord cannot stand out in the world. If your conviction is not worth dying for, it is not worth living for. Had the first Christians compromised the faith when they were sore persecuted, the history of the church would have been forgotten. Had they diluted the integrity of the Word because of pressures of worldly pleasure and the persistence of heathen persecution; we would have no light left on the candlestick. Thanks be to God: they held on. Therefore, you must stand for the Lord and the integrity of His word. If no one goes with you, go with the Lord. Even if your company is few, let the Lord be sufficient for you. You don't need distractions. Don't go everywhere with everyone like you have nothing on your agenda. Stop following others aimlessly. Find purpose in life and run with it.",
        "action_plan": "Reflect on your life: what do you stand for? Is it worth it?",
        "thoughts": "If a purpose is worth dying for, then it must be worth living for.",
        "prayer": "Lord Jesus, help me focus on you. Let me fulfil my purpose in life. Let no one take my place in You. Amen."
    },
    {
        "date": "February 25",
        "title": "SEASONED WORD",
        "reference": "Colossians 4:1-10",
        "scripture": "Let your speech be always with grace, seasoned with salt, that you may know how you ought to answer every man. Colossians 4:6",
        "text": " Salt is useful because it preserves from decay and corruption and signifies the purity and persevering devotion that were necessary in the worship of God. As stated in Leviticus 3:18, everything was seasoned with it, to signify the purity and perfection that should be extended through every part of the Divine service, and through the hearts and lives of God's worshippers. \n\nSalt is so essential that without it, human life cannot be preserved. Grace is the salt which seasons our discussions and makes them pleasant, spicy and acceptable.\n\nLearn to speak graciously and remove corrupt communication far from your mouth. Do not use vulgar words or rough words. Do not be rude or insulting in speech. Do away with negative and hurting remarks. Speak constructively and rebuke in love with an intention to edify and make better, not to run down and shame. Words, either positive or negative, do not die; they are spirits. Stop engaging in gossip. It is a tool of character assassination. If you have an issue with anyone, speak to him or her in person; do not resort to backbiting. Careless talk may cause a lasting prejudice against the truth. Allow the wisdom of God to possess your heart. Let all discussions be modest and fitting, appropriate and timely as expected of a Christian. Your presentation will look like an apple of gold in a picture of silver if your words are fitly spoken to correct, to rebuke, to encourage and to edify.",
        "action_plan": "Be deliberate about your words. No foul language, no careless talk, no negative utterance. Speak gracious words freely.",
        "thoughts": "Have salt in yourself, and have peace with one another (Mark 9.50).",
        "prayer": "Lord Jesus, may I always have salt in me when I speak the truth in love. Let my words edify and not destroy lives in Jesus' name. Amen."
    },
    {
        "date": "February 26",
        "title": "STAY PLANTED IN CHRIST",
        "reference": "Colossians 2:6-12",
        "scripture": "Rooted and built up in Him and established in the faith, as you have been taught, abounding in it with thanksgiving. Colossians 2:7",
        "text": " Imagine a farmer having planted a seed of corn goes back and uproots it because he doesn't like the location, and plants it in a different place. Then he changes his mind again and transplants it to another location. If he continues to do this at intervals, he will jeopardise the growth of the crop. \n\nHe cannot expect a good harvest at the end of the season. In the same way, we must remain planted and grounded in Christ. He is the only Soil that can sustain our spiritual growth. A believer who always shifts grounds cannot flourish or reach maturity. Beloved, there is an abiding we are called to in Christ. Stay with the Lord even when things are unfavourable. Choose to be on the side of Jesus than to compromise for worldly gains. Do not be carried away by the trends in the world now. They will soon fade away as another rhythm starts. It is only in Christ that we have a sure foundation that cannot be moved. Look at the world of fashion, fame, power and wealth; no one gets it all at once and permanently. \n\nIt is a cycle that goes and comes back. Abide in Christ and be strong. The reward of abiding in the Lord Jesus is fruitfulness. The fruit of abiding is all-round (John 15:4). When you focus on Jesus and stay committed to the way of the Lord, you will grow your potentials in Him. The nutrients we receive from this abiding breed in us enduring fruits. Stop hopping in and out of faith; stay rooted in Christ.",
        "action_plan": "Learn to be loyal and committed to a good cause, a good congregation and a good institution.",
        "thoughts": "Those who are planted in the house of the Lord will flourish in His courts.",
        "prayer": "Plant me in Your court Lord. Let nothing on earth or in heaven move me. Let me be steadfast in You forever in Jesus' name. Amen."
    },
    {
        "date": "February 27",
        "title": "GOD IS WORKING IN YOU",
        "reference": "Philippians 2:1-15",
        "scripture": "For it is God who works in you both to will and to do for His good pleasure. Philippians 2:13",
        "text": " God gives power to will, man wills through that power. God gives power to act, and man acts through that power. Without the power to will, man can will nothing; without the power to work, man can do nothing.  God neither wills for man, nor works in man's stead, but he furnishes us with power to do both. \n\nWe are therefore accountable to God for the powers of will and action. Praise God for the strong desire to serve Him and work in righteousness. When your first priority is Christ, He releases great confidence to you to do what is right. The Bible and indeed our contemporary times are full of examples of people who were graced with both the right will and the right action. If a man has the wrong will, he will put all his energy in the wrong action. \n\nSuch are the men who labour and gain speed in the wrong direction. The more they run, the farther they get from their destination. But when the Lord guides us to follow the Father's will, we will see all our action tailored in the way that pleases God. We will quit labouring under a closed heaven because our actions are God-centred. If a person does not release his vessel to be used of God, God's purpose will still be accomplished. However, such a person will have missed out of the privilege to be a carrier of the grace for accomplishing God's purpose. God wants to put His will in your heart so He can use you for great exploits. Will you be willing and obedient?",
        "action_plan": "Intentionally pray about every move, every step, every decision today.",
        "thoughts": "If you are willing (will) and obedient (do), the good of the land is all yours.",
        "prayer": "Lord Jesus, let my will be buried in Yours. Stimulate my heart to be ready to do of Your good pleasure in Jesus' name. Amen."
    },
    {
        "date": "February 28",
        "title": "TOO LATE TO GO BACK",
        "reference": "John 6:65-71",
        "scripture": "But Simon Peter answered Him, Lord, to whom shall we go? You have the words of eternal life. John 6:68",
        "text": " A man was asked to leave the camp of his friends if he was unsatisfied with the latest decision of the society about his conduct. Being a foundation member of that society, he replied: I have spent most of my adult years in this society even before the creation of the rival group. \n\nI built this place with my sweat. Where will I start from? He decided to remain. For a journey of ten miles, if a runner has gone nine miles, it only makes sense to persevere and complete it. Looking back at what it cost us to get this far may be a reason to endure to the end. Peter and the rest of the apostles made a smart decision. \n\nTheir few years of experience in the circle of Jesus were more eventful and interesting than the decades in the camp of the enemy. They had witnessed first-hand miracles; cast out devils; participated in a net-breaking catch of fish; seen the dead brought back to life; heard the Word of life and could not think of any other kind of life to enjoy. For them, there was no option of going back. Life without Christ will be boring for someone who has had a genuine encounter with the Word of life and the Spirit of grace. Beloved, this life with Jesus has become the surest life you know. Think of God's goodness over the years; it is worth continuing in His service. If you choose to go back to the world, where would you start from? You will be a low-level player in the devil's world of struggle, pain and suffering. Make a smart decision like Peter did; continue till the end.",
        "action_plan": "Keep on keeping on. Say to yourself today: I have gone too far to quit!",
        "thoughts": "It isn't worth the stress to turn back now, seeing you're almost at the end of the tunnel.",
        "prayer": "Father, You are the Strength of my Life; You are the only life I now understand. Give me grace to hold on to You to the end in Jesus' name. Amen."
    },


    
    {
        "date": "March 1",
        "title": "BREAK OUT!",
        "reference": "Genesis 38:27-30",
        "scripture": "Then it happened, as he drew back his hand, that his brother came out unexpectedly; and she said, \"How did you break through? This breach be upon you!\" Therefore his name was called Perez. Genesis 38:29",
        "text": " Tamar conceived and was to be delivered of a set of twins. At delivery, the first twin to attempt breaking out was Zerah. He brought out his hand and then drew it back. Afterwards the other twin, Perez took courage, attempted a breakout and succeeded, thereby becoming the firstborn son. \n\nThis breaking out put Perez in the ancestry of Jesus Christ but little was heard about Zerah afterwards. His attempt counted for nothing because it lacked the expected result: he retreated when it mattered most. He did not push until the end. Life is not for the timid. \n\nSuccess is not for complainers. Victories are not for doubters. To enjoy blessings, you must learn to endure hardship. Timidity and lack of courage leads to defeat. The same opportunity that presented itself for Zerah that he held back his hand is what Perez maximized. Sometimes situations of life attempt to pull us back. Like Zerah you may have held out your hand ready to receive the trophy, but something seems to pull you back at every attempt. It could be an attitude or character flaw, lack of preparation or a familial trend. Beloved it is time to maximize every God-given opportunity today. Let faith be mixed with courage in your heart and get ready to move at the impulse of God's command. Whatever opportunity presents itself to you also has others waiting on the list to grab it. Do not waste God's grace, gift, and talent. Maximise the opportunities.",
        "action_plan": "Identify three (3) factors responsible for your holding back where you should be breaking forth.",
        "thoughts": "For every opportunity God presents me today, there are many waiting in line to grab the same.",
        "prayer": "For God has not given me the spirit of timidity (2 Timothy 1:7). I receive the sound mind and courage to go forward and break forth against all odds in every area of my life endeavour in Jesus name. Amen."
    },
    {
        "date": "March 2",
        "title": "ON THE LORD'S DAY: YOU ARE SPECIAL",
        "reference": "1 Peter 2:1-12",
        "scripture": "But you are a chosen generation, a royal priesthood, a holy nation, His own special people, that you may proclaim the praises of Him who called you out of darkness into His marvellous light: 1 Peter 2:9",
        "text": " We are called to a royal life. We are chosen, distinct from others, and separated for a divine purpose. We are a royal priesthood. We are kings to reign with Christ and priests to offer spiritual sacrifices to Him. Also, we are a holy nation, having been called out of the world and dedicated to the service of Christ. \n\nAnd finally, the key verse describes us as a peculiar people, implying we are uncommon people. We have in our hands the staff of authority of Christ to enforce His will on earth. By it, we are to reclaim all the people that have been lost to the devil. We must always remember that we were once un-royal. We wallowed in the pit of hell, living a life of misery and poverty of soul. We can still remember not long ago when we felt helpless about our state. \n\nThe devil used us as he wanted. He tormented us and caged us into a life of eternal damnation. But Jesus freed us, having purchased us by His blood. And that is why we are able to come before Him without any guilt or shame. We know that the purchasing power of His blood has the capacity to buy back the entire world: He has paid the debt of everyone. If God has brought you from nothing to something, then you must publish this word that saved you without hesitation. Your testimony of salvation can encourage others to seek their own salvation. You are God's instrument to do His work. Speak for Him, share generously and inform others of the new life in Christ.",
        "action_plan": "Recount the profound changes you have experienced in your life since you met the Lord Jesus.",
        "thoughts": "He separated you from the world to show you off to the world, so they can be drawn to Him.",
        "prayer": "Father, as I acknowledge the rich mercy and free grace of God in my life, help me to tell others where God has brought me from in Jesus name. Amen."
    },
    {
        "date": "March 3",
        "title": "BREAK THROUGH!",
        "reference": "Genesis 49:22-26",
        "scripture": "Joseph is a fruitful bough, A fruitful bough by a well; His branches run over the wall. Genesis 49:22",
        "text": " What a productive and abundant life a fruitful bough or vine is. In drought or rain, in adverse or favourable conditions, it thrives. That perfectly describes Joseph. He was unstoppable because his branches ran over the wall. Whatever stood in his way, he was determined to conquer. \n\nThe venom from his kinsmen, the dryness of the empty pit, the slave trade of the Ishmaelites, the seduction of Potiphar's wife, the prison experience-none of these walls could make him lose the focus: he was meant for a royal life in the palace. Just as a fruitful vine produces abundant fruit, Joseph's life was marked by remarkable productivity and achievement. \n\nDespite facing numerous challenges, he continued to produce fruits of wisdom, leadership, courage, character and even selflessness. Sometimes, the condition we find ourselves in may not be optimal but our resilience to be fruitful will give us a spiritual edge in the world filled with challenges. Jesus makes it abundantly clear that there will be many tribulations, but we can be victorious because He has conquered the world for us (John 16:33). When you persevere, the blessings of fruitfulness will follow you. You will be a fruitful life with the spiritual fruit of love, joy, peace, and righteousness even in the perverse world (Galatians 5:22-23). By the inner strength given by the Holy Spirit, you will break through barriers of challenges to reach your goal in Christ.",
        "action_plan": "Identify three (3) daunting challenges to your goals-spiritual, secular (career/academic), marriage. Prayerfully tackle them.",
        "thoughts": "A vine that will be fruitful will devise a way around obstacles of height, depth or drought.",
        "prayer": "Father, I receive the inner strength and divine wisdom to excel amid failures, be productive in the land of barrenness and to be wealthy where men see poverty in Jesus' name. Amen."
    },
    {
        "date": "March 4",
        "title": "THE UNSTOPPABLES",
        "reference": "Judges 15:9-16",
        "scripture": "Then the Spirit of the LORD came mightily upon him; and the ropes that were on his arms became like flax that is burned with fire, and his bonds broke loose from his hands. Judges 15:14",
        "text": " Like Joseph, Samson was another unstoppable man. He could not be restricted or hindered because he carried fire. Though he was bound by his brethren, when it was time for action against his enemies, the strength of the binding failed before the fire of the Lord. \n\nThe Bible described the ease with which he removed the hindrance as when flax was burned with fire. It is interesting to see what the fire of the Spirit of the Lord could accomplish in the Old Testament times. How much more in this dispensation of the better covenant? It does not matter the amount of hindrance the devil piles up around your business, your marriage, your career, your ministry or your academics, the Holy Ghost fire is strong enough to break the devil's chains. \n\nWe are unstoppable in our pursuit of excellence because the Holy Spirit leads us on. There is an anointing that breaks the yoke of sin, sickness and sorrow. Every obstruction on our way to glory is turned to wax and shall melt as it comes in contact with the fire that we carry. The question then is, What do you carry? What are you made of? If you are made of fire, then the obstructions are not tough enough to weaken your resolve to follow hard after the Lord or impede your progress in life. You will advance but they will melt away. You will progress but your adversaries will fade away.",
        "action_plan": "Rebuke one after the other all obstacles standing in your way of progress.",
        "thoughts": "A fatal fate awaits the spider web trying to hinder the advancement of an approaching elephant.",
        "prayer": "I declare today by the authority of the Word of the Lord that every hindrance and restrictions on my life and destiny be burnt to ashes by the fire of the Holy Ghost in Jesus name. Amen."
    },
    {
        "date": "March 5",
        "title": "THE EARLY BIRDS",
        "reference": "Exodus 16:11-21",
        "scripture": "So they gathered it every morning, every man according to his need. And when the sun became hot, it melted. Exodus 16:21",
        "text": " Early in the morning is the best time to collect unpolluted water from the river. At this time, there are few wading feet in the river. On the other hand, those who wait till late hours are likely to meet sediments, pollution, and contamination from the activities of the early birds. God's provision for the children of Israel in the wilderness was manna. \n\nHe instructed them to gather the daily food provision in the morning. For the lazy ones who preferred to gather manna when the sun is high, it would have melted and lost its texture. If you want quality materials from the market, you go early. \n\nThose who get there before you would have picked the best, leaving behind the inferior ones. Great achievers seek the Lord early in the morning. Therefore, in seeking God, seek Him early in the day (Psalmss 63:1) and early in life (Ecclesiastes 12:1). Therefore, in life, start early. Do not wait until all your mates are gone before you wake up to the reality of the wasted years. We must ask the Lord to satisfy us early with His mercy, that we may rejoice and be glad all our days (Psalms 90:4). Let your first meditation daily be on the Lord. Before you open the emails; before you check your diary; before you turn on your computers, phones and other gadgets, turn to the Lord for the strength, grace and direction for the day. Life can continue without all these but your life ends without the daily sustaining power of God's breath.",
        "action_plan": "List your early morning priorities. Check if they are things that matter to your daily productivity or not.",
        "thoughts": "When a life or a schedule is well prioritised, it becomes more efficient and effective in its delivery capacity.",
        "prayer": "Father, I prioritise You today above the air I breathe and my necessary food. Make me an early seeker of You in order to maximise my day for effective use in Jesus name. Amen."
    },
    {
        "date": "March 6",
        "title": "THE SOURCE MATTERS",
        "reference": "Isaiah 51:1-12",
        "scripture": "\"Listen to Me, you who follow after righteousness, You who seek the LORD: Look to the rock from which you were hewn, And to the hole of the pit from which you were dug. Isaiah 51:1",
        "text": " A fabric is smoothened when a hot-pressing iron is placed on it. To achieve this, the electric iron is connected to a power source which helps its heat generation. It will be foolhardy for such an appliance to pull off from the electric socket and still expect that it will produce the same heat necessary to ensure a smoothened fabric. Such a disconnected pressing iron has lost its relevance and cannot make clothes look good. \n\nIn many cases, its surface becomes so cold that men can put it on their cheeks without any effect. No heat, no power, no usefulness. You are the electric iron; the Lord is your source of electricity. You must depend on Him constantly and absolutely for life sustenance. \n\nAny attempt at independence will spell coldness and irrelevance. Seek the Lord's face daily for renewal of spiritual energy. Coldness sets in when you lose touch with the reality of heaven. Life starts to get uninteresting and frustrating when your altar becomes cold. It then breeds all kinds of evil. It is no longer a threat to the host of darkness. Go back to the Source who is the Lord and He will restore your spiritual vibrancy. Beloved, yesterday's grace cannot sustain you today. It is stale, dry and useless. You need a fresh touch. Do not rely on previous collection of grace. You need a daily collection through a stable connection-a living altar. Even if an electric iron had smoothened a thousand clothes in the past; disconnected from the source, it cannot iron the next piece of cloth.",
        "action_plan": "How often are your thoughts about the Lord? How frequently do you depend on Him for direction and leading in life?",
        "thoughts": "Get plugged always to the Holy Spirit: the daily connection is more important than a daily collection.",
        "prayer": "I need You every hour, Holy Spirit divine. For there is no tender voice like Yours that can assure me of tranquillity in life. Amen."
    },
    {
        "date": "March 7",
        "title": "WELLSPRING OF LIFE",
        "reference": "John 4:11-15",
        "scripture": "But the water that I shall give him will become in him a fountain of water springing up into everlasting life. John 4:14",
        "text": " The water we get from the world comes at an expensive price. The water the world gives is a collection which can be exhausted. But the water that Jesus gives springs up from within us as long as we are connected to Him as the Source of this wellspring of life. \n\nJust imagine how much capacity the Samaritan woman's waterpot must have. She will have to make many trips to the well. But Jesus promised to replace the tiredness of drawing-up from the well with a stressless rising-up of the spring in the well. The water Jesus gives is free for all. The water the Lord gives does not run dry. The Lord does not require our effort of drawing the container because it is from a deep well with a spring in it-it comes readily to the surface for us! This water guarantees a life free from thirst; the water from the world quenches one's thirst but for a while. \n\nThis water of life is the Spirit of Christ. We will no longer experience a struggle in our Christian walk if we trust the Holy Spirit. When our strength is exhausted, He steps in, carrying us all the way to our destination. Let your daily desire be to get the Living Water so we do not go to the world again to draw water. Our life is a useless adventure without the Spirit of the Lord. True Christian faith is the union of the Spirit of God with the human spirit effected through Jesus. If we step into each day with this assurance, our dependence on the Lord will be absolute.",
        "action_plan": "Keep asking the Lord to give you His grace and power at a baptismal level-until you are totally immersed.",
        "thoughts": "When you are tired of drawing-up water, you can come to the rising-up of the springs.",
        "prayer": "Dear Saviour, immerse me deep into the water of life. Refresh my spirit in Your presence. When you are done, fill up many lips and weary hearts through me in Jesus name. Amen."
    },
    {
        "date": "March 8",
        "title": "THE LIGHT THROUGH CHRIST",
        "reference": "John 1:1-9",
        "scripture": "That was the true Light which gives light to every man coming into the world. John 1:9",
        "text": " It is unfathomable why such a lowly born, who lived among the peasant people of His time, unarmed, with no political affiliation would remain the most influential man of all times. He is without question the most powerful and the greatest man that walked the surface of this earth. \n\nHis followers are like the sand of the seashore yet they hold no physical weapons of war. People hear about Him and are just unable to resist His influence on their being. He transforms instantly because He is the Light that shines in the world's darkness. And the entire world needs light. The people which sat in darkness saw a great light; and to them which sat in the region and shadow of death light is sprung up. (Isaiah 9:2; Matthew 4:16). \n\nJesus is the life-giving light that rescues us from eternal damnation. The great light that reveals every secret and makes every intention known. The pure light that floods our hearts with the correctness or otherwise of every decision we make in life. The guiding light that directs our paths so we do not stumble. The guarding light that drives out confusion and uncertainty on any issue. The good news is that every light needs a medium to keep perpetuating its effects in the environment. Will you enlist to be recruited among those through whom Jesus will have His light shine to reach everyone. The previous volunteers are the reason you heard the gospel. Join the current set of light bearers and watch the world glow because of you.",
        "action_plan": "Light is positive influence through Christ, with you as the medium. Give someone the light of comfort, peace, hope, and courage today.",
        "thoughts": "If the light of Christ shines through you, you can never be ignored or unnoticed.",
        "prayer": "You spoke Your light into my darkness and now I see clearly. Let me also be an answer to the darkness in the lives of men in Jesus name."
    },
    {
        "date": "March 9",
        "title": "ON THE LORD'S DAY: SILENT LABOUR",
        "reference": "1 Thessalonians 1:1-10",
        "scripture": "Remembering without ceasing your work of faith, and labour of love, and patience of hope in our Lord Jesus Christ 1 Thessalonians 1: 3",
        "text": " In the Bible, there are names that are mentioned not usually as the main character but in the background. We remember Aaron the priest to Moses, Caleb the soldier to Joshua, Jonathan the prince to David, and even John the Baptist to Jesus. Imagine what the work of the main character would have been like had these quiet supporters not been provided by God. \n\nThere are many believers in the church who are ushers, organizers, administrators, intercessors but are unknown to the people. These provide help to God's chosen vessels and their rewards are huge too. Are you a silent labourer in God's vineyard and it seems your labour is unnoticed? \n\nGod sees you and recognises your labour. If Jesus could notice the little offering of the widow in Luke 21:3-4, He will notice your uncelebrated efforts. You may be an unsung hero to men, but there is no service rendered in God's name that goes unnoticed. He is not unjust that He will forget your labour of love that you did towards His name. Do not be discouraged because no man seems to be clapping for you. Heaven is making a big applause that will transform your destiny. Be satisfied with where God has placed you to work. Do it with all your heart and be a great support to the work and the front workers. God is counting on you so don't let Him down. If you have been faithful in someone's work; He will soon commit your very own into your hands. Keep working cheerfully; God remembers.",
        "action_plan": "What silent work are you doing for God that no one notices? Be encouraged today that God sees.",
        "thoughts": "Quiet labour for God is rewarded with a loud harvest from God.",
        "prayer": "Lord I am encouraged that You reward quiet labour. I choose to focus on You as I labour for You and not man in Jesus name. Amen."
    },
    {
        "date": "March 10",
        "title": "ACTORS OF FAITH",
        "reference": "Numbers 25:1-9",
        "scripture": "Phinehas rose from among the congregation, took a javelin in his hand So the plague stayed from the children of Israel. Numbers 25:7-8",
        "text": " Actors play roles in plays or movies till they become notable stars for good or bad, mediocrity or excellent accomplishments. In Israel, many actors who played outstanding roles outrightly defended the faith. Joseph, David, Phinehas, Moses, Elijah, Hannah, and Samuel are a few examples. \n\nThese heroes of faith acted the word of God till the manifestation came. A child of God that has zeal for the Lord will not sit and watch negative events happen in the house of God. He will not allow the name of the Lord to be dragged into the mud. Phinehas was used by God to execute judgment against the sin of adultery between an Israelite and a Midianite. Phinehas' response to the evil act was right and timely. He fought as a one man squad. He shunned all distractions and was determined to defend the faith. \n\nAs Christian soldiers we must not only live holy lives but we must be prepared to fight against evil around us and especially in the house of God. Never keep quiet and allow sin, strife, divisions and all manners of unrighteousness to become a norm in the house of God and our society. Have you asked yourself what impact you are making in the church and society? In what way can you defend the faith that you profess? We must be zealous enough to maintain the glory of God. We should not be too relaxed and carefree about our Christian faith. God is looking for men to be answers to problems, and not extensions of the problems.",
        "action_plan": "Be deliberate about impact-making. Begin with your neighbours. Always leave a positive godly impression.",
        "thoughts": "If they cannot feel you when you are there; no-one will miss you when you leave.",
        "prayer": "Heavenly Father, whenever a dedicated few who pour out their heart and soul to serve the Lord are mentioned, count me worthy to be among them in Jesus name. Amen."
    },
    {
        "date": "March 11",
        "title": "ACTING LIKE GOD",
        "reference": "Acts 14:8-18",
        "scripture": "Now when the people saw what Paul had done, they said, \"The gods have come down to us in the likeness of men!\" Acts 14:11",
        "text": " People have a faint idea of what the attributes of the divinity should look like. If they see anyone demonstrate such qualities, they can fit him or her with the title of God. Coincidentally, God seeks men, not to take His place as God, but to speak and act for Him. He needs yielded vessels He can possess and through them save the world from self-destruction. \n\nPaul and Barnabas did not need to announce that God was around, they only needed to demonstrate to the people what only God can do. Their actions made the people conclude that Immanuel had come. People need the Lord but they also feel He is so far away and they cannot reach Him. But when they see the acts of God demonstrated by you, they know the Lord is nigh. And these carriers of God are men who have been conquered and broken by the Lord and are ready in every sense to be used for His service. When Paul and Barnabas spoke for God, the men of the city respected their words because they spoke and acted like God. What does your speech sound like in the ears of men: words of men or the voice of God's instruction? \n\nDo your actions repel them from Christ? Even though they may be uninitiated, the world knows the message of the Lord when they hear it. When preachers speak carnality, they can catch fun and laugh. But when men of God speak of the Spirit, the world bows in reverence for the Word. Choose to be a carrier of God: speak for Him, act like Him and the world will know God is nearby again.",
        "action_plan": "Pray today that God will rid you of self and make you a vessel through whom He will make Himself known to the world",
        "thoughts": "Until you are totally broken and ridden of yourself, you cannot effectively carry God and show Him to the people.",
        "prayer": "Father, the weight of the glory You reveal in Your chosen vessels is beyond human capacity and comprehension. May I be humble and yielded to You so you can fill me up in Jesus name. Amen."
    },
    {
        "date": "March 12",
        "title": "STOP BORROWING TROUBLE",
        "reference": "Matthew 6:25-34",
        "scripture": "Take therefore no thought for the morrow: for the morrow shall take thought for the things of itself. Matthew 6:34",
        "text": " People have the natural tendency to worry about where food, clothing and shelter would come from (Matthew 6:25-28). If we are worried about tomorrow, we are borrowing trouble from tomorrow and paying interest on it ahead of time. But Jesus does not want us to spend our energy and time to worry about things that will happen in the future. \n\nThis does not mean that we should not plan and prepare for events in our lives. But we must not torment ourselves today with fears of the negative things that might happen tomorrow. Each day has its peculiar challenges, difficulty and trials. We should meet them with confidence in God.\n\nOur heavenly Father designed us to live a day at a time, so we should take care to suffer no more evils in one day than are necessarily attached to it. He who neglects the present for the future is acting contrary to God's order and the dictates of sound wisdom. You always have a choice as to how you will spend the gift of the present-day God has given you. If you use it wisely, it will bring fruits of greatness for you. God has not quit the business of providing for all creatures, great or small. He is not complaining about the economic realities in the world. He is not downsizing or laying off workers in His vineyard. In fact, He is always recruiting. He is not perturbed by the enormity of any task in this world. He is ever ready to meet the needs. So, do not worry.",
        "action_plan": "Sincerely write down things that cause you to worry-the economy, sickness, unfaithful brethren, disobedient children-etc. Cast all burdens on the Lord in prayer (1 Peter 5:7).",
        "thoughts": "If my worry cannot solve it, let my prayer soften it.",
        "prayer": "Dear Lord, help me to live one day at a time. Help me to step forward each day as the Holy Spirit guides and start to see the awesome ways God will work in my life. Amen."
    },
    {
        "date": "March 13",
        "title": "THE NECESSITY OF A CHOICE",
        "reference": "Matthew 6:24-34",
        "scripture": "No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. Matthew 6:24",
        "text": " There is a law of human nature that says that the supreme affections of a person can be fixed on only one object at a time. And when the need arises for you to make a choice about what you love supremely, what will that be? Wealth here doesn't refer to just money, though money tends to be the biggest player in this. \n\nMammon is anything that we prize and make the most important in our lives. It could be your career, family, spouse, children, leisure, pleasure, sports or even food, clothing and shelter. What factors motivate our actions and choices in life? The one we serve is the one who has the final authority over our decisions and dictates our actions. \n\nWhether we go for the decision that brings most money or God's will is a function of who I choose to obey, God or mammon. Our busy schedules exist because we have up-side-down priorities that are never satisfied. When we run the rat race of payments and debts, we become servants to money. Many serve prestige, position, possessions, power and the praise of men. Let's serve the Lord and stop devoting our time, energy and love to what will burn. Do not allow anything to come in between you and Our Lord Jesus Christ. Maintain a good relationship with Him for it pays to serve Jesus. Remember, after all those material things do the unbelievers run but your father knows your needs.",
        "action_plan": "Think on this, what things of little or temporary value do I devote my time and energy to?",
        "thoughts": "Decision to follow hard after the Lord is the best decision in life. It is eternally rewarding."
    },
    {
        "date": "March 14",
        "title": "THE GOD THAT CLOTHES",
        "reference": "Matthew 6:25-32",
        "scripture": "If God so clothes the grass of the field, will He not much more clothe you, O you of little faith? Matthew 6:30",
        "text": " As the first Fashion Designer the world ever knew, God is still in the business of clothing men. Adam and Eve were naked because of their disobedience. They lost the covering of God's glory which was the source of their dominion. But God, who is rich in mercy, would not want them to remain in nakedness, therefore He clothed them. \n\nJesus referred to the clothing ability of God going beyond just humans to include flowers. God does more than just cover them; He decorates them in addition. Your old garments are long worn-out and they need to be changed. You are worried if there will ever be a replacement but if God so clothe the flowers on the field, He is making special garments of honour for you.\n\nEven though men have known you with rags, an end is coming to that today. Your nakedness may have been a source of daily mockery but the Father is designing beauty and glory to cover you. If sin and lust were your clothing, it is time to change them for the garment of righteousness which the Lord Himself sews for His children. Do you need a change of garment? It is time to shop in God's boutique of glory where shame is replaced by fame. If you are tired of a life of mediocrity; He has got that covered too with excellence. Maybe you feel lonely, abused and forsaken, God is putting the finishing touches to your garment of celebration and restoration. Hallelujah!",
        "action_plan": "Determine to improve in specific areas of life-change the old garment for the new.",
        "thoughts": "With God as my Father, I can never dance naked in the market. He will clothe me with honour and glory",
        "prayer": "Father, give to me a garment of praise to replace my worn-out spirit of heaviness. Make me rejoice again in your love and your revival in my life in Jesus name. Amen."
    },
    {
        "date": "March 15",
        "title": "SPIRIT OF UNDERSTANDING",
        "reference": "Psalmss 119:125-130",
        "scripture": "I am thy servant; give me understanding, that I may know thy testimonies. Psalmss 119:125",
        "text": " David prayed for understanding so that he could know the testimonies of God. Testimonies are witnesses usually presented in words. Testimonies are the fact behind a situation. David was asking God to help him understand what He was saying. He was asking for understanding so that He could know what God approves. He was asking for understanding so that he could know the fact behind a situation. Understanding is key to spiritual discernment. \n\nGod speaks to us daily in many ways and a man of understanding gets the signals. There are many things that happen in life on a daily basis but due to lack of understanding, people do not pay attention. If we have the spirit of discernment, we will use many life occurrences to our advantage.\n\nVictims of circumstances don't know how to read the handwritings on the wall. They see evil and cannot hide. They smell danger but cannot plan ahead to avoid being victims. But a man of understanding is sober and vigilant enough to know what God is saying through the occurrences in the day. Today will also speak like yesterday did but will you listen? Will you be able to discern? It will be great to understand when God is testifying (witnessing) something to you today. Each day is an integral part of our life. Can we pray, like David did, for divine understanding for every moment of the day?",
        "action_plan": "Rather than rush into any decision-taking today, ask questions to know how it works and what must be done."
    },
    {
        "date": "March 16",
        "title": "ON THE LORD'S DAY: PREVAILING WORD",
        "reference": "Acts 2:37-47",
        "scripture": "Now when they heard this, they were cut to the heart, and said, \"Men and brethren, what shall we do?\" and that day, about three thousand souls were added to them. Acts 2:37, 41",
        "text": " This is the day that the Lord has made. We will rejoice and be glad in it. As we rejoice, it is my desire that we will also hear God's word clearly in our heart. So many activities go on in the heart of church members but we all need a word that will stop us in our track and focus us on God. We all need a word that will touch our soul and cut us to the heart. \n\nWe need the word that will lead us to our knees, seeking the Lord for the way forward in our lives. We need a word that will correct our lives, heal our hearts and restore our hope in God's power to save and deliver. The day of Pentecost started quietly but ended on a big note.\n\nWho would have thought the prophecy of Joel 2:28 was about to be fulfilled? When Peter spoke to the people who gathered, his message cut them to the heart. He did not just put words together for the sake of making a speech. No inspirational or motivational talk. He was not trying to make them like him. The message went out with such power that the people were convicted. Before he made an altar call, the people already asked how they could be saved because the message touched them. May the messages from our churches today bring succour to lives. May we experience the power of God demonstrated as we open our hearts to the entrance of His word. Prepare your heart for the word. Be a yielded vessel and be ready to ask, What must I do? God will be sending His word to touch your heart. Prepare your heart to benefit from the word.",
        "action_plan": "Shun every distraction. Listen attentively to the Word. Listen to get your own word from the Lord.",
        "thoughts": "A message that will convert must never be lacking in the demonstration of the Spirit and power.",
        "prayer": "Let Your word come with power and yet with simplicity and let my heart be cut through with the truth of Your word. Let all worshippers today hear Jesus clearly through the messages in Jesus name. Amen"
    },
    {
        "date": "March 17",
        "title": "FUNCTIONING SENSES",
        "reference": "Matthew 13:10-17",
        "scripture": "But blessed are your eyes, for they see: and your ears, for they hear. Matthew 13:16",
        "text": " There are artificial senses designed for aesthetics. They are like a beautiful doll's eyes but they cannot see. In the spirit, there are people whose eyes can be described like this. \n\nLittle wonder many people of earthly wisdom do not buy into the deep things of God. It remains foolish to them; they do not understand it. But the importance of spiritual insight into the things of God cannot be over-emphasized. We do not see spiritual things with physical eyes: they are too shallow to see deep things. We need the understanding that comes from God. The words of Jesus remained parables to the uninitiated, uninterested and uninquisitive.\n\n People who do not cultivate the habit of tarrying with the Master to ask more questions are unable to fully comprehend the sayings of the Lord Jesus. When we are too lazy to search into the scriptures, and pray on the matters of spiritual importance, our understanding of Godliness and the way of holiness becomes darkened. Those who went back to Jesus received clear interpretation of the parable of the Sower. Those not interested remained novices. How much do you long to press on to understand the things of the spirit? If we do not know the importance of each word that Christ speaks into our lives, how can we make our hearts ready to receive the fulfilment of the same word? If we are unbelieving and inconsistent, how would we be able to appropriate the rain of His presence when it comes?",
        "action_plan": "God is willing to tell you if you are ready to ask. Let your prayers be like an inquisitive child who desires to know.",
        "thoughts": "Those who ask questions desire answers, light and understanding.",
        "prayer": "Lord Jesus, deepen my spiritual understanding that I may comprehend what You have for me in life and bear the right fruits You expect from me. Amen."
    },
    {
        "date": "March 18",
        "title": "FLOW WITH LIKE MINDS",
        "reference": "Genesis 1:9-13",
        "scripture": "Then God said, \"Let the waters under the heavens be gathered together into one place, and let the dry land appear\"; and it was so. Genesis 1:9",
        "text": " The earth was initially covered with water. Then God spoke the word that caused a separation of the waters from the earth. This word caused the dry land which had been hidden under the waters to come into sight. \n\nIt was only after this separation that God spoke to the earth for plants to come forth from it. Imagine that the waters had not been separated from the earth. The plants would have appeared no doubt but they would have been hidden by the waters. The glory of the plants could only be seen when the waters were gone. In Genesis 13:14, the Lord spoke to Abraham after Lot separated from him telling him to lift up his eyes and look through the land. Lot's presence prior to now had restricted Abraham's ability to see what the Lord was about to reveal. \n\nAfter his departure however, Abraham could look up and see. Just as the hidden earth came forth to bring fruitfulness after the waters were taken away, Abraham gained the strength to move through the land after the departure of Lot. What Lot saw as barren land turned out to be one filled with milk and honey. Is there something restricting your accomplishment today? Are there waters covering your land preventing you from planting and receiving the harvest? It is time to declare a separation between the land and the waters. It is time for the dry land to appear so the earth can bring forth plants with seed in them after their kind.",
        "action_plan": "Choose your company rightly. Stay with people of like minds. Company with the wise and be wise.",
        "thoughts": "No matter how hard you try, oil and water will not mix.",
        "prayer": "Today, I decree a separation from everything restricting my sight and every water covering my productivity. I am separated from all that reduce my potential in Christ in Jesus name. Amen."
    },
    {
        "date": "March 19",
        "title": "THE FACT AND THE TRUTH",
        "reference": "John 14:1-7",
        "scripture": "Jesus said to him, \"I am the way, the truth, and the life. No one comes to the Father except through Me. John 14:6",
        "text": " Many times, the facts of life are at variance with the truth of the word of God. For instance, when Jairus begged Jesus to heal his daughter and there was a delay on the way, those who were in his house came to stop him. His daughter had died and there was no need bothering the Lord anymore. \n\nJesus told him that his daughter was only sleeping (Luke 8:41-56). The fact as people saw it was that his daughter was dead; the truth was that Jesus was able to restore his daughter's health and life. Not giving up, he received his daughter back to life. In John 4:46-53 there was another man who came to Jesus because his son was sick to the point of death. Jesus sent him home telling him his son was healed. The fact was his son was ill when he left home and he could not confirm the reality of the healing till he arrived home. But he chose the truth over the fact and went home believing. His son was truly healed when he arrived home. The healing had taken place at the exact time the Lord Jesus had told him his son was healed. Holding on to the truth had brought his son's healing to fulfilment.\n\nThe facts of a case do not always measure up when held up to the scale of God's standard. Natural eyes see facts; spiritual eyes recognise the truth. Jesus Christ is the truth and only in Him can we experience truth in all circumstances. The facts may seem to prevail, but they cannot last if they remain contrary to the truth of Christ.",
        "action_plan": "Find out from the word of God what truth is written about your life situations. Act on it prayerfully.",
        "thoughts": "Whose report will you believe? The facts as presented by men or the truth as found in Christ?",
        "prayer": "Whatever the fact of my situation may be saying, I choose to hold on to the truth in Christ Jesus. In Him I have life, sound health, wisdom, understanding and everything I need for life and godliness."
    },
    {
        "date": "March 20",
        "title": "THE INFLUENCE OF JESUS",
        "reference": "John 3:1-14",
        "scripture": "The same came to Jesus by night, and said unto him, Rabbi, we know that thou art a teacher come from God:  John 3:2",
        "text": " Late in the ministry of Jesus, when hostility towards Him was most bitter, many of the rulers still believed in him. These words in our memory verse: we know show how much the leaders of the Jewish synagogues admitted the realm of influence Christ had on the people. During His ministry, \n\nJesus was not simply a person of once-off influence. He was a chronic influence on people of all ages colour, gender and race. He came to do the work committed to him by His father. In the process, his disciples became influenced by his lifestyle. As the greatest influence the world had ever known, Jesus went about impacting the life of others; there were no boundaries. \n\nJesus influenced fishermen, tax collectors, politicians, beggars, rich and poor alike. He influenced the prayer life of His disciples. He influenced their desire for mountain-moving faith. Christ's attitude of influence was contagious. His lifestyle commanded attention and people wanted to emulate the beauty in His life. In this quietly contagious manner, He has transferred the fragrance of His grace from generation to generation. Here's the public notice: if you ever come across the Lord Jesus anywhere, your life will never remain the same. The life that emanates from Him will resuscitate your dead ministry and career. The light from Him will illuminate your path and completely eliminate darkness. One touch from Him will leave you asking for more.",
        "action_plan": "Do a quick check: what areas of my life has Jesus influenced?",
        "thoughts": "The influence of Jesus in a place leaves people wondering, what has happened here?",
        "prayer": "Lord Jesus, let your influence be so thick on me that I may influence other people to live for You also. Amen."
    },
    {
        "date": "March 21",
        "title": "ABIDE TO BE TRANSFORMED",
        "reference": "Acts 4:7-20",
        "scripture": "Now when they saw the boldness of Peter and John, and perceived that they were uneducated and untrained men, they marvelled. And they realised that they had been with Jesus. Acts 4:13",
        "text": " It is not difficult to identify a person who has spent time with Jesus. There is a passion for right living and right relationships. There is a longing to please God in all things. There is a desire to influence people and transform them from darkness to light. There is a willingness to put right the corruption in the world system. \n\nMen are convicted of sin and righteousness when they come in contact with them. For people of like minds, your heart is drawn towards them in brotherly affection and fellowship. All of this is evident in the story of the healing at the beautiful gate. Peter and John had been on their way to a prayer meeting when a lame man drew their attention. Rather than give alms though, a passion to correct the wrong rose in the hearts of the apostles and the man was healed through their declaration. \n\nIn order to transform men from darkness to light they preached to the crowd that gathered. The religious leaders tried to curb them but noted that these were men who had been with Jesus. Their mouths could not be shut by threats. Having a regular personal fellowship with Jesus reflects on our mood and countenance as we go through the day. The power extracted from His glorious presence strengthens our resolve to live for Him in every situation of life. We no longer live in the shadows of others or relate with Him in the third person: Jesus is real to us and we to Him.",
        "action_plan": "determine to have a meaningful time of fellowship and conversation with the Lord today.",
        "thoughts": "The more we stay with Jesus, the more we look like Him.",
        "prayer": "Lord Jesus, transform me from inside out as I tarry with You. Let the world see that I have truly been with You. Amen."
    },
    {
        "date": "March 22",
        "title": "BE DELIBERATE IN LOVE",
        "reference": "John 10:14-18",
        "scripture": "\"No one takes it from Me, but I lay it down of Myself. I have power to lay it down, and I have power to take it again. This command I have received from My Father.\" John 10:18",
        "text": " Like Jesus did, we are called to a tall-order kind of love which has to be voluntary. Jesus said, I have the power to lay down my life and the power to take it again. What would you rather do with your life? Take it up and show people how strong you are? Argue your point, win the case but lose the soul? Fight for your right and lose the relationship? Would you rather sacrifice your life-rights, privileges, convenience, position, authority-to save a life? Love is real when it is voluntarily expressed and unconditionally served. Our selfish world has taught us so many things against the rule of the Christian life. \n\nThe selfless life of service to God and humanity is being replaced by self-acclamation and show-off. Today, the Lord Jesus is re-orientating us to follow His footstep: in honour, we must prefer one another. When we pray, we must remember others also. In prioritising needs, we must think of what others lack. In rendering services, we must inquire how it will benefit humanity. \n\nWe may have to endure the inconvenience to make a positive impact on others. So how are you using the power you have: to take your life or to give it? You give life to a hungry soul when you buy him a meal. You give life to a despairing soul when you give him words of encouragement and hope. Express the love of God to someone today cheerfully, willingly and with a purpose-to lay down your life so that another person can live. Action Point: Prioritise the needs of someone else today. Endure a little inconvenience to visit a brother, pay a child's fees, or buy a friend lunch. Thought for the day: A life that is laid down is the pillar for many lives that are reborn. Prayer: Help me Lord by Your Spirit to pay the needed sacrifice for the purpose of raising many lives for You. Amen."
    },
    {
        "date": "March 23",
        "title": "ON THE LORD'S DAY: THE COMMANDING VOICE",
        "reference": "Psalms 29:1-11",
        "scripture": "The voice of the LORD is powerful; the voice of the LORD is full of majesty. Psalms 29:4",
        "text": " The voice of God is louder than thunderclaps. It is great and fearful to the evil-minded. It is calming and soothing to the troubled soul. It is a voice that is majestic and irresistible; a voice that comes with authority and performance. He speaks life itself into being. His voice has been described in many ways in scriptures. Like thunder He booms and the whole earth trembles. \n\nThe deserts quake and strong, mighty trees are broken into pieces like kindling. It goes forth like the sound of many waters. It is so loud that even the animals give birth. When Jesus spoke, the Pharisees were surprised because His words carried the weight of authority. He spoke like someone who knew exactly what He meant and whose words had to perform His orders.\n\nHis voice both convicts and reassures. It can open doors and shut them. It can bring favour to one life while reprimanding another. There is nothing in all of the creation that does not respond to the voice of the One who called everything into being. Nothing seen or unseen has the audacity to turn back from His voice. They must obey. His Word is ahead of you to make a new way in the thick wilderness of your life. Waters are springing forth in the desert because the voice of the Lord asked the dry sand to cough out water. The valleys are getting swelled up because God's voice is changing the order. The roaring winds are shutting up over your life because God has spoken.",
        "action_plan": "Come to His presence today expecting the commanding voice to speak to every troubling situation of your life.",
        "thoughts": "Every problem has an ear for the voice of God's command-they must obey.",
        "prayer": "Father, let the ears of every problem in my life be open to the words of Your command in Jesus name. Amen."
    },
    {
        "date": "March 24",
        "title": "LOOKING UNTO JESUS",
        "reference": "Psalms 34:1-5",
        "scripture": "They looked unto him and were lightened: and their faces were not ashamed. Psalms 34:5",
        "text": " When we look unto Jesus, our whole life becomes radiant, filled with light and illumination. Our faces continue to glow as we look into the face of Jesus, the Light of life. We will never be covered with shame. Looking unto the Lord produces a glowing influence. However, this radiance is only available to as many as receive Him. \n\nWhen a man's life is not filled with the light of God and the illumination (understanding and enlightenment) that comes from knowing the Lord, he is better described as living in a great darkness. Let us not be carried away by the applause godless men receive from the world. Their celebration is short-lived because it lacks the true substance. Without Jesus, there is no soundness in their wisdom. \n\nThe understanding of a man who is not looking up to the risen and exalted Christ is darkened-meaningless, empty, and senseless. They may be celebrated by ignorant people, but it is a fluke. But those who depend on and daily look up to Jesus for light (direction) will be flooded with His illuminating brightness and they will not be put to shame. Like the glory of the Lord was revealed to Israel through the reflecting eyes of Moses, let your heart also reflect the glory of Christ to the people in your neighbourhood and workplace. When you excel in the difficult terrain, stand for the truth where corrupt practices are rampant and speak for Jesus fearlessly, you are reflecting the light of Jesus, pointing the world to your Source. Action Point: There is some darkness when you live or work. Spark up the light by your Godly lifestyle and let men follow. Thought for the day: When we see life through the light of Christ, there is glory and radiance. Prayer: Shine down Your light on me and let men see. Drive away darkness by Your commanding presence in Jesus name. Amen."
    },
    {
        "date": "March 25",
        "title": "SURRENDERED LIFE",
        "reference": "Philippians 3:1-10",
        "scripture": "Yea doubtless, and I count all things but loss for the excellency of the knowledge of Christ Jesus my Lord:  Philippians 3:8",
        "text": " What an excellent resume Paul had in the passage above. He had for his mentor one of the astute teachers of the law in his days. He was a deeply religious man. He was a Roman citizen. He was also of the seed of Abraham by birth. Paul was having the best of the two worlds when suddenly the Lord caught up with him. Although he had many reasons to boast in personal achievement, he chose to ignore them because of the more important divine call. \n\nEverything that was gain to him, he simply swept under the carpet when he turned to the Lord. When it comes to working for God and walking with God, our physical achievements and human resume do not count. It is such an honour to be called of God in spite of our earthly achievements. But God is not reckoning with you because you bagged a PhD or because you are a business tycoon. He calls you into service looking for a broken and surrendered life. He cannot use you if you are full: He needs an empty vessel into which He is going to pour His life. You must learn like Paul to play down your personal identities when it comes to the things of God. To be relevant in God's business, you will have to do away with human strength and knowledge. \n\nIn your CV, Jesus is looking for a surrendered life. Open up your heart and be ready for the holy fire of the Lord. When you let Him in, He will fill you with so much of Himself. The world will marvel at the grace of delivery capacity in you.",
        "action_plan": "List any two (2) human qualities you think you have for doing God's work. Will they mean much in God's service if God does not breathe on them? Willingly surrender them for God's use.",
        "thoughts": "Success in God's work is a function of our yieldedness, availability readiness to obey at all times.",
        "prayer": "Lord Jesus, I surrender all to You. Let no human qualification stand in the way of my being useful for Your glory in Jesus name. Amen."
    },
    {
        "date": "March 26",
        "title": "BE GOD-THIRSTY",
        "reference": "Psalmss 42:1-10",
        "scripture": "My soul thirsts for God, for the living God. When shall I come and appear before God? Psalmss 42:2",
        "text": " There is a realm of miracles that is available for every desiring child of God today. It is the ability to develop faith for the anointing. Let us leave the realm of infancy, bench-warming, indolent, amen-chorusing Christians and step up our game. God is looking for more serious-minded Christians. Use your faith to tap into the anointing. Enough of low dwelling, it is time to fly to your high places in God. \n\nYou can start this by believing God for miracles in your personal life. Don't be scared to ask for a mountain. Caleb asked for a mountain and got it. The Lord wants to prove to you now and always that He is the prayer-answering God. Believe and pray for uncommon levels of anointing and the power of God. Look and listen for revelation and illumination in your inner man. Open your spiritual eyes and ears. \n\nIt is time for a serious spiritual exercise to launch you into your next level. When you see the invisible, you can do the impossible. Vision empowers the miraculous realm in your life. Ask David, he did not see a giant Goliath; he saw a big fool who was food for the birds of the air. Let us start this journey today. The journey of walking into the realm of the spirit. Climbing higher into the mountain of God. No more prayer contractors; pray for yourself. No more laziness in Bible study. Dissect the word like you have an exam on it tomorrow. You can only get closer to God and claim the miracles of a lifetime. Want to try? Action Point: Determine to get to the next level of commitment to God: prayer, word study, giving, fellowship, witnessing. Quote: Desire for more of God is met with an answer. The answer fuels more desire. Prayer: There is a longing in my heart that only You can fill, Lord. Let the desire continue until I get to the hill of God in Jesus name. Amen."
    },
    {
        "date": "March 27",
        "title": "KEYS TO HEAVENLY TREASURES",
        "reference": "Matthew 16:13-19",
        "scripture": "And I will give you the keys of the kingdom of heaven, and whatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven. Matthew 16:19",
        "text": " God commissioned us as the channel for people to encounter Jesus. By our life. love and labour, men can feel the touch of His healing, cleansing, deliverance, transformation and forgiveness. He speaks and acts through us to make Himself known to people who are unfamiliar with the fundamentals of the kingdom principles. This He did by giving us the keys that open the doors of the Kingdom. \n\nSuch access level comes with the trust that we will use this chance to liberate those who have been held in bondage by the devil, delivering them from the shackles of hell. However, the promise is not an indiscriminate toss-out of the key card to heaven's treasures for personal gains. \n\nIt is a commissioning of accountable stewards to be carriers of the mysteries of God. What you open on earth must already be opened in heaven. We are therefore charged with the responsibility to do only as the Lord directs. However, if we don't know what heaven is saying at the present, how shall we know what to open? How shall we correctly allow or disallow a project or programme on earth to the resounding approval of heaven? Therefore, you need to stay in tune in the word and prayer to know God's mind. Follow divine instructions to open doors on earth as they have been done already in heaven. Do not be hasty in decision-making; when in doubt, wait on the Lord. When you know the way and follow the way, you will lead many people in the right path to righteousness.",
        "action_plan": "Find out heaven's recommendation about a situation before you make a declaration.",
        "thoughts": "If a man with the access key opens the warehouse, he is releasing great potentials for many lives to profit withal.",
        "prayer": "Father, by my life and declaration, let the gates of mercy, grace and love be continually opened to lives in bondage of sin and shame in Jesus name. Amen."
    },
    {
        "date": "March 28",
        "title": "A NEW LIFE THROUGH BAPTISM",
        "reference": "Colossians 3:1-8",
        "scripture": "When Christ, who is our life, shall appear, then shall ye also appear with him in glory. Colossians 3:4",
        "text": " The mystery of the Christian faith is delicately wrapped in the truth of the doctrine of baptisms. Baptism which signifies immersion, burial or death is the sure way to a new life. Jesus died so He could live to bring us redemption through His blood. He guaranteed for us a better life by His death. \n\nHe perfected the redemptive work, having paid in full for our release from the bondage of the devil and freedom to live by a new law: the law of the Spirit of life. Life as we know it in Christ, will not be possible if Christ did not agree to die on the cross. Baptism is a change of the engine of an old and dysfunctional automobile to a brand-new and superior one. \n\nFor the new engine to work, the old must be totally removed. For Christ's life to be activated in us, our former and unprofitable life must be completely overhauled. We are nothing but an empty container if we are not fuelled, powered and activated by the brand-new and more superior engine: the Spirit of Christ. Thank God for the death and resurrection of Jesus: it guaranteed a new life for us. Thank God for our death (surrender to Christ): it guarantees the acceptance of the Zoe of God. This mystery of baptism is the reason you are assured of a glorious life in Christ. You have nothing to boast of as your own doing. Stripped of the garments of ungodliness, you are now lifeless to the world. In the new realm of Christ, you are so alive to God and are controlled and regulated by Christ in Whom your live is now hidden and protected.",
        "action_plan": "Compare and contrast-your old lifestyle and your brand-new life in Christ. Any difference?",
        "thoughts": "Any trace of self in us means that we are still keeping the old engine of self whose operation cannot make us better.",
        "prayer": "Father, I come to the foot of the Cross to exchange all of my old life for the better life that is full in Christ. Amen."
    },
    {
        "date": "March 29",
        "title": "DIVINE LEADING AND INSTRUCTION",
        "reference": "Deuteronomy 32:7-14",
        "scripture": "He found him in a desert land, and in the waste howling wilderness; he led him about, he instructed him, he kept him as the apple of his eye. Deuteronomy 32:10",
        "text": " You did not choose your family of birth, parents and their social status, ethnicity, gender, race and your country of birth. All the above chose you. A life can be defined based on whether these factors are favourable or not. Some summed up the helplessness and hopelessness of their background and concluded that they would amount to nothing. Such men resort to wallowing in self-pity and giving excuses for non-performance. \n\nSimilarly, many see the sinful life as a nature they are trapped in; one they have no power over. Jacob was lonely, confused and helpless when the Lord found him. In this pitiful state, the Lord did three things that turned his life around. First, He led him. If only we follow the leading of the Lord and not our own imaginations, we will prosper. We must acknowledge Him in all our doing so He can direct our path (Proverbs 3:5). He leads us beside the still waters so that we can know peace. \n\nSecondly, He instructed Jacob. The Lord began to teach him how to live a fruitful life. Total obedience to the instructions will make us eat the fruit of the land (Isaiah 1:19). Lastly, the Lord protected Him. A man who yields to God's leading and obeys all His instruction is already walking on the path of protection. Your safety tips are located in your total obedience to God. Your life becomes more valuable if you are productive and useful. Diligently follow after the Lord, and He will change your background and story.",
        "action_plan": "Determine to obey the Lord completely; therein lies your security and protection.",
        "thoughts": "The recipe for life transformation is obedience to divine instructions.",
        "prayer": "Thank you, Lord, for choosing me before I ever knew it. Make me the precious apple of Your eye today, guiding and guarding my life jealously from the arrows of evil in Jesus' name. Amen."
    },
    {
        "date": "March 30",
        "title": "ON THE LORD'S DAY: NEXT LEVEL",
        "reference": "Isaiah 54:1-7",
        "scripture": "Enlarge the place of your tent, and let them stretch out the curtains of your dwellings; Do not spare; Lengthen your cords, And strengthen your stakes. Isaiah 54:2",
        "text": " In 2 Kings 6:1-2, the sons of the prophet realised their location was restricting them. They had grown beyond the room available for them. Hence, they cried out for expansion. They assessed the situation and decided to find a solution. In Acts 8:3-4, the disciples did not realise that they had grown beyond sitting around in the corners of Jerusalem until they were dispersed about by persecution so they could expand their horizon to reach the uttermost parts of the earth.\n\nWhen the womb is no longer able to contain the baby, it is time to be born. Perhaps you find yourself in a similar situation. A position that seemed so great and enviable has suddenly become too small because you have grown. Don't just sit around feeling a sense of cheap achievement, the growth should stimulate a hunger for more. More room can only come when you are dissatisfied with your current level. It is time to look around and see what other territory remains unconquered. \n\nThe culture of God's kingdom is expansion; do not sit on old ideas or rely on previous experiences. Do not let your current success limit your growth. Stretch for the next level. Reach out for more of God. Seek better ways of reaching the unreached. Get smarter ways of witnessing to the people. Practice and train more for greater productivity in your secular work. Think ahead and make room for when the enlargement will come. God has promised to enlarge you, stretch capacity to receive His blessings.",
        "action_plan": "Identify two (2) personal preparations you need to do in anticipation for the harvest you are believing God for.",
        "thoughts": "Self-improvement is the world's largest room.",
        "prayer": "By the power of the Holy Spirit, I receive grace to plan ahead for the needed expansion in order to have enough room for the next level of glory in Jesus name. Amen."
    },
    {
        "date": "March 31",
        "title": "GOD TRAINS HIS CHILDREN",
        "reference": "Deuteronomy 32:7-14",
        "scripture": "As an eagle stirs up its nest, Hovers over its young, Spreading out its wings, taking them up, Carrying them on its wings. Deuteronomy 32:11",
        "text": " Sometimes the young eaglets, having received enough training to fly, would decide not to venture into the air from their nest. At such times, the mother breaks up their comfort-zone. She drives the baby eaglets forth into the air, compelling them to use their wings. Should they be inclined to fall because of inexperience, she flutters beneath to catch them. \n\nThis exercise is repeated for as long as it is necessary until the eaglets can fly alone. Similarly, God may have to break up the happy conditions to which we have been accustomed from our birth and drive us forth. Beloved, God is training you for life's battles and not to be a spiritual weakling. By this act of God's training, we can acquire the glorious powers of sustained flight on the wings of the wind. We are trained in life, not by the things we enjoy but the things we endure. Paul exhorted Timothy to endure hardness as a good soldier of Christ. \n\nA man who has endured adversity and overcome is likely to be appreciative of the beauty of God's provision and protection. The training involves all the adversities of life we go through daily. So, when you face strong and overwhelming oppositions, Jesus will show up to guide you through. The winds of life give strength to our growing wings until we are perfected in flight. Keep trusting in the Lord as you weather the various storms that come your way.",
        "action_plan": "Some adversities are desirable. Braze up for whatever the Lord brings to strengthen you today.",
        "thoughts": "Better a wingless eaglet than one who refuses to engage her wings in flight training.",
        "prayer": "Holy Spirit, guide me in the journey of life. Train my wings to be strong in flight. Bear me up in Your everlasting arms lest I fall, in Jesus' name. Amen."
    }


]