[
    {
        "date": "March 01",
        "title": "BREAK FORTH!",
        "reference": "Genesis 38:27–30",
        "scripture": "But when he drew back his hand, his brother came out, and she said, 'So this is how you have broken out!' And he was named Perez. Genesis 38:29",
        "text": "Grace is exemplified in the life of Tamar. Who would have thought that a common girl like her who knew many sorrows would be mentioned in the lineage of Jesus Christ. She had two troubled marriages, two wicked husbands, in-laws who were not favourably disposed towards her, and series of unpleasant experiences. Yet, grace spoke out for her and God favoured her. It must be noted that she was not giving up; she kept pressing forward despite her disadvantaged position. Finally, she was pregnant for Judah and it was a set of twins. For some reason at delivery, one twin brought out his hand and drew it back. Then the other twin took his place and came out first, thereby inheriting the double portion. This breaking out put Perez in line as the ancestor of Jesus Christ. The position that could have been Zerah’s was taken up by Perez because Zerah drew back while Perez pushed forward. Tamar would not give up on her family and her happiness. She pushed until she broke forth. Perez seemed to have taken her spirit: he maximised the opportunity that opened for him by grace. Sometimes situations of life attempt to pull us back. Like Zerah you have held out your hand ready to receive the trophy. But something seems to pull you back at every attempt. Maybe it is a weakness or familial trend. The grace of the Lord is available today to give you the needed push. It is time to break out of obscurity into the limelight.",
        "action_plan": "Action plan: Deal with these character flaws that could impede your breaking forth: laziness, lack of organisation, timidity, fear of failure, lack of courage, low self-confidence, complacency, stage fright, etc.",
        "thought": "Thought for the day: There is grace in the house: touch the grace and push forward.",
        "prayer": "Prayer: Everything that is trying to make my efforts fruitless I nullify by the power of the blood of Jesus today. I receive grace from the Lord to break forth into my inheritance in Jesus name."
    },
    {
        "date": "March 02",
        "title": "WHEN YOU FIND THE WORD",
        "reference": "Psalms 105:16–24",
        "scripture": "Until the time that his word came: the word of the LORD tried him. Psalm 105:19 ",
        "text": "A young boy loved eating bananas. Every time the mother buys some bunches of unripe ones and keeps them in the store, he waits patiently. Yes, he loves bananas but cannot eat unripe ones. He checks regularly to see if they are ripe. No matter his craving for banana, he would not eat the unripe ones. He knows too well they won’t go down well in his tummy. He will wait. Also, He does not want to be too late and settle for overripe and spoilt ones. So, he must be exact. As soon as they are ripe, he gets down to business, peeling them to eat. There is a meeting point between God’s Word and a man’s life. God’s word had gone ahead of Joseph concerning his prosperity but he could not actualise it at the time. It was not yet “ripe for eating”. He had to wait. He waited and life happened to him. He waited until he was fully trained to cope with the challenges of leadership and his heart had been helped concerning forgiveness. But as soon as the time of the Word came, it was activated to fulfil its purpose. Nothing in the whole of the universe could stop its fulfilment. Nothing can stop the timely word except you. The boy was alert to know when the banana is ripe: keep vigilance to know when the promise materialises. The boy was also precise about time. Never wait until the word has passed. Lastly, the boy had to peel the banana to eat. If you do not activate the Word, you might suffer in the midst of plenty. ",
        "action_plan": "Make a habit of writing down God’s promises to you. That way you can objectively follow up and know when the answers come",
        "thought": "Thought for the day: When God’s word is released, it has a clock and alarm attached to it. Be watchful, be vigilant, be ready.",
        "prayer": "Prayer: Lord, as I wait for the set time for Your word over my life to be fulfilled, help me to wait in faith, in confidence and in watching in Jesus name. Amen."
    },
    {
        "date": "March 03",
        "title": "ON THE LORD’S DAY: THE INSTANT WORD",
        "reference": "John 5:1–9",
        "scripture": "And immediately the man was made whole, and took up his bed, and walked: and on the same day was the sabbath. John 5:9 ",
        "text": "There are levels to the activation of God’s Word. The word of promise waits for an appointed time or the set time to come to pass. It has a clock and alarm attached to it. It operates according to the time of life for its accomplishment. But there is still another Word from God called the word of Command. This word defies the law of time, space or distance. It is an instant Word that generates speed and firepower. Like a moving electric train, it consumes every opposition on its way to fulfilment. Such words of power are unconditional. Such were the words of command of Jesus in the days of His flesh. You will hear things like, “straightaway” “immediately” “suddenly”. No timeline, they happen before your mind can fathom it. And that is the word of command He spoke to this helpless man. This man had been waiting for the word of promise, the troubling of water for 38 years to no avail! The Word Himself showed up. The infirmed man’s lack of faith, lack of helper, slowness to act, all became irrelevant protocol when the Commander of God’s word got to the scene. And it was on the Sabbath day. You shall hear the express words of Jesus on this day of the Lord and your longstanding cases shall be settled. Prepare your heart; the water is going to be troubled by God’s word and everything that has held your progress will be removed. Jesus is freeing you from the agelong infirmity and delays today",
        "action_plan": "Make a habit of writing down God’s promises to you. That way you can objectively follow up and know when the answers come",
        "thought": "Thought for the day: There is grace in the house: touch the grace and push forward.",
        "prayer": "Prayer: Everything that is trying to make my efforts fruitless I nullify by the power of the blood of Jesus today. I receive grace from the Lord to break forth into my inheritance in Jesus name."
    },
    {
        "date": "March 4",
        "title": "HIS WORD, YOUR LIGHT",
        "reference": "Psalms 119:129–133",
        "scripture": "The entrance of thy words giveth light, it giveth understanding unto the simple. Psalms 119:130",
        "text": "Light brings clarity and makes it easy to navigate through a dark path. In many modern communities, streetlights are installed to enable people to navigate through the night. In the absence of light, darkness thrives and it is difficult to do almost anything. As alluded to by the Psalmist, God’s Word gives illumination to our heart. What you did not know or understand about life and ministry before now becomes clearer to you. You can take an informed decision based on the light that is revealed through the word. You are no longer confused or uninformed. God’s word helps us to become wise. Any man or woman who comes in contact the word of God, believes it and applies it to his or her life, will be made wise, educated in the things of the spirit and enlightened. Such a life also becomes a source of light (inspiration) to many others. The word of God has the appropriate answer for all our questions. Anyone who is confused about the decision to take in life has chosen not to turn on the light of the word on his condition. Hence, he is living in ignorance of the word of God. Are you at a crossroad? Do you want to see ahead so you are able to navigate the world full of darkness? Take the word of God as your torch and use your faith as the power to light it up. God’s word is already available, take it up and start walking towards your destiny. You don’t have to walk in darkness, trip and fall; trust His word to direct your path.",
        "action_plan": "Action plan: Find the right scripture for every trouble that wants to confuse your soul.",
        "thought": "Thought for the day: When your path is lit up by God’s word, probability of error becomes very negligible.",
        "prayer": "Prayer: Lord let Your word light my path that I may see everything ahead of me clearly, in Jesus name. Amen."
    },
    {
        "date": "March 5",
        "title": "THE WORD OF LIFTING",
        "reference": "Psalms 113:4-9",
        "scripture": "He raises up the poor out of the dust, and lifts the needy out of the dunghill. He raises the poor from the dust and lifts the needy from the ash heap.",
        "text": "We are products of words. We are moulded and shaped by words. Our disposition to people are influenced by words. If someone speaks rudely to you, you might in response, treat him badly. If someone says something nice to you, he might get a favourable and good reaction from you. When God created man, He spoke a word of lifting into his life. He pumped him up with blessings that would make him exactly what He desired man to be. God did not just create man with His hands; He formed and reinforced him with His lifting words of blessing. Some children have lost self-esteem because they are a product of negative utterances from their parents. It is not just enough that you have a child, you must constantly lift him or her with words of blessing. There are parents who are too critical of their children. They demand so much but never praise the children for the efforts they put into work. I know a man who opines that if you appreciate a child, he will misbehave. Such children who were moulded by negative words grew up feeling very strange towards and suspicious of every compliment. We operate under that which was spoken over our lives. The Word that lifted Hannah came from Eli. When a word of lifting comes, sadness gives way for joy, your countenance changes. God has a word of lifting for you. It is your duty to allow that word to mix with faith in you for your transformation and exaltation.",
        "action_plan": "Be intentional about speaking constructive words. Find something good to say about your neighbour, classmate or coworker. Appreciate something about them—the look, smile, patience, calmness.",
        "thought": "A man becomes suddenly attractive to favour and honour when his word of lifting has come.",
        "prayer": "Lord speak a word that will change my story, let my lifting come speedily in Jesus name. Amen."
    },
    {
        "date": "March 6",
        "title": "THE WORKING WORD",
        "reference": "Isaiah 55:8–13",
        "scripture": "Isaiah 55:8: For as the rain comes down, and the snow from heaven, And do not return there, But water the earth, And make it bring forth and bud, That it may give seed to the sower And bread to the eater: Isaiah 55:10 Back in the day, shepherd boys would not return home when one of the animals was lost. Their utmost aim would be to find it. They would climb mountains, walk through valleys, face the wrath of the wild beasts in the cold, wet and dark night in search of a missing lamb. They did not have the courage to face and tell their father or master that they have lost a precious sheep. God’s word is likened to these dedicated shepherd boys. It does not return to God, the Sender until it has accomplished the purpose for which it was sent. It is a faithful servant, a working word.",
        "text": "Every believer has a word that is hanging around them, and until that word has accomplished its purpose in your life, it won’t go back. God uses His word as His servant. He sends it into a believer’s life, the quicker the believer takes it and runs with it, the faster the testimony will be accomplished. As a child of God, you must believe His word and see your life blooming. We need to stand our ground and say enough is enough. Paul told his son Timothy to wage war according to the prophecies that were spoken over his life (1Timothy 1:18). Do not fold your arms and keep silent while the enemy ravages your life. Let God’s word work in your life. If your car has a problem and you do not allow the mechanic to work on it, then it won’t be fixed. It is only when we give God permission into our lives that He works and changes things. Give Him room to operate and see your life blossom.",
        "action_plan": "Do you remember any prophecy over your life that is still hanging? It is time to wage war in prayer for its fulfilment.",
        "thought": "God’s word is an obedient servant: it ensures the package is delivered safely.",
        "prayer": "Father, let Your spoken word over my life do its due diligence. May all the words spoken over my life and family never return void in Jesus name. Amen."
    },
    {
        "date": "March 7",
        "title": "THE BREAD OF LIFE",
        "reference": "Matthew 4:1–4",
        "scripture": "But he answered and said, it is written, Man shall not live by bread alone, but by every word that proceeds out of the mouth of God”. Matthew 4:4",
        "text": "Malnutrition is a great killer. Many nations are stricken by poverty, and people die from all types of diseases that result from poverty and malnutrition. In 2020, it was estimated globally that about 200 million under-5 children were undernourished. Around 45% of deaths among children are linked to undernutrition. All this because they do not have the correct food to eat. As bread nourishes the body, so does the word of God nourish the soul and spirit. Jesus spoke those words when the tempter came to distract Him after His fasting. If you go through a day without feeding on the word of God, you are exposing your spirit to weakness and attack from the relentless devil. He prowls around, looking for your vulnerable moment. When you are full of God’s word, you are immune to the wiles of the devil. You find yourself quoting God’s word to ward off the devil’s attack over your spirit. You are not deterred by prevailing circumstances around you. The word ministers life to you. But when you have lost your study life, every negative news around you sounds so true that it weighs you down. God’s promise sounds distant and unrealistic to a malnourished soul. Conversely, the mere words of speculations of men become so real to a spiritually-starved life. Unfortunately, no one can eat for you. To be free from hunger you must learn to put the food into your own mouth. Want to be free from spiritually stunted growth? Feed constantly on the word.",
        "action_plan": "Develop a daily study pattern. Have a very practical approach to your word study.",
        "thought": "You are what you eat. Eat the word and become what the word says.",
        "prayer": "Father, let my desire be to feast at Your table daily as You set the table of Your Word before me even in the presence of oppositions in Jesus name. Amen."
    },
    {
        "date": "March 8",
        "title": "TRUST IN HIS WORD",
        "reference": "Jeremiah 17:7-8",
        "scripture": "Blessed is the man who trusts in the LORD, And whose hope is the LORD. Jeremiah 17:7",
        "text": "Trust is the firm belief in the reliability, truth, or ability of someone or something. It basically means putting your hope in someone with a belief that they are able and capable of assisting you. This is further strengthened by the fact that such a person has been seen or known to do this before. Unlike faith, trust is earned by previous knowledge or experience. The person has somewhat proven themselves. Trust can therefore be lost if the person fails. To trust God means that you believe in him, you know that he can help because He has done it before. No one leaves the care of precious things to a careless and unreliable person. You must have seen a degree of responsibility in the person to whom you will commit delicate and precious items. Trusting God is not just mere words that we say to massage our feelings. It is hope because we have seen him help us. As a believer you must have a testimony and always remind yourself of what the Lord has done for you, this helps you to be able to trust Him more. While “some trust in chariots and horses” (Psalms 20:7), where is your own trust? The word of God unlike people and circumstances, does not change. It remains the same and is relevant even today. It has always been proved true. It has been tried and tested for many years. And that is where our trust lies. Have you been cheated by people before and you find it hard to trust anyone? You can trust God and His word, for He will never fail.",
        "action_plan": "Action plan: What has God done for you before that can heighten your trust in Him? Ruminate on these and be thankful.",
        "thought": "Thought for the day: Don’t allow the unfaithfulness of men to rob you of the capacity to trust God and His word.",
        "prayer": "Lord help me to trust you, to hope in you in at all times in Jesus name. Amen."
    },
    {
        "date": "March 9",
        "title": "RICH IN THE WORD",
        "reference": "Colossians 3:12-17",
        "scripture": "Let the word of Christ dwell in you richly in all wisdom; teaching and admonishing one another in psalms and hymns and spiritual songs, singing with grace in your hearts to the Lord. - Colossians 3:16",
        "text": "Your knowledge of the word of God is one thing that will improve your mind and help you to produce fruits in all your endeavours. The word of God gives you wisdom and understanding. When you acquire more knowledge of the word of God it profits your life. It guarantees the prosperity of the soul. It makes a man to be full of the grace of God. Shallow knowledge about God’s word will make a spiritual novice. Sound and in-depth knowledge of the word of God brings positive change to a believer’s attitude, values and lifestyle. The word that works for you is how much of the letters in the Bible has been converted into your spirit. Our spirit does not eat the letters (surface) of the word. It feeds on the spirit behind the letters. Letter kills; the spirit quickens (2 Corinthians 3:6). Until you discover what is written concerning you in the word of God, carrying a big Bible does not mean carrying vast knowledge. So many people have been saved from embarrassment and shame because they applied the word that they knew to the circumstances of their life. Finally, the word of God you acquire is not only for your profiting. Share with your friends and family. Learn how to make strong strides by keeping company with those who have deep knowledge of God. Attend Bible study and Sunday school meetings, and study the Word with other believers. Keep learning, keeping meditating to improve your life.",
        "action_plan": "Action plan: Cultivate a habit of committing a key verse to memory each day.",
        "thought": "Thought for the day: Eagles feed on fresh meat; vultures feed on dead things. Be an eagle.",
        "prayer": "Prayer: Break open Your words, let the light shine out, let ordinary people see the meaning. I want your Word more than anything."
    },
    {
        "date": "March 10",
        "title": "ON THE LORD'S DAY: MEET THE LORD OF THE SABBATH",
        "reference": "Luke 6:1-5",
        "scripture": "And he said unto them, That the Son of man is Lord also of the sabbath. Luke 6:5",
        "text": "In Matthew 11:7-9, Jesus was interrogating the people about the reason for their visit to the wilderness where John baptised. \"What went ye out into the wilderness to see?\" There was a purpose for them trooping into the wilderness. It was not the wilderness itself that mattered but the man who made the wilderness worthwhile. The prophet, John the Baptist lit up the place and they were willing to rejoice in his light for a season. But now, greater than a prophet is here: the Lord of the Sabbath Himself has come to tabernacle with us. Obviously, the Pharisees observed the Sabbath without regard for the Lord of the Sabbath. And before we accuse them further, aren't we doing the same? Many believers have lost the primary purpose of the church and now chase shadows. Some will not show up in church if they know that their senior pastor would not be around. For them, church attendance is being seen by their pastor as a good congregant. Some members are in church for social gathering and business. Others to display their talent. Little wonder the real blessing of God's presence eludes them. What is Sabbath without the Lord of it? What is the benefit of Sunday worship without the Lord of the Day? He has promised to give rest to all who come unto Him regardless of how much burden you bring with you. As you come into His presence, think about the rest He has promised you. Worship Him with reverent fear.",
        "action_plan": "Action plan: In what ways are you expectant from the Lord of the Sabbath today? List areas where you actually need rest.",
        "thought": "Thought for the day: If you observe Sabbath a thousand times without the Lord of the Sabbath, there cannot be true rest.",
        "prayer": "Prayer: Today as I come before Your throne, help me to meet with You. Remove all my loads of pain, guilt, shame, worries and fear from me and give me true rest in Jesus name. Amen."
    },
    {
        "date": "March 11",
        "title": "STRENGTHENED TO HELP OTHERS",
        "reference": "Galatians 6:1-5",
        "scripture": "Brethren, if a man be overtaken in a fault, ye which are spiritual, restore such an one in the spirit of meekness … Galatians 6:1.",
        "text": " A video clip recently circulated about how technology and social media have made people lose their sense of humanity. A man was seen drowning in the river, shouting for help. There were many passers-by at the site, many of whom may have known how to swim. But there was no one seen diving into the river to rescue the drowning man. Instead, the spectators were busy taking pictures of the drowning man and pasting it on their various group chats and social media platforms. Some even moved closer only to get an unobstructed view. \n Apostle Paul exhorted the Galatian saints to be their brother’s keeper. God gives us strength so we can be of help to others who are weak. In the scriptures above, we are counselled to bear one another’s burden. People do fall into temptation; fail in trials and tests, or are led astray by a negative influence. As a stronger believer, the right thing to do when you observe this weakness in our Christian society is not to weaken the hands of the affected brethren but to stand by them and restore them back to the fold of Christ. \n While we recognize that it is the grace of God that has sustained us so far, God is making that grace available for another brother or sister through your help today. We are saved to save. Always think of how you can rescue a perishing soul, and not how you can please yourself. ",
        "action_plan": " Action plan: Determine to help a brother or sister in trouble today. Determine not to gossip or receive gossip about a troubled believer or Christian leader. \n Quote: Lift up the hands that hang down and strengthen the feeble knees.",
        "thought": "",
        "prayer": "Prayer: Lord, I acknowledge Your grace upon my life. Help me to use all you’ve given me to lead others out to darkness into Your marvellous light in Jesus name. Amen"
    },
    {
        "date": "March 12",
        "title": "STRATEGY: A REMEDY FOR LAZINESS",
        "reference": "Proverbs 6:6–11",
        "scripture": "Go to the ant, thou sluggard; consider her ways, and be wise: which having no guide, overseer, or ruler, provides her meat in the summer, and gathers her food in the harvest. Proverbs 6:6–8 ",
        "text": "Ants are known to be very industrious and diligent without external supervision. Humans were created with a critical mind and strong determination. God has promised abundance to His followers, but it takes our own efforts to develop a plan on how to sustain the provision. Many times, we as Christians use being spiritual as an excuse for not being wealthy but actually it’s our lethargy. Through dedicated effort, skills can be developed to maintain generational wealth. Strategy allows you to integrate your unity with God and personal effort to achieve the goal you set to reach. We need to always bear in mind that everything that the Lord places in our hands is a blessing. Gaining the blessing however will depend on our ability to deploy our capacity. God has given us the capacity as believers to take initiative, then He blesses the work of our hands. If you are always relaxed with no strategy as a believer, when unexpected difficulties and challenges arise, you might not be prepared. Attaining a fruitful and fulfilling life requires your ability to develop a strategy to tackle laziness. As we wait for more of the manifested blessings from the Lord, use the waiting time to itemise strategies, seek opportunities so when the wealth increases, it is saved in wisdom. This is the summertime, get to work and sow your seeds of hard work and diligence. When winter arrives, you will have stored up a lot to eat and will not beg for bread.",
        "action_plan": "Action plan: Try a planned schedule for everything you do today, including your relaxation",
        "thought": "Thought for the day: The heart of man plans his way, but the Lord establishes his steps.",
        "prayer": "Prayer: Dear Lord, guide me in setting meaningful goals and priorities that align with Your will and purpose for my life, in Jesus name. Amen"
    },
    {
        "date": "March 13",
        "title": "THE LORD KNOWS WHAT TO DO",
        "reference": "John 6:1-14",
        "scripture": "But this He said to test him, for He Himself knew what He would do. - John 6:6",
        "text": "The disciples' experience in the passage above clearly highlights the futility of worry. Their fear of failure to meet the needs of the people made them suggest that Jesus send the people away. Jesus knew what He would do; He was too compassionate about the people to send them away hungry. Before the people gathered, He had made provision available through a boy who brought his lunch along and was willing to let it go. Asking the disciples how the crowd would be fed was only a test of their faith and trust. Praying about everything is better than worrying about anything. Worry never resolves issues; it is more likely to make them worse. The thing about the life of anxiety is that it never ends. When one problem is solved, you become anxious and worried about the next thing. It may be tempting to ask, 'why pray about a situation when God can see what I am going through?' Yes, He sees it, but He wants you to recognize that you are limited in your ability to handle things and consciously turn them over to Him. The Lord knows your circumstances. He sees where the shoe pinches. He understands all the effort you have put in. He has a plan for you that will bring glory to His name alone. If He could say Lazarus's sickness would not end in death, He knows what to do about your situation. Stop worrying and hand it over to Him. He will give you the word of prophecy you need.",
        "action_plan": "Identify three issues that you have worried about in the past week. Consciously pray about them today.",
        "thought": "Worry never solves problems, it compounds them.",
        "prayer": "Like prophet Ezekiel, I say 'only You know Lord'. Give me the word that will stir up the winds and bring my dry bones to live again."
    },
    {
        "date": "March 14",
        "title": "JESUS MAKES US FRUITFUL",
        "reference": "John 15:1–8",
        "scripture": "\"I am the vine; you are the branches. He who abides in Me, and I in him, bears much fruit; for without Me you can do nothing.\" John 15:5",
        "text": "It would have been different if Jesus had said, “Without me you may not be able to do some things”. Perhaps we would have chosen to do those things that we can accomplish without His help. However, Jesus made it clear that as true branches of the vine, we can do absolutely nothing without Him. We will fail woefully at any attempted attempt to engage in a meaningful enterprise without the authority and backing of the Lord. The reason for this is clear: the Lord Jesus is the one who bears us up and nourishes our very existence.\n\nWhen there are fruits on the branches of a tree, we reckon that the branches are fruitful. However, we know that the source of nutrient for the branches is the vine (the stem). If you cut the branch off the tree, in a little while all its fruits will dry up. In the same way, let Jesus remain your source of strength for performance. He is the never-drying source. Every other source will come to nothing. Men die, friends disappoint, tenures end, kingdoms are overthrown but the Strength of Zion will never fail.\n\nNever regard anything as too easy to accomplish. Let the Lord Jesus be your source of strength. Tell him about every one of your endeavours. What you will achieve by His grace will be far more than what you would accomplish by your little strength. Why settle for good when Jesus can give you the best?\n\n\n\n\n\n",
        "action_plan": "Action plan: Identify habits that can make you lose your connection for supply as a branch of the Vine.",
        "thought": "Thought for the day: Once Jesus, the Vine is removed from a believer’s life, he becomes lifeless.",
        "prayer": "Prayer: I recognize that without You Lord I can accomplish nothing. I choose to remain in You so Your grace can make me fruitful in all areas of life, in Jesus name. Amen."
    },
    {
        "date": "March 15",
        "title": "THE AUTHORITY OF HIS WORD",
        "reference": "John 7:37-46",
        "scripture": "Then the officers came to the chief priests and Pharisees, who said to them, \"Why have you not brought Him?\" The officers answered, \"No man ever spoke like this Man!\" John 7:45-46",
        "text": "When you meet a person who is confident in their craft, be it as an artisan or as a trained professional, there is poise in the way they handle every client. They don’t make much noise; they state what is required to complete the task, set out to do what they have said and deliver perfectly to the minutest detail. Like empty barrels, people who are not as skilled often make a lot of noise in their attempt to prove a point. Their delivery speaks to their incompetence. Such were the scribes and Pharisees. Their words lacked authority (Matthew 7:29).\nWanting to discredit Jesus and disrupt His ministry, the religious leaders sent officers to arrest Him. The authority with which He spoke and the great power of His message brought the officers under conviction. They had left with handcuffs, but returned with bowed heads and hearts on fire. They testified to the power of His message and were unable to touch Him. They did not mind the consequence of not fulfilling the mandate of their commanders. The ultimate Commander was in town, who would dare disobey!\nThe authority of Christ is available to every child of God today. Dwell in the word, fellowship with the Father, listen to the Holy Spirit and the same authority that Jesus had can be yours. He has commissioned each of His children to go in the same power (Matthew 28:18-20). You can build up your confidence through the power of the Word.\nAction plan: Set aside personal time of fellowship with God when you will study the word and listen to Him speak to you.\nThought for the day: Confidence in the Lord and familiarity with His authority is gained through fellowship.\nPrayer: I do not want to be an empty barrel making pointless noise. As I study Your word and pray, keep me grounded in You that I may be bold in the face of every situation, in Jesus name. Amen.",
        "action_plan": "Set aside personal time of fellowship with God when you will study the word and listen to Him speak to you.",
        "thought": "Confidence in the Lord and familiarity with His authority is gained through fellowship.",
        "prayer": "I do not want to be an empty barrel making pointless noise. As I study Your word and pray, keep me grounded in You that I may be bold in the face of every situation, in Jesus name. Amen."
    },
    {
        "date": "March 16",
        "title": "GOD'S RESTORING LOVE",
        "reference": "Hosea 14:1-9",
        "scripture": "I will heal their backsliding; I will love them freely: for mine anger is turned away from him. Hosea 14:4",
        "text": "It is not a pleasant thing to see a believer backslide. Sadly, many times we may have temporarily slid back into lifestyles that we once left behind. This is due to our carelessness and inability to keep our focus on Jesus. If we will be humble, repent and forsake our sins, Jesus is still here to restore us back to our original relationship with Him. No matter how bad the scar, He has the cure for our backsliding and He is willing to restore. Those who will not recover are the ones who have allowed pride to prevent them from repenting.\n\nJesus desires to restore us back to Him in His glory. He knew in spite of the grievous fall of Peter when he denied Him three times, that there was a strong passion of devoted love for Christ in his heart. And therefore, Jesus did not hesitate to entrust to him the care of His sheep and lambs. In the same way, the Lord Jesus will take the broken pieces of any life that will come to Him, and with His skilful and tender touch will remake it into something useful and beautiful in His service.\n\nDo not allow the devil to rob you of this golden privilege to come back to your first love. Do not wait until the wound of sin has festered before you cry out to the Lord for restoration. And if your wound seems so big, it is still amenable to healing by the hand of Jesus. Come back home today: His outstretched arm is waiting.\n\nAction plan: You cannot hide from your Maker. Prayerfully come before Him to expose your spiritual state that needs healing.\n\nThought for the day: When Jesus picks up the broken pieces of your life, He makes them into a piece of fine art.\n\nPrayer: Lord Jesus, I turn to You from my backslidings. I no longer hide under self-righteousness, pretence of religion or pity from a shameful fall. For only You can restore me from secret faults. When you meet a person who is confident in their craft, be it as an artisan or as a trained professional, there is poise in the way they handle every client. They don’t make much noise; they state what is required to complete the task, set out to do what they have said and deliver perfectly to the minutest detail. Like empty barrels, people who are not as skilled often make a lot of noise in their attempt to prove a point. Their delivery speaks to their incompetence. Such were the scribes and Pharisees. Their words lacked authority (Matthew 7:29).\nWanting to discredit Jesus and disrupt His ministry, the religious leaders sent officers to arrest Him. The authority with which He spoke and the great power of His message brought the officers under conviction. They had left with handcuffs, but returned with bowed heads and hearts on fire. They testified to the power of His message and were unable to touch Him. They did not mind the consequence of not fulfilling the mandate of their commanders. The ultimate Commander was in town, who would dare disobey!\nThe authority of Christ is available to every child of God today. Dwell in the word, fellowship with the Father, listen to the Holy Spirit and the same authority that Jesus had can be yours. He has commissioned each of His children to go in the same power (Matthew 28:18-20). You can build up your confidence through the power of the Word.\n\n",
        "action_plan": "Action plan: Set aside personal time of fellowship with God when you will study the word and listen to Him speak to you.\n",
        "thought": "Thought for the day: Confidence in the Lord and familiarity with His authority is gained through fellowship.",
        "prayer": "Prayer: I do not want to be an empty barrel making pointless noise. As I study Your word and pray, keep me grounded in You that I may be bold in the face of every situation, in Jesus name. Amen."
    },
    {
        "date": "March 17",
        "title": "ON THE LORD'S DAY: PREPARE YOUR GIFT",
        "reference": "1 Corinthians 16:1-10",
        "scripture": "2: Upon the first day of the week let every one of you lay by him in store, as God hath prospered him, that there be no gatherings when I come.",
        "text": "The Message Translation puts our key verse thus: \"Every Sunday each of you make an offering and put it in safekeeping. Be as generous as you can. When I get there, you'll have it ready, and I won't have to make a special appeal. Do not wait until you hear the call to bring out your offering in church: start to prepare your offering for the house of God now. See it as a rare honour from God. Give cheerfully. Give unto God and the cause of the gospel as an act of faith in God’s provision, love to God, obedience to His instructions and as an act of worship. Give so that there will be funds for the church work. In Malachi 3:10, God commands us to bring all the tithes and offering so that there will be food in His house. This includes the work of God’s house, taking care of the church premises, caring for the brethren’s welfare, paying the wages of church employees, mission and evangelical outreaches; they all require money. privilege. \nIt is worthy of note that giving to God is a privilege; do not take it for granted. If you refuse to give, the work will still get done but there will be no reward for you as an excuse giver. How prepared are you to appear before the Lord? As you prepare your heart, also prepare a worthy offering. Be sure not to have a grudge against anyone otherwise your offering will not be accepted. When it is time to give, make sure you do it with dancing and singing and melody from your heart.",
        "action_plan": "Action plan: Prepare your offering. Give your best to God. Make sure they are not tattered notes.",
        "thought": "Thought for the day: Give generously so that there will be food in the house of God.",
        "prayer": "Prayer: Thank You Lord for counting me worthy to give to Your cause. Help my heart to always give as an act of faith, love, obedience and worship in Jesus name. Amen."
    },
    {
        "date": "March 18",
        "title": "RADIANCE THROUGH CHRIST",
        "reference": "Psalms 34:1-5",
        "scripture": "They looked unto him and were lightened: and their faces were not ashamed. Psalms 34:5",
        "text": "Life just begins to have a meaning when we know Christ. When we look unto Jesus, our whole life becomes radiant, filled with light. Our faces continue to glow as we look into the face of Jesus, the Light of life. We will never be covered with shame. Looking unto Him produces a glowing influence. This radiance is available for as many as receive Him. A person who is not living in Christ is living in great darkness. Jesus gives shape and form to our life and purpose through the influence of His light. Don’t be carried away by the applause the wicked receives from the world. Because he lacks Jesus, there is no soundness in his wisdom. The understanding of a man who is not looking up to the risen and exalted Christ is darkened—meaningless, empty and senseless. The knowledge of Christ gives us confidence and boldness. The world can see on our faces that we know the way. As we daily walk, not in our wisdom, but in the footsteps of Christ, our faces become radiant and our paths become clearer in God. Just like God reflected His glory to the children of Israel through the eyes of Moses, He is in these latter days reflecting His glory to the world by our hearts and lives. The people around you need the radiance to see their way. Be a reflector of Christ’s light to their hearts and their paths.",
        "action_plan": "In what ways can you reflect Christ in your neighbourhood? Make deliberate plans to do at least one of them.",
        "thought": "When we see life through the light of Christ, there is glory and radiance.",
        "prayer": "Lord, shine down Your light on me and let men see. Drive away darkness by Your commanding presence in Jesus name. Amen."
    },
    {
        "date": "March 19",
        "title": "EYES ON JESUS",
        "reference": "Matthew 14:22–32",
        "scripture": "But when he saw the wind boisterous, he was afraid; and beginning to sink, he cried, saying, Lord, save me. Matthew 14:30",
        "text": "\"Don’t look down. When new skiers look down, they panic, become frightened by the slope and overwhelmed by the distance\". \nEyes must always be on the goal rather than the challenges in order to hit the target. When Peter was told by Jesus to come on the water, his eyes were focused on the Master. Putting one foot in front of the other, his awareness was filled with the presence of the Savior. That’s the way to walk on water: walk on the miracles of life. Peter was able to do what no other person had ever done because Jesus dominated his mind. His success in the miraculous lasted only a short while though. No sooner had he started doing well on water than he got distracted by the boisterous winds. He took his eyes off the Lord and looked at the overwhelming waters around him. The point came when the focus of his attention shifted from His Lord and Master to the wind. \"He saw the wind\" and became frightened. His ability to continue walking in Jesus’ power was disrupted and he began to sink. Life is full of distractions to our faith and trust in the Lord. We will do ourselves a favour not to be bothered but to remain focused. Don’t look down, don’t look at the circumstances. Keep your focus on Jesus, not on the size of the mountain ahead of you.",
        "question": "Jesus is asking you today like He asked Peter, \"Why do you doubt?\"",
        "action_plan": "Identify one or two storms in your life that have distracted you from a life of full focus on Jesus.",
        "thought": "I have set the LORD always before me: because he is at my right hand, I shall not be moved.",
        "prayer": "Today, I set Jesus before me and therefore my heart is glad, and my glory rejoices and my flesh shall also be hopeful, in Jesus name. Amen."
    },
    {
        "date": "March 20",
        "title": "JESUS AUTHORED THE NEW BOOK",
        "reference": "Hebrews 5:5-10",
        "scripture": "And having been perfected, He became the author of eternal salvation to all who obey Him. Hebrews 5:9",
        "text": "There is a story of an argument between an old general and a new one. The former stated that the current material used for one of their uniforms was not according to the specifications written in the books. The new general maintained that the material was perfect for the purpose. While the argument went back and forth, the old general decided to ask for evidence: \"Sir, do the books currently say so? And if I may ask, how would you be so sure?\" The new officer simply replied with confidence, \"The new books say so. I wrote it\". Case closed. Like the author of a book, Jesus scripted every aspect of our salvation. He remembers all the pages of the contract. He knows every detail of our Christian faith—from the start to finish. He is never in doubt about what He wrote there. Apostle James called it the perfect law of liberty (James 1:25). No one reads it and gets confused about the Christian faith that Jesus authored. Jesus founded our salvation and authored the book that explains all about it. If a man lives by the dictates of this manual, he will know how to answer every situation that stands on his way. \nNow there is a new law. The Law of the Spirit and Life in Christ. By it we are delivered from sin and death. We are no longer using the old textbook of condemnation. That has expired with the old life. We now have the new law that sets of free from sin and death. And should the devil try to remind you of your past from the old books, remind him of his future in the new one.",
        "action_plan": "Action plan: Are you confused about anything? Check what the new book (the Bible) says about it.",
        "thought": "",
        "prayer": ""
    },
    {
        "date": "March 21",
        "title": "GOING HIGHER IN GOD",
        "reference": "Deuteronomy 1:1-8",
        "scripture": "Deuteronomy 1:1-2 The LORD our God spoke to us in Horeb, saying: 'You have dwelt long enough at this mountain. 'Turn and take your journey, and go to the mountains of the Amorites. Deuteronomy 1:6-7 There is a deeper level of walk with God that is available for everyone who is discontented with boring life of spiritual mediocrity and going round in unending cycles. We must leave this level of bench-warming Christianity and step up our game. The Lord needs soldiers, not forever babies. And the world needs Jesus. There is much work to be done. Enough of low-dwelling; it is time to fly to your high places in God. You can start this by believing God for miracles in your personal life. Don’t be scared to ask for a mountain. Caleb asked for a mountain and got it.",
        "text": "Desire for more of God is met with an answer. The answer fuels more desire. The Lord wants to prove to you now and always that He is the prayer-answering God. Believe and pray for uncommon levels of unction and the power of God. Look and listen for revelation and illumination in your inner man. Open your spiritual eyes and ears. It is time for a serious spiritual exercise to launch you into your next level. When you see the invisible, you can do the impossible. Vision empowers the miraculous realm in your life. David did not see a giant Goliath; he saw a big fool who was food for the birds of the air.",
        "action plan": "List two (2) aspects of your spiritual life and two (2) aspects of your secular life that are stale and need to be revived. Prayer life, Bible study, Work-life balance, Relationships. Start this journey today. The journey of walking into the realm of the spirit. Climbing higher into the mountain of God. No more prayer contractors; pray for yourself. No more laziness in Bible study. Dissect the word like you have an exam on it tomorrow. You can only get closer to God and claim the miracles of a lifetime. Want to try?",
        "thought": "",
        "prayer": "There is a longing in my heart that only You can fill, Lord. Let the desire continue until I get to the hill of God. Amen."
    },
    {
        "date": "March 22",
        "title": "FOR THIS PURPOSE",
        "reference": "1 John 3:1-10",
        "scripture": "He that commits sin is of the devil; for the devil sinned from the beginning. For this purpose, the Son of God was manifested, that he might destroy the works of the devil. 1 John 3:8 ",
        "text": "Jesus had a purpose for coming to the world and He fulfilled it. This is the reason we can be bold to call ourselves children of God today. Thank God for Jesus fulfilling purpose. When His virgin birth was foretold by the angel Gabriel, His name was stated and His purpose was quickly announced too: “And she shall bring forth a son, and thou shalt call his name JESUS: for he shall save his people from their sins” (Matthew 1:21). He came with a purpose—to defeat sin in our lives. He came to destroy the power and hold of sin and to uproot it.\n The works of the devil are the works of the flesh. Paul wrote that they are manifested (Galatians 5:19). The devil no longer hides them. Tackling this evil is a multi-level, multi-faceted and multi-disciplinary issue. But Jesus makes it simple by choosing to find the root cause: the seed of sin. Sin has grown its tap roots into the lives of men and springs up all kinds of branches, leaves and fruits. Sin has deprived us of a place with God and the needed rest for our soul. It gives Christ joy to fulfil this purpose: to destroy the root of sin.\n The root is the source of life to the tree. When the root of the problem has been tackled, it is easier to take care of the rest without them springing up again. Whatever negative lifestyle still manifests in you, ask Jesus to deal with it from the foundation. No house can stand the test of time once its foundation has been destroyed.",
        "action_plan": "1) Sit down to look into the foundation of the negative attitudes you manifest (anger, malice, lies, resentment, unforgiveness). 2) In prayer, let Jesus take care of them all from the root cause.",
        "thought": "Issues in life must be tackled from the root, address the cause, not the symptom.",
        "prayer": "May the foundation of every ungodly and unprofitable lifestyle in my life be destroyed today and a new edifice be erected on the righteousness of Christ in Jesus name. Amen."
    },
    {
        "date": "March 23",
        "title": "THE HOT MESSAGE",
        "reference": "John 3:3-7, John 3:3",
        "scripture": "Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God. John 3:3 ",
        "text": "It did not seem as if Jesus was responding to Nicodemus question. In fact, he had no question yet; he had only spoken some commendation about Jesus ministry when Jesus cut in to tell him about the kingdom matters: 'Verily, verily I say unto you, except a man be born again, he cannot see the kingdom of God' (John 3:3). That was the hot message that needed to be delivered to Nicodemus as there was indeed no time to waste on pleasantries. Jesus wants us to focus more on the things of eternal value as we see the days approaching. There are many issues of life that are sapping the energy of believers, leaving us with little or no time to consider the things of eternal value. You hear things like 'I am too tired to pray'. Tired from secular life. 'I am too busy to study the word'. And what do we have to show for that busy life? While we must be about our daily business in life, we must remember that what is of eternal consequence is what we do with our soul, what we do for God, and how we use our God-given talents and opportunities for kingdom value. Since Nicodemus had recognised Jesus as a great teacher, Jesus maximised the opportunity to tell him about eternal life. There are people who form your circle of influence. They respect you and hold you in high esteem. Have you capitalized on that to introduce them to Jesus so He can save their souls eternally? That is the hot message. Action plan: The hot message is simple: introduce eternal life through Jesus to someone in your circle of influence today. Thought for the day: If the world will not hear from us about eternal life through Christ, we are better muted. Prayer: Father, I surrender myself to You anew. I am sorry for giving excuses of being too busy to talk about You. Help me to deliver this hot message with every opportunity I have, in Jesus name. Amen.",
        "action_plan": "The hot message is simple: introduce eternal life through Jesus to someone in your circle of influence today.",
        "thought": "If the world will not hear from us about eternal life through Christ, we are better muted.",
        "prayer": "Father, I surrender myself to You anew. I am sorry for giving excuses of being too busy to talk about You. Help me to deliver this hot message with every opportunity I have, in Jesus name. Amen."
    },
    {
        "date": "March 24",
        "title": "ON THE LORD’S DAY: IT PAYS TO SERVE JESUS",
        "reference": "Matthew 21:1–11",
        "scripture": "And brought the ass, and the colt, and put on them their clothes, and they set him thereon. Matthew 21:7. And a very great multitude spread their garments in the way; others cut down branches from the trees, and strawed them in the way. Matthew 21:8",
        "text": "Sometimes I wonder who enjoys those air-conditioned cars more between the drivers and their bosses. The bosses are driven in those cars for a brief period of time so they can get to their destination. Then the driver remains in the car, enjoying all the benefits of the car. He listens to good music, enjoys the cool ambience and sometimes takes selfies to post on his social media platforms. All the better if it is an escort car and the boss is not inside. At the end of the day he gets paid for driving in comfort. All this because he is working for a rich boss.\nThe triumphant entry of Jesus into Jerusalem was most enjoyed by the donkey and the colt. They were loosed from their bondage because of Jesus. People laid their clothes on the donkey because of Jesus. They had a royal welcome into Jerusalem because of Jesus. Most people in the crowd threw their garments down on the road while others cut branches from the trees and brought them as welcome mats. This is the story of a life to the yielded Lord’s service. It pays to serve Jesus: the life is good; the benefits are great; the pay is handsome.\nWouldn’t you rather enlist in the service of the Lord today? Do not be a bench-warmer in church. Find something you can do for God. Look for areas in the church that need your expertise. Serve the Lord with gladness. Be involved in soul-winning. Follow up and visit the first comers. Do it willingly and cheerfully. The life is good, the benefits great, and the pay from the Lord handsome.",
        "action_plan": "Action plan: If you have not been involved in any service point in church, enrol today. If you have, be more committed. The Lord sees",
        "thought": "Thought for the day: It pays to serve Jesus: the life is good; the benefits are great; the pay is handsome.",
        "prayer": "Prayer: Thank you, Lord Jesus, for loosening me from the bondage of the devil to serve Your purpose. Please ride on my back to Your destination as I am tied to Your will in Jesus name. Amen"
    },
    {
        "date": "March 25",
        "title": "LIFE ETERNAL",
        "reference": "John 10:23-30",
        "scripture":"And I give unto them eternal life; and they shall never perish; neither shall any man pluck them out of my hand. John 10:28",
        "text": "Man desires to secure immortality. Unfortunately, this is a quest that cannot be realised in this body which it is already doomed to die. Even the most advanced medical sciences have not guaranteed immortality. Eternal life is a quality of life received as a gift through knowing Jesus. It begins on earth and continues in heaven. It gives us a foretaste of divine glory on earth. A superior life that influences its environment, eternal life is contagious. It transforms everything around it. It is holy; it sanctifies and purifies everything in contact with it.\nEternal life begins with knowing God through Jesus Christ and living by the Spirit (John 17:3). We are no longer controlled by the dictates of the flesh. We enjoy heaven on earth. When the time comes to drop this piece of garment called “flesh”, we just shed it and exchange it for a glorious body that lives forever. This transition is easy for us because we never lived by its dictates while on earth anyway. That is eternal life: we start with Christ in our terrestrial body, we transit into glory uneventfully, we continue in the glory in our celestial body.\nAs the life of Christ dwells in us in this world, He prepares us for the life to come. We are so blessed with the grace needed to affect the world around us through this gift of life eternal. We cannot afford to keep this blessing of immortality to ourselves: it must spread like a wildfire to our neighbours. People need the Lord.",
        "action_plan":"Action plan: Check if there are still traces of flesh control in you. Strive to be heavy on the spirit and light on the flesh.", 
        "thought": "Thought for the day: With eternal life in you, you are light on flesh but heavy on the spirit.",
        "prayer":"Prayer: Dear Lord Jesus, breathe Your life upon me that I may breathe the same life of Yours upon all around me in Jesus name. Amen."},
    {
        "date": "March 26",
        "title": "CONFESS CHRIST",
        "reference": 
            "Romans 10: 1–14, Romans 10:9, Matthew 10:32"
        ,
        "text": "Confessing our Lord Jesus Christ is a key condition of God’s salvation for mankind. Confession here means open declaration of one’s trust or faith in Jesus as our Saviour, Lord, Master and King. It is an indication that we are truly convinced about the Lordship of Christ. It is the opposite of denial and of silence. We make an open declaration about it, and let everyone who cares to know see where our allegiance lies. This confession is indeed necessary for our salvation. It is a statement made with the mouth about Jesus Christ.",
        "action_plan": "Confess Christ today. Do not hide your identity. Speak boldly for Him. Introduce Him to your acquaintances.",
        "thought": "When we have confessed His Lordship, then His saviourship will be manifested in us.",
        "prayer": "Lord Jesus, help me to constantly confess You openly before others. Keep me loyal to you, never ashamed to declare You every time and everywhere. Amen."
    },
    {
        "date": "March 27",
        "title": "JUDAS FAILED THE MAMMON TEST",
        "reference": "Luke 16:10-17",
        "scripture": "If therefore ye have not been faithful in the unrighteous mammon, who will commit to your trust the true riches? Luke 16:11",
        "text": "Corruption can be defined as the abuse of entrusted power for private gain. In corruption risk assessment, the probability that a worker will be corrupt is a product of intention and opportunity. judas intention, He had the intention (to steal). opportunity :he was treasurer. A businessman once said that he considers anyone to be a genuine Christian only if he or she passes the money test. \nMoney is described as unrighteous Mammon, the name of the heathen god of wealth. This is because the love for money is associated with cheating and greed.\nLike Judas, many of our political and public office holders have failed this Mammon test. Some will do anything to acquire wealth. Many Christians have failed to trust God to meet their needs. They placed their faith in the fatness of their bank accounts. People do not know who to trust with their money because many have suddenly changed their principles when it came to money matters. Those who accused the people in authority as corrupt fell flat on their faces, worshipping Mammon when they reached the corridors of power. In every sphere of life, we must endeavour to live above the control of money. It is a good servant but a terrible master. Judas ruined a good opportunity because he could not control his appetite for riches. He wanted to sell the King of glory for thirty pieces of silver. In the end He lost both the money and his Master.",
        "action_plan": "Make a note of the ways you can subdue the temptation of Mammon in your secular and spiritual life.",
        "thought": "Mammon thrives on attention: show your craving for her, she will make you worship. Ignore her, she will respect and serve you.",
        "prayer": "Money is good but let it never control me, Lord. May it remain a tool in my hand to be used for righteous purposes only. Amen."
    },
    {
        "date": "March 28",
        "title": "WHAT IS THE TRUTH?",
        "reference": "John 18:32–38",
        "scripture":"John 18:32 Pilate saith unto him, What is truth? And when he had said this, he went out again unto the Jews, and saith unto them, I find in him no fault at all.John 18:38",
                "text": "There are so many voices of confusion in the streets but the truth is not in the many voices. People were shouting that Barrabas should be freed; everyone wanted to be heard. In the midst of noise, it is hard to hear the truth. The truth is never found mixed up with heresies. It is not a combination of more facts and less lies. It is unalloyed. Lies are loud and assertive and so much energy is required to propagate and sustain it. That is why there was a lot of chaos where the Pharisee were propagating lies against Jesus. The truth is always quiet, peaceful, convincing and easily propagated. An adage says that if lies run away for twenty years, the truth catches up in one day. Actually, the truth does not run. It stays and stands sure. The lies will run around for twenty years and come back to meet the truth at the same point where it stands. If we will hear the truth, we must move away from the noises at the front of the judgment hall where there are mixed multitudes. We must desire like Pilate to interrogate Jesus in the inner chamber. and talk privately with Jesus like Pilate did. Finally, what is the truth? Pilate did not wait to hear the answer before rushing out to the front hall of cacophony. The truth is simple; it is not complicated. The truth is the Person of Jesus. Whatever He commands you is the undiluted truth: do it. And this is found in His word. May the Holy Spirit enlighten our spirit to be set free by the knowledge of Jesus.",
                "action_plan": "What lies has the devil spoken to your spirit? It is time to debunk them by the Word of God.",
           
                "thought": "To hear the truth, quiet your spirit in the presence of God. It will distil in without stress.",
            
                "prayer": "Dear Father, reveal the truth in Your word to me. Let me not be misled by the voices of confusion in the word. Let Your truth set me free in Jesus name. Amen."
        
        
    },
    {
        "date": "March 29",
        "title": "IT IS FINISHED",
        "reference": "John 19:28–35",
        "scripture":"So, when Jesus had received the sour wine, He said, \"It is finished!\" And bowing His head, He gave up His spirit. John 19:30",
        "text": 
            "In John 4:34, Jesus told the disciples, \"My food is to do the will of Him who sent me and to finish His work\". All through His life, Jesus was conscious of His purpose. There was no word wrongly spoken, no step wrongly taken. He knew where He needed to be at every point in time. There were times crowds sought Him, but He went away from their midst because there were other places and people to reach. He was not distracted by those who would make Him king nor deterred by the envy of the religious leaders. No wonder He could confidently say on the cross, \"It is finished\". He had completed every task with intention and diligently fulfilled all that was written about Him in the scriptures. The Greek word translated \"It is finished\" is \"Tetelestai\" whose root word means to bring to an end. This word is used in business dealings to imply the debt is fully paid. In the judgement and the court system it means the sentence is fully served. In military settings, it is a declaration that the battle has been fully won. Jesus Christ accomplished all of this as He hung on the cross. \nThe debt of sin that we owed has been fully paid. He was made sin for us and took the punishment, serving the sentence in our stead. He faced principalities and powers in our place and came out a conqueror having made an open show of them. We are more than conquerors because Christ finished the task.",
            "action_plan":  "Action plan: 1) Identify the unfinished projects and uncompleted tasks in your life 2) take charge in the place of prayer, rebuking the spirit of laziness and procrastination. 3) Go and complete the assignments.",
            "thought":   "Thought for the day: The Lord Jesus has conquered the enemy completely; in Him we are more than conquerors.",
            "prayer":   "Prayer: Thank You Lord for the blood of Jesus that makes us triumphant and gives us the power to reign victoriously."
        
    },
    {
        "date": "March 30",
        "title": "LOUDER THAN ABEL’S BLOOD",
        "reference": "Hebrews 12:22-29",
        "scripture":"",
        "text": "The author discusses the power of blood and how it can either speak of vengeance or forgiveness. They also mention how leaders can be responsible for shedding innocent blood and how Jesus' blood speaks of mercy and forgiveness.",
        "thoughts": "The author encourages readers to identify areas where they may have caused harm and to pray for forgiveness and mercy through the power of Jesus' blood.",
        "prayer": "Dear Lord, I pray that the power of Jesus' blood will silence any negative voices or bloodshed against my life and destiny. May your mercy and forgiveness cover me today. Amen.",
        "action_plan":""  },
    {
        "date": "March 31",
        "title": "ON THE LORD’S DAY: WE ARE PROGRESSIVES!",
        "reference": "Mark 16:1–8",
        "scripture":"Ye seek Jesus of Nazareth, which was crucified: He is risen; He is not here: behold the place where they laid him”. Mark 16:6",

        "text": "After the crucifixion, death and burial of Jesus, the women had been unable to anoint His body properly because of the sabbath. They came to do the anointing as soon as they could, but alas He was not found there! He had moved to the next level: He had risen from the dead. He could not be kept in the grave. The grave was only a part of His journey; it was never His destination. In Luke’s account, the angels asked the disciples why they were looking for the living among the dead (Luke 24:5). Jesus’ purpose could not be stagnated or halted by the grave.\nStagnation is unpleasant. A stagnant water body stinks and harbours all kinds of dirt. If death couldn’t keep our Lord for too long, no evil can stop your progress to the next level of glory. Maybe people are used to seeing you in the grave of poverty, rejection, self-pity and stagnation, your story changes now in the name of the Lord Jesus. Christ is writing a new chapter of your life that looks like the account we read above. You are of the Living God; you’ve got no business among dead flies, dead lives and dead works.\nYour story shall be: “Oh, you guys are looking for the person who used to beg here; who used to be a failure here; who used to be miserable here; whose family life was unsettled here. Sorry, he is not here again. He has moved up in life to a better place and is not coming back. Go tell everyone not to look for him here ever again",
        "thoughts": "Thought for the day: Moving forward is the culture in Zion; stagnant life is strange to the Lord." ,
        "prayer": "Prayer: Every aspect of my life (name them) where I have not moved forward to the next level, I receive the grace to leave the status quo and move up in Jesus name.", 
        "action_plan":"Action plan: Identify areas of life where you have been experiencing stagnation? Call on the resurrection power of Christ to take you out of the grave of setback and retrogression." }
]