[
    {
        "date": "January",
        "week": 1,
        "title": "QUIET TIME",
        "subtitle": "AN OVERVIEW OF QUIET TIME",
        "scriptures": [
            "Mark 1:35","Acts 10:9-10"
        ],
        "memory_verse": "Matt. 14:23 – “And when he had sent the multitudes away, he went up into a mountain apart to pray: and when the evening was come, he was there alone.",
        "objective": "To learn what quiet time is",
        "INTRODUCTION": "Quiet time is a time of solemn fellowship with the Lord, Jesus Christ. It is a daily experience through which a Christian’s relationship with Jesus is fostered and properly enhanced. It is a time devoted for spiritual growth and encounters. Quiet time takes place in an atmosphere that is free from all distractions of life and allows ease of communion with the Lord.",
        "Discussion_title": "Quiet time must be conducted in the following manner:",
        "DISCUSSION": [
              {
                "title": "Alone with God"
,
                "scriptures": [
                    "Genesis 32:22-30",
                    "Matthew 14:22-23",
                    "Exodus 19:2-3"
                ]
            },
              {
                "title": "Free of distraction",
                "scriptures": [
                    "Mark 1:35",
                    "Isaiah 26:9",
                    "Psalms 63:1"
                ]
            },
              {
                "title": "Daily Experience",
                "scriptures": [
                    "Isaiah 50:4",
                    "Psalms 68:19",
                    "Leviticus 6:9-13"
                ]
            },
              {
                "title": "Total openness to the Lord",
                "scriptures": [
                    "Psalms 51:3",
                    "1 Samuel 1:9-16"
                ]
            },
              {
                "title": "Meditation on God’s word",
                "scriptures": [
                    "Joshua 1:8",
                    "Psalms 1:2",
                    "1 Timothy 4:15"
                ]
            },
              {
                "title": "Prayer communion",
                "scriptures": [
                    "Mark 1:35",
                    "2 Corintians 13:14"
                ]
            }
        ],
        "CONCLUSION": "Quiet time is a time and a place where deeper, soul enriching and spiritual meditation is observed. It is a place where instructions are given to fashion a believer into the likeness of the Son of God through prayer and the word of God."
    },
    {
        "date": "January",
        "week": 2,
        "title": "QUIET TIME",
        "subtitle": "IMPORTANCE OF QUIET TIME",
        "scriptures": [
            "Psalms 68:19","Mark 1:35"
        ],
        "memory_verse": "Isa. 50:4 - The Lord God hath given me the tongue of the learned, that I should know how to speak a word in season to him that is weary: he wakeneth morning by morning, he wakeneth mine ear to hear as the learned.",
        "objective": "To study the importance of quiet time in the life of a Christian. ",
        "INTRODUCTION": "There are numerous benefits attached to spending time alone with God. When we fellowship daily with Him, the load is eased, the burden is taken away and there is clarity on our path. In today's study, we shall discuss the important privileges a believer gain by continual fellowship with the Lord.",
        "Discussion_title": "Quiet time affords a believer the following privileges.",
        "DISCUSSION": [
  {
                "title": "Transformation"
,
                "scriptures": [
                    "Exodus 34:29-35",
                    "2 Corintians 3:15-18"
                ]
            },
              {
                "title": "Instruction and direction",
                "scriptures": [
                    "1 Samuel 30:6-8",
                    "Job 33:13-17",
                    "Acts 8:26-31","Psalms 119:105"
                ]
            },
              {
                "title": "Freshness",
                "scriptures": [
                    "Psalms 23:2-3",
                    "Psalms 118:5-8"
                ]
            },
              {
                "title": "Revelation of prophetic agenda",
                "scriptures": [
                    "Revelation 1:10-12",
                    "Daniel 6:10",
                    "Daniel 10:1-10"
                ]
            },
              {
                "title": "Protection",
                "scriptures": [
                    "Psalms 91:1-13"
                ]
            },
              {
                "title": "Divine wisdom",
                "scriptures": [
                    "Psalms 119:91-100"
                ]
            },
              {
                "title": "Mention others",
                "scriptures": [
                ]
            }

        ],
        "CONCLUSION": "The benefits of having a quality relationship with God are enormous but the chief of them all is the transformation of souls. A life is changed to become like the one he beholds on a daily basis in conforming to the image of Christ."
    },
    {
        "date": "January",
        "week": 3,
        "title": "QUIET TIME",
        "subtitle": "THE INGREDIENTS OF A GOOD QUIET TIME",
        "scriptures": [
            "Habakkuk 2:1-2","Luke 4:16-17"
        ],
        "memory_verse": "Psa. 51:17 - The sacrifices of God are a broken spirit: a broken and a contrite heart, O God, thou will not despise.",
        "objective": "This study will focus of the indispensable ingredients of a quality quiet time.",
        "INTRODUCTION": "A correct devotion and quiet time start with the right positioning of the heart before God. When the heart is correct, every other thing is in position. It is important to put in place the necessary ingredients needed to have a quality quiet time. ",
        "Discussion_title": "Discuss succinctly the tool kit to a sustainable quiet time with respect to these scriptures below;",
        "DISCUSSION": [


  {
                "title": "Serene atmosphere free of distraction"
,
                "scriptures": [
                    "Mark 1:35",
                    "Daniel 6:10"
                ]
            },
              {
                "title": "The heart",
                "scriptures": [
                    "2 Chronicles 25:1-3",
                    "Matthew 15:8",
                    "Ezekiel 33:31-32"
                ]
            },
              {
                "title": "The Scripture/Bible",
                "scriptures": [
                    "Luke 4:16-17",
                    "Joshua 1:8",
                    "1 Timothy 4:13"
                ]
            },
              {
                "title": "Prayers and worship",
                "scriptures": [
                    "Acts 6:3-4",
                    "James 5:16-18",
                    "Ephesians 3:14-21"
                ]
            },
              {
                "title": "Journals (writing material)",
                "scriptures": [
                    "1 Timothy 4:13",
                    "Revelation 2:1",
                    "Exodus 17:14",
                    "Exodus 34:27"

                ]
            }

        ],
        "CONCLUSION": "Every journey in God needs to be captured properly as it forms an impeccable part of our becoming like Him. Every single ingredient is necessary because it forms part of what makes us to have a wholesome quiet time.   "
    },
    {
        "date": "January",
        "week": 4,
        "title": "QUIET TIME",
        "subtitle": "FACTORS AFFECTING A SUSTAINABLE QUIET TIME",
        "scriptures": [
            "Galatians 5:25-26"
        ],
        "memory_verse": "Hosea 7:8 - Ephraim, he hath mixed himself among the people; Ephraim is a cake not turned.",
        "objective": "The aim of this study is to study the daily challenges hindering a good quiet time",
        "INTRODUCTION": "As there are several ingredients that facilitate our communion and walk with God, it is good to know that there are also loopholes and several factors that hinder us from having a sustainable and quality devotion. These factors draw a man gradually into the state of backsliding because a correct devotion mortifies the flesh but lack of it empowers it.",
        "Discussion_title": "Discuss in details the factors affecting a sustainable quiet time with respects to these scriptures;",
        "DISCUSSION": [


  {
                "title": "Inconsistency"
,
                "scriptures": [
                    "Revelation 3:14-16",
                    "Hebrews 13:18"
                ]
            },
              {
                "title": "A noisy soul",
                "scriptures": [
                    "1 Thessalonians 5:23",
                    "Psalms 51:17",
                    "Psalms 19:14"
                ]
            },
              {
                "title": "Lack of definite time",
                "scriptures": [
                    "Acts 3:1",
                    "1Kings 18:36",
                    "Genesis 3:8"
                ]
            },
              {
                "title": "Lack of accountability partner",
                "scriptures": [
                    "Acts 13:1-5",
                    "Proverbs 27:17",
                    "Proverbs 17:17"
                ]
            },
              {
                "title": "Lack of knowledge",
                "scriptures": [
                    "Hosea 4:6",
                    "Ephesians 4:17-21",
                    "Philipians 3:10-11"

                ]
            },
              {
                "title": "Add your personal experiences",
                "scriptures": [
                  
                ]
            }


        ],
        "CONCLUSION": "There are several factors affecting a sustainable quiet time. They range from inconsistency to the lack of knowledge needed to navigate this matter while creating a balance in spite of our busy schedules. They are the little foxes that affect our walk with Jesus. We must do all that is within our capabilities to deal with these matters for us to have an unbroken, consistent, and sustainable relationship with God"
    },
    {
        "date": "February",
        "week": 1,
        "title": "INTIMACY WITH GOD",
        "subtitle": "WHAT IS INTIMACY WITH GOD?",
        "scriptures": [
            "John 15:1-15","John 6:63"
        ],
        "memory_verse": "Gen. 18:17 - \"And the Lord said, Shall I hide from Abraham that thing which I do?\"",
        "objective": "To understand what it means to be intimate with God.",
        "INTRODUCTION": "Intimacy with God involves cultivating a deep connection with Him, sharing thoughts, feelings, and experiences. God didn't create humanity to exist apart from Him. In the Garden of Eden, God had a close relationship with Adam, evident in His visits during the cool of the day. This kind of intimacy begins with being born again. It doesn't happen by chance but is a pursuit open to all who truly desire it.",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "Intimacy with God is characterized by mutual and effective communication. It is cultivated through intentional devotion, commitment, and worship. While many are children of God, only a few maintain an intimate relationship with Him. Where do you stand?"
    },
    {
        "date": "February",
        "week": 2,
        "title": "INTIMACY WITH GOD",
        "subtitle": "SUSTAINING DEVELOPED INTIMACY WITH GOD ",
        "scriptures": [
            "John 15:1-8"
        ],
        "memory_verse": "Jer. 29:13 - \"If you look for me wholeheartedly, you will find me.\" ",
        "objective": "To learn how to develop and sustain intimacy with God.",
        "INTRODUCTION": "Intimacy with God is a journey that develops over time. There's no final destination in the pursuit of closeness with God. Sustenance of intimacy does not come without being intentional about it. In the present study, we shall among other things learn how some selected biblical characters sustained their intimacy with God.",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "Every true child of God has some degree of intimacy with Him. The depth of this intimacy however differs, depending on individuals' levels of commitment to maintaining an unbroken relationship with God. Embrace spiritual discipline and you shall with the help of the Holy Spirit live uprightly and remain close to God"
    },
    {
        "date": "February",
        "week": 3,
        "title": "INTIMACY WITH GOD",
        "subtitle": "OBSTACLES TO DEVELOPING INTIMACY WITH GOD",
        "scriptures": [
            "Matthew 6:24-34"
        ],
        "memory_verse": "Matt 6: 24 - No one can serve two masters. Either you will hate the one and love the other, or you will be devoted to the one and despise the other. You cannot serve both God and money. ",
        "objective": "To determine some things that can hinder a believer's intimacy with God",
        "INTRODUCTION": "Intimacy with God is highly rewarding. Many believers would want to enjoy these benefits, unfortunately, there are subtle ways of life that can hinder the realization of intimacy with God. Some of these are discussed in today's study.",
        "Discussion_title": ": Let's examine some obstacles to developing intimacy with God",
        "DISCUSSION": [],
        "CONCLUSION": "Some things must be given over to gain the height of intimacy with God. You must be ready to give away anything that might stand as hindrance to Attaining this height. Make up your mind to pledge your allegiance to the Lord without bowing to the altar of obstacles"
    },
    {
        "date": "February",
        "week": 4,
        "title": "INTIMACY WITH GOD",
        "subtitle": "BENEFITS OF INTIMACY WITH GOD",
        "scriptures": [
            "Exodus 33:12-21"
        ],
        "memory_verse": "Psalm 25:14 - \"The LORD confides in those who fear him; he makes his covenant known to them.\"",
        "objective": "To examine the lives of biblical patriarchs who enjoyed intimacy with God and the benefits they reaped",
        "INTRODUCTION": "Intimacy with God comes with a price, but it offers abundant benefits to those who achieve it. Many remain in the \"outer court\" with wishful thoughts, while a few press into the \"inner court\" and experience the fullness of God's presence.",
        "Discussion_title": "Let's examine the patriarchs and their benefits from intimacy with God:",
        "DISCUSSION": [],
        "CONCLUSION": "The benefits of intimacy with God are inexhaustible. The closer we are to God, the more of His blessings we experience. Although the path to intimacy is narrow, the door remains open for all believers. Will you take the step to pursue God's presence today?"
    },
    {
        "date": "March",
        "week": 1,
        "title": "GROWING INTO MATURITY",
        "subtitle": "BIBLICAL CONCEPT OF MATURITY",
        "scriptures": [
            "Ephesians 4:10-15"
        ],
        "memory_verse": "Galatians 4:19 - My dear children, for whom I am again in the pains of childbirth until Christ is formed in you.",
        "objective": "The aim of this study is to understanding what Maturity Implies",
        "INTRODUCTION": "Maturity in a growth process is assessed by the expression of certain features. In plants, a specie is said to be mature when it begins to flower and then produce fruits. In the same way, the life of a Christian is better expressed with certain features that suggests and shows evidence of maturity.",
        "Discussion_title": "The Biblical concept of maturity in a Christian is described as:",
        "DISCUSSION": [],
        "CONCLUSION": "It is impossible to dissociate maturity from the growth process. Heaven has an expected growth rate from you as a Christian since you were born into the family of Christ. Does your growth correlate with heaven's investment over your life? Maturity is not measured by number of years in the Lord but by total obedience to God by living the life of Christ."
    },
    {
        "date": "March",
        "week": 2,
        "title": "GROWING INTO MATURITY",
        "subtitle": "REQUIREMENTS FOR GROWING INTO MATURITY.",
        "scriptures": [
            "Matthew 16:24"
        ],
        "memory_verse": "Matt. 16:24 - Then Jesus said to his disciples, Whoever wants to be my disciple must deny themselves and take up their cross and follow me",
        "objective": "This study is aimed at learning what it takes to grow into spiritual maturity.",
        "INTRODUCTION": "Every tower that is successfully built has a cost that must be well counted and calculated. For any plant to show the features of maturity, it has to first be planted, died and bring forth a new life. - John 12:24. There is a price every Christian who desires to grow into maturity in Christ must pay. These are requirements from God and men to grow into maturity",
        "Discussion_title": "The following are the requirements that builds a Christian into maturity:",
        "DISCUSSION": [],
        "CONCLUSION": "Maturity is not achieved by accident and not a sudden event, it is a progressive process and it requires intentionality as we work towards attaining it daily."
    },
    {
        "date": "March",
        "week": 3,
        "title": "GROWING INTO MATURITY",
        "subtitle": "EVIDENCES OF A MATURE CHRISTIAN",
        "scriptures": [
            "Galatians 5:22-24"
        ],
        "memory_verse": "Matt. 7:16- You will recognize them by their fruits. Are grapes gathered from thornbushes, or figs from thistles?",
        "objective": "To highlight the identifiable attributes of a mature Christian",
        "INTRODUCTION": "Every creation produce its own kind, humans, animals and trees. That was how God created it from inception. The fruit an individual bears shows the evidence of the seed being sown into that person.",
        "Discussion_title": "The growth and maturity of every believers in Jesus Christ is measured by",
        "DISCUSSION": [],
        "CONCLUSION": "By your fruit, you shall be identified. You cannot be of God and be growing in God and not show or bear the fruit of the Spirit."
    },
    {
        "date": "March",
        "week": 4,
        "title": "GROWING INTO MATURITY",
        "subtitle": "THE IMPACTS OF CHRISTIAN MATURITY.",
        "scriptures": [
            "Hebrews 5:12-14"
        ],
        "memory_verse": "Heb. 5:13 - For everyone who lives on milk is unskilled in the word of righteousness. ",
        "objective": "This study is aimed discuss the need for maturity of a Christian",
        "INTRODUCTION": "Whether a Christian choses maturity or not, there are implications. Any position you take have consequences. So, you cannot be on the fence, you have to choose where to belong. Remember, any branch that does not produce good fruits shall be cut off",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "Our maturity as a Christian helps us get closer to God and consequently increases us in wisdom, knowledge and understanding that consistently improves our Christian living"
    },
    {
        "date": "April",
        "week": 1,
        "title": "APPROPRIATE SKILLS FOR PERFORMANCE",
        "subtitle": "WHAT ARE APPROPRIATE SKILLS?",
        "scriptures": [
            "Exodus 35:30-35"
        ],
        "memory_verse": "Pro 22:29 - Do you see a man skilled in his work? He will stand before kings; He will not stand before obscure men (ESV)",
        "objective": "This study aims at helping us to identify appropriate skills with respect to individual uniqueness, geographical location, and profession",
        "INTRODUCTION": "Skill means ability or technical know-how or expertise in a field. Appropriate skills refer to the abilities and competencies required to perform a specific task, job, or role effectively. They are the skills that enable individuals to accomplish their goals, meet expectations, and succeed in their endeavors. The God factor in skill acquisition is of relevance to believers. God gives grace, ability, wisdom and empowerment to acquire and utilize every skill. In all our dealings, we must recognize the place of God in acquiring and utilizing any skill",
        "Discussion_title": "Some examples of skills and identify the God-factor in skill acquisition:",
        "DISCUSSION": [],
        "CONCLUSION": "Having appropriate skills with proper training can lead to improved performance, enhanced productivity, increased confidence, better decision-making, and personal and professional growth. Therefore, let us submit to God through the Holy Spirit as he leads us identify appropriate skills we can learn for overall wellbeing."
    },
    {
        "date": "April",
        "week": 2,
        "title": "APPROPRIATE SKILLS FOR PERFORMANCE",
        "subtitle": "HOW TO DEVELOP APPROPRIATE SKILLS",
        "scriptures": [
            "Daniel 1:4-17"
        ],
        "memory_verse": ": 2 Tim. 3:17 - That the man of God may be perfect, thoroughly furnished unto all good works.",
        "objective": "To help us identify necessary steps to developing appropriate skills and realize that the Holy Spirit works through our skills",
        "INTRODUCTION": "Skill development is pleasing to God as it increases our usefulness to humanity, the household of faith and to our Father and Creator. The power of the Holy Spirit enables Christians to develop appropriate skills for greater performance. Developing appropriate skills requires a deliberate, continuous and sustained effort. By developing appropriate skills, individuals can improve their performance and advance in their roles. Dan 2:48.",
        "Discussion_title": "The following are some steps individuals can adopt for skill development, in pursuit of fulfilling Divine mandate:",
        "DISCUSSION": [],
        "CONCLUSION": "Remember, developing appropriate skills takes time, effort, and dedication. Focus on progress, not perfection. Rely solely on the leading of the Holy Spirit during the training period"
    },
    {
        "date": "April",
        "week": 3,
        "title": "APPROPRIATE SKILLS FOR PERFORMANCE",
        "subtitle": "IMPROVING YOUR SKILLS FOR INCREASE PERFORMANCE",
        "scriptures": [
            "Daniel 5:11-16"
        ],
        "memory_verse": "Eph. 2:10 - For we are God's masterpiece. He has created us anew in Christ Jesus, so we can do the good things he planned for us long ago (NLT)",
        "objective": "To reinforce our understanding of performance and the factors that affect development of skills",
        "INTRODUCTION": "Performance refers to the execution or accomplishment of a task, function, or role to a certain standard or level of quality. It involves the effective and efficient use of skills, knowledge, and resources to achieve specific goals or outcomes. Regular use and application of skills strengthen and improve them for performance (Dan 5: 11-16). Skills are not only beneficial for personal growth but also honor God and reflect His character",
        "Discussion_title": ": Factors that affect skill development among believers include:",
        "DISCUSSION": [],
        "CONCLUSION": "Remember, improving your skills for effective performance is not only a lifelong process but also an act of worship. By integrating these biblical principles, you'll honor God and become more effective in your endeavors. Therefore, yield your skills and their development to the Holy Spirit"
    },
    {
        "date": "April",
        "week": 4,
        "title": "APPROPRIATE SKILLS FOR PERFORMANCE",
        "subtitle": "CONSEQUENCES OF UNSKILLFULNESS",
        "scriptures": [
            "Ecclesiastes 10:10",
            "15"
        ],
        "memory_verse": "Heb. 5:13 - For every one that useth milk is unskilful in the word of righteousness: for he is a babe",
        "objective": "To identify the implications of unskilled life",
        "INTRODUCTION": "The consequences of unskillfulness can be far-reaching and impact various aspects of life, including reduced productivity poor decisions, financial losses and missed opportunity. Unskillfulness affects home, church, institutions and the society. In personal life, unskillfulness can lead to frustration and stress, dependence on others, missed personal growth opportunities and decreased self-esteem",
        "Discussion_title": "Discuss the following consequences of unskillfulness",
        "DISCUSSION": [],
        "CONCLUSION": "Remember, developing skills takes time and effort, but the consequences of unskillfulness can be significant. Investing in skill development can lead to personal and professional growth, increased confidence, improved relationships and quality devoutness towards God"
    },
    {
        "date": "May",
        "week": 1,
        "title": "RELATIONSHIPS",
        "subtitle": "DIMENSIONS OF RELATIONSHIPS",
        "scriptures": [
            "Genesis 2:20-25"
        ],
        "memory_verse": "1 John 1:3- This is the life we have seen and heard. We are reporting about it to you also so that you, too, can have a relationship with us. Our relationship is with the Father and with his Son Jesus Christ. {GW}",
        "objective": "To discuss the dimensions of relationships and the requirements in each of them",
        "INTRODUCTION": "God never created any living thing to dwell in isolation from its kind. God established relationship, sustained through all generations, for man created in His own image. God released Jesus Christ to restore and solidify His relationship with man that was marred at the fall of man. Relationships, therefore, are God's idea for His creations. Each relationship has some expected behaviors to keep it mutual, healthy and rewarding",
        "Discussion_title": "There are two major relationships as far as God is concerned;",
        "DISCUSSION": [],
        "CONCLUSION": "Relationships are meant for human advancement and sustenance with God in the equation. Keep giving in the biblical requirements in your relationships and you would be happy and fulfilled"
    },
    {
        "date": "May",
        "week": 2,
        "title": "RELATIONSHIPS",
        "subtitle": "KEEPING A HEALTHY RELATIONSHIP",
        "scriptures": [
            "Luke 11:5-8"
        ],
        "memory_verse": "Prov. 17:17 - A friend loveth at all times, and a brother is born for adversity",
        "objective": "To discover how to sustain healthy relationships",
        "INTRODUCTION": "Every relationship is unique, and people come together for different reasons. Part of what defines a healthy relationship is sharing a common goal for exactly what you want the relationship to be and where you want it to go",
        "Discussion_title": "To sustain healthy relationship",
        "DISCUSSION": [],
        "CONCLUSION": "Healthy relationships involve honesty, trust, respect and open communication between partners and they take effort and compromise from both people. Knowing these basic principles can help keep your relationship meaningful, fulfilling and exciting. It is vanity of life to be without relationship - Eccl. 4:8"
    },
    {
        "date": "May",
        "week": 3,
        "title": "RELATIONSHIPS",
        "subtitle": "THE BENEFITS OF HEALTHY RELATIONSHIP ",
        "scriptures": [
            "Romans 12:9-21"
        ],
        "memory_verse": "Eccl. 4:9 - Two are better than one, because they have a good return for their labor ",
        "objective": "To Identify the benefits of healthy relationship.",
        "INTRODUCTION": "The Bible teaches that love is the foundation of all relationships, and that love should be characterized by selflessness, kindness, and forgiveness. Every healthy relationship built on love has a lot to offer the partners as we shall study in this lesson.",
        "Discussion_title": "Some benefits of an intimate relationship with the Lord:",
        "DISCUSSION": [],
        "CONCLUSION": "When we have a relationship with God, we feel satisfied, content, and peaceful. This also improves our relationships with other people, giving us a better life in general."
    },
    {
        "date": "May",
        "week": 4,
        "title": "RELATIONSHIPS",
        "subtitle": "SIGNS AND CONSEQUENCES OF BAD RELATIONSHIPS",
        "scriptures": [
            "Psalms 73:1-23"
        ],
        "memory_verse": "1 Cor. 15:33- Be not deceived: evil communications corrupt good manners.",
        "objective": "To highlight the signs and threats to healthy relationships from biblical examples.",
        "INTRODUCTION": "Relationships are good and instituted by God. Unfortunately, a man or woman cannot give what they do not have. An unregenerate soul could be a danger when you keep a close relation with him or her. We shall learn from some biblical examples of such in today's lesson.",
        "Discussion_title": "Discuss how the actions and inactions of these characters damaged the relationship in context:",
        "DISCUSSION": [],
        "CONCLUSION": "Be mindful of the relationship you keep because it has the capacity to make or mar you. Choose your close friends with care so as to have a safe haven. "
    },
    {
        "date": "June",
        "week": 1,
        "title": "THE MIV MANDATE",
        "subtitle": "UNDERSTANDING THE MIV MANDATE",
        "scriptures": [
            "1 Chronicles 12:32"
        ],
        "memory_verse": "1Chron 12:32 - And of the children of Issachar, which were men that had understanding of the times, to know what Israel ought to do; the heads of them were two hundred; and all their brethren were at their commandment.",
        "objective": "To know and understand what MIV is commission to do",
        "INTRODUCTION": "The acronym MIV means - the MEN OF ISSACHAR VISION. According to Matthew 28:19-20, the mandate of the Great commission is a must for all who believe in the Lord Jesus Christ. MIV was established with the dual mandate of reaching the unreached at all costs and reawakening the church to her responsibilities (Missions and Reawakening). ",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "As it is written-My people perish for lack of knowledge. (Hosea 4:6). Understanding of the times we are in is very critical to the actualization and realization of God's will and purposes for our lives individually and collectively as a church. May we all come to the full understanding of the MIV mandate and be wholly committed to it spirit, soul and body"
    },
    {
        "date": "June",
        "week": 2,
        "title": "THE MIV MANDATE",
        "subtitle": "REAWAKENING AND REACHING THE UNREACHED",
        "scriptures": [
            "Genesis 49:14-15"
        ],
        "memory_verse": "Isaiah 52:1 - Awake, awake; put on thy strength, O Zion, put on thy beautiful garment, O Jerusalem, the holy city; from henceforth, there shall no more come into thee the uncircumcised and the unclean.'",
        "objective": "To understand in details the MIV Mandate Strategies.",
        "INTRODUCTION": "The level of moral decadence and absolute compromise is alarming right from even within the church circles. Certain vices that should not be named among us, are now not only named but sadly enough in some cases have their origin traceable to the church leadership. The church needs to be awakened through her leadership structure and take to her responsibilities. This is a task that must be done, one for which is our vision and thrust.",
        "Discussion_title": "Gleaning through and understanding our involvement and responsibilities",
        "DISCUSSION": [],
        "CONCLUSION": "If we must attain the goal of seeing the church reawakened to her responsibilities, it is most imperative that the one saddled with such a responsibility must of himself be one who is fully awakened and fervent in spirit. (Romans12:11)"
    },
    {
        "date": "June",
        "week": 3,
        "title": "THE MIV MANDATE",
        "subtitle": "OUR STAKE IN THE VISION AND MISSION",
        "scriptures": [
            "Matthew 24:14"
        ],
        "memory_verse": "Matt. 24:14 - And this gospel of the kingdom shall be preached in all the world for a witness unto all the nations; and then shall the end come.",
        "objective": "W1hat mission is and ways to be involved",
        "INTRODUCTION": "Mission is a deliberate and practical effort of a believer or a church to take the gospel of Jesus Christ across barriers of geography, religion, culture and language to another place where it is yet to be preached sufficiently to provoke adequate response to lead to the establishment of a community of believers. ",
        "Discussion_title": "Every believer is to be actively involved in missions by Praying, Giving and Going.  Some practical ways of involvement.",
        "DISCUSSION": [],
        "CONCLUSION": "God's only solution to the darkness that is pertinent is the Light. Except the Light shines, the darkness will continue to spread and cover the surface of the nations. God forbid that in our day, darkness will overcome light. We must rise up and get to work. Be active and not passive in the mission mandate today"
    },
    {
        "date": "June",
        "week": 4,
        "title": "THE MIV MANDATE",
        "subtitle": "I MUST WORK THE WORK OF GOD",
        "scriptures": [
            "John 4:31-34"
        ],
        "memory_verse": "John 9:4 - I must do the work of him that sent me, while it is day: the night cometh when no man can work.  ",
        "objective": "To understand that every believer (Issachar) is called to be a missionary.",
        "INTRODUCTION": "Jesus answering in response to the people who came to him and queried what was required to do the work of God, said this is the work of God, that ye believe on him whom he hath sent - John 6:28-29.  Every effort of a believer  that cumulate in getting people to believe in the Lord Jesus Christ and surrendering their lives to him as their Lord and Savior amounts to doing the work of God",
        "Discussion_title": "Doing the work of God entails deliberate and intentional commitment to every course of getting men saved (the great commission)",
        "DISCUSSION": [],
        "CONCLUSION": "The call to missions is a call to every believer. The mission fields may differ from persons to persons, but the central thrust of getting all men/people to know Jesus Christ and believing in him is a task that must be done irrespective of geographical locations, cultural differences, and religion and language barriers. Every Issachar a missionary!"
    },
    {
        "date": "July",
        "week": 1,
        "title": "DEALING WITH ADDICTIONS",
        "subtitle": "NATURE OF ADDICTIONS",
        "scriptures": [
            "1 Chorintians 6:12"
        ],
        "memory_verse": "1 Cor. 10:23 - \"All things are lawful for me, but all things are not expedient: all things are lawful for me, but I will NOT BE BROUGHT UNDER THE POWER OF ANY.\"",
        "objective": "What addiction is, and",
        "INTRODUCTION": "Addiction is a state in which a person's volition over a choice of behavior is lost. It is a situation where an individual is no longer in control of his or her choice over a particular kind of behavior(s). The person's will has been overtaken by the object of the addiction. At this stage, a person is in bondage to the addiction and cannot free himself or herself without external help. This is what Apostle James refers to as sin, which, when fully grown, leads to death (James 1:15).",
        "Discussion_title": "Types of Addictions",
        "DISCUSSION": [],
        "CONCLUSION": "We must beware of the devil's schemes because his intention is not just to make us breach God's principles but to bring us into bondage through any behavior, whether legitimate or illegitimate."
    },
    {
        "date": "July",
        "week": 2,
        "title": "DEALING WITH ADDICTIONS",
        "subtitle": "THE PATHWAY TO ADDICTIONS",
        "scriptures": [
            "James 1:13-15"
        ],
        "memory_verse": "James 1:13-15 - \"Let no one say when he is tempted, 'I am tempted by God'; for God cannot be tempted by evil, nor does He Himself tempt anyone. But each one is tempted when he is drawn away by his own desires and enticed. Then, when desire has conceived, it gives birth to sin; and sin, when it is fully grown, brings forth death\" (NKJV).",
        "objective": "The pathway through which addictions take hold of a person, and",
        "INTRODUCTION": "Addiction is not suddenly but progresses through certain defined stages. These stages are the pathways which addiction comes and takes control. When a person's gates are not secured against the activities that lead to addiction, the inevitable is bound to happen. According to Apostle James, the pathway into addiction is: Temptation & Sin & Death (Addiction).",
        "Discussion_title": "Pathways of addiction",
        "DISCUSSION": [],
        "CONCLUSION": "Every believer must understand the pathway through which addiction or death comes in and guard against the enemy taking a foothold in our lives."
    },
    {
        "date": "July",
        "week": 3,
        "title": "DEALING WITH ADDICTIONS",
        "subtitle": "UNDERSTANDING THE GATES OF TEMPTATION",
        "scriptures": [
            "Proverbs 4:23"
        ],
        "memory_verse": "Proverbs 4:23 - \"Guard your heart with all diligence, for out of it flows the issues of life.\"",
        "objective": "How a person becomes vulnerable to evil, and",
        "INTRODUCTION": "The heart is the center of our life's activities. A person's identity and behavior are derived from the heart (Proverbs 23:7). This is why the devil seeks to take over our hearts first, before progressing to control our actions. Once a person's heart is contaminated, their actions and deeds will be defiled. However, things do not enter a person's heart suddenly; they pass through certain gates, meaning there are gates that lead to a person's heart.",
        "Discussion_title": "Let Us Examine the Gates Below",
        "DISCUSSION": [],
        "CONCLUSION": "We must be diligent in guarding these gates because the evil outside a person is not as powerful as the evil that has crept into a person. This is the first level of defense that we must aggressively maintain."
    },
    {
        "date": "July",
        "week": 4,
        "title": "DEALING WITH ADDICTIONS",
        "subtitle": "VICTORY OVER ADDICTIONS",
        "scriptures": [
            "Galatians 5:1"
        ],
        "memory_verse": "Galatians 5:1 - \"Stand fast therefore in the liberty by which Christ has made us free, and do not be entangled again with a yoke of bondage.\"",
        "objective": "Fight and gain victory over the enemy's guile, and",
        "INTRODUCTION": "We are called to holiness, and it is very possible to live in holiness. If this were not so, we would not have been provided with the equipment necessary to achieve it. We can walk on earth and live in holiness as our Lord Jesus did. Our Lord Jesus while on earth, lived and lead a guiltless life (John 8:46, 1 Pet 2:22). Matt. 5:48 (NKJV) reveals that it is possible to be perfect just as our heavenly father is perfect.",
        "Discussion_title": "The Actions We Must Commit to in the Walk of Holiness",
        "DISCUSSION": [],
        "CONCLUSION": "God wants us to live victorious Christian lives, and we must make every effort not only to be free but also to stay free."
    },
    {
        "date": "August",
        "week": 1,
        "title": "IN THE DAYS OF HIS POWER",
        "subtitle": "WHAT IS POWER?",
        "scriptures": [
            "Psalms 110:3"
        ],
        "memory_verse": "Eph. 1:19-20 - I also pray that you will understand the incredible greatness of God's power for us who believe Him. This is the same mighty power that raised Christ from the dead and seated Him in the place of honour at God's right hand in the heavenly realms. - (NLT)",
        "objective": "To understand the meaning of power from a biblical perspective and how God's power operates in the lives of believers",
        "INTRODUCTION": "Power in today's world manifests in many forms: political, spiritual, financial, and more. The Greek word for power, 'dunamis,' represents dynamic, transformative ability. This divine power is a characteristic of God and a gift to believers, enabling us to live effectively for God's purposes. Without this power, we are limited in overcoming life's challenges, fulfilling our destinies, and helping others",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "There are challenges that only those who are empowered can overcome. Power grants the ability to dominate in any sphere, enabling individuals to rise above obstacles that would otherwise hold them back. An empowered believer is one who lives the life of God, has the word of God and aligns with the working of the Holy Spirit"
    },
    {
        "date": "August",
        "week": 2,
        "title": "IN THE DAYS OF HIS POWER",
        "subtitle": "HOW TO ACCESS HIS POWER I",
        "scriptures": [
            "Acts 1:8"
        ],
        "memory_verse": "Acts 1:8 - But you will receive power when the Holy Spirit comes on you;and you will be my witnessesin Jerusalem, and in all Judea and Samaria,and to the ends of the earth.",
        "objective": "To see the biblical way of accessing power and learn from the lives of the patriarchs and early Apostles/Church on how they accessed power",
        "INTRODUCTION": "Just as physical empowerment enables a person to fully realize their thoughts and desires, spiritual empowerment is equally crucial. A person without power will struggle to succeed in life and ministry. With challenges all around us, walking in God's power is essential, not optional",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "We must pay the price to access Gods power. It would take a conscious effort and spiritual exercise to receive all that God has prepared for us"
    },
    {
        "date": "August",
        "week": 3,
        "title": "IN THE DAYS OF HIS POWER",
        "subtitle": "HOW TO ACCESS HIS POWER II",
        "scriptures": [
            "Luke 4:14"
        ],
        "memory_verse": "Acts 8:17 - Then they laid hands on them, and they received the Holy Spirit ",
        "objective": "To identify ways we can access God's power",
        "INTRODUCTION": "Without the strength and guidance that come from divine empowerment, even the most well-intentioned efforts can falter. With challenges constantly surrounding us, relying on God's power is not just an option: it's a necessity. The believers of old understood the importance of power, lets learn from them",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "We must pay the price to access Gods power. It would take a conscious effort and spiritual exercise to receive all that God has prepared for us."
    },
    {
        "date": "August",
        "week": 4,
        "title": "IN THE DAYS OF HIS POWER",
        "subtitle": "BENEFITS OF HIS POWER",
        "scriptures": [
            "Acts 10: 38-40"
        ],
        "memory_verse": "Acts 10:38 - How God anointed Jesus of Nazareth with the Holy Spirit and with power, who went about doing good and healing all who were oppressed by the devil for God was with him",
        "objective": "Helping us see the benefits of Gods power for our daily living as believers",
        "INTRODUCTION": "God's power is central to the Christian Walk, offering believers a source of strength.  The benefits of God's power manifest in various aspects of the Christian life both secular and in kingdom service. Understanding these benefits can create a hunger for more of God",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "God's power in our lives presents numerous opportunities. We must endeavor to seek him more for greater kingdom exploits"
    },
    {
        "date": "September",
        "week": 1,
        "title": "CHARACTER",
        "subtitle": "CHARACTER DEFECT I - WHAT IS IT?",
        "scriptures": [
            "Psalms 1:1-3"
        ],
        "memory_verse": "Matt. 7:16 - You can identify them by their fruit, that is, by the way they act. Can you pick grapes from thornbushes, or figs from thistles?",
        "objective": "Define character and understand its importance",
        "INTRODUCTION": "Our character represents the inner fabric of our lives, evident through actions and choices without necessarily uttering a word or public declarations. Reputation reflects how others perceive us, but character eventually reveals who we truly are, especially over time. Character defects refer to aspects of behavior or personality that conflict with our values or professed beliefs, causing harm or inconsistency in our lives",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "As Proverbs 4:23 advises, guard your heart because it shapes your character and actions. Carry out a litmus test, does your character perfectly aligns with Kingdom's value or you are missing the Mark"
    },
    {
        "date": "September",
        "week": 2,
        "title": "CHARACTER",
        "subtitle": "CHARACTER DEFECT II - IDENTIFYING THEM",
        "scriptures": [
            "Proverbs 6:16-19"
        ],
        "memory_verse": "Proverbs 28:6 - Better is the poor that walketh in his uprightness than he that is perverse in his ways, though he be rich",
        "objective": "Understand the place of Gifting and Character",
        "INTRODUCTION": "Our gifts, talent and gifting are blessings from God (John 3:27). Hence, the balance between using gifts for kingdom purpose and avoiding prideful corruption requires vigilance. Gifts can bring attention, but character is what sustains respect and trust. How do we then identify and take cognizance of the little foxes?",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "Gifts may be seen outwardly, but character is revealed through trials. Identifying our character flaws allows us to work towards growth in integrity and humility"
    },
    {
        "date": "September",
        "week": 3,
        "title": "CHARACTER",
        "subtitle": "CHARACTER DEFECT III - OVERCOMING THEM",
        "scriptures": [
            "Galatians 5:22-26"
        ],
        "memory_verse": "1 Cor. 15:33 - Be not deceived: evil communications corrupt good manners",
        "objective": "To emphasize the role of the Word of God and the Holy Spirit in character transformation.",
        "INTRODUCTION": "Our CHARACTER is the foundation of our worth. Our Character is influenced from within and shaped by what we often relate with. A good heart will yield positive results, while an evil heart will give bad results. By consistently reflecting on God's word, we can align ourselves with God's nature, allowing for true change",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "Transformation of character is ongoing, requiring constant dedication to God's Word, obedience and fellowship with other believers. This environment fosters growth and the elimination of flaws that hinder our spiritual growth."
    },
    {
        "date": "September",
        "week": 4,
        "title": "CHARACTER",
        "subtitle": "CHARACTER DEFECT IV - TRANSFORMATION/ITS IMPACT",
        "scriptures": [
            "John 12:20-26"
        ],
        "memory_verse": "Galatians 2:20 - I am crucified with Christ: nevertheless, I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me and gave himself for me.",
        "objective": "Understand how true character transformation takes place",
        "INTRODUCTION": "Though we may confess Christ as Lord, true character transformation requires surrender and daily refinement through God's Word, in other word, death to self and alive to Christ. This growth enables us to truly reflect Christ's character, living true to our call as His disciples and to our identity Christian (Christ-like).",
        "Discussion_title": "Essentials for transformation",
        "DISCUSSION": [],
        "CONCLUSION": "Character transformation is a deliberate journey that requires spiritual discipline and dependence on Christ. By allowing the Word to refine us, we can overcome character defects and live fully in God's purpose and for His glory"
    },
    {
        "date": "October",
        "week": 1,
        "title": "ANGER",
        "subtitle": "DEFINITION AND ORIGIN OF ANGER",
        "scriptures": [
            "Genesis 4:3-8;Genesis 6:5-8;Genesis 27:32-45"
        ],
        "memory_verse": "Eccl. 7:9- Be not hasty in thy spirit to be angry: for anger resteth in the bosom of fools.",
        "objective": "Understanding what Anger is",
        "INTRODUCTION": "Anger is the general term for a sudden outburst of displeasure that sometimes could be violent. It is a strong feeling aroused by injury, injustice, wrong, etc. Anger outburst could be deep and justified at cruelty or against corruption. In some other instances, it could be a deep reaction to failure, regret over personal actions, rejection, complex and jealousy",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "Anger is a God-given emotion of displeasure. It is a response to a real or perceived wrong. However, we must be in full control of our emotions and channel our anger towards achieving righteousness"
    },
    {
        "date": "September",
        "week": 2,
        "title": "ANGER",
        "subtitle": "CAUSES OF ANGER",
        "scriptures": [
            "Esther 3:1-6"
        ],
        "memory_verse": "Proverbs 14:17 - A quick-tempered man acts foolishly, and a man of wicked intentions is hated.",
        "objective": "X-ray factors that causes anger",
        "INTRODUCTION": "Anger typically develops as a response to unwanted actions of another person who is perceived to be disrespectful, demeaning, threatening of neglectful. It is often a reaction to and distraction from inner suffering - feelings such as sadness, powerlessness, shame, anxiety, inadequacies and isolation.",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "We should avoid anger by all means (Jas. 1:20). Anger is only justified if it leads to repentance, reconciliation and restoration. Before you get angry at anyone, check yourself first for any shortcomings to correct, and like God asked Cain, always ask Why am I angry?"
    },
    {
        "date": "September",
        "week": 3,
        "title": "ANGER",
        "subtitle": "HOW TO MANAGE ANGER ",
        "scriptures": [
            "Genesis 32:7-14"
        ],
        "memory_verse": "Pro 19:11- If you are sensible, you will control your temper. When someone wrongs you, it is a great virtue to ignore it. - GNB",
        "objective": "To understand biblical provisions to overcoming anger",
        "INTRODUCTION": "Anger outbursts are common in our current climate filled with anxieties, political tensions, and disagreements over various cultural and moral issues. It's not uncommon to encounter bitter criticism online as well as in places as mundane as the Market and stores. It's easy for Christians to get caught up in the spirit of things, but the problem with unbridled anger is that it often leads us down the wrong path.",
        "Discussion_title": "How to manage your anger.",
        "DISCUSSION": [],
        "CONCLUSION": "Anger that is not well managed can destroy hence the need to recognize that as humans we are prone to anger, and as such we must deliberately work upon ourselves to properly manage the anger. For the wrath of man worketh not the righteousness of God - Jas. 1:20."
    },
    {
        "date": "September",
        "week": 4,
        "title": "ANGER",
        "subtitle": "CONSEQUENCES OF UNCONTROLLED ANGER",
        "scriptures": [
            "! Samuel 25:2-38"
        ],
        "memory_verse": "Jas 1:20- Anger does not help you live the way God wants. (ERV)",
        "objective": "We consider the consequences of uncontrolled Anger.",
        "INTRODUCTION": "People who indulge in uncontrolled anger tend to underestimate the consequences. Uncontrolled anger is neither instructive nor corrective, rather it is destructive. It does not build up, rather it pulls down. It does not heal, rather it wounds. It solves nothing but succeeds in getting everything more complicated.",
        "Discussion_title": "",
        "DISCUSSION": [],
        "CONCLUSION": "Anger can destroy lives, tear relationships apart, and ruin a believer's witness. The apostle Paul understood the negative potential of resentment, and he offered this advice on how to deal with it: Let all bitterness and wrath and anger and clamor and slander be put away from you, along with all malice."
    },
    {
        "date": "November",
        "week": 1,
        "title": "STRIFE AND CONFLICTS",
        "subtitle": "UNDERSTANDING STRIFE AND CONFLICTS",
        "scriptures": [
            "James 3:16"
        ],
        "memory_verse": "Romans 12:18: \"If it is possible, as far as it depends on you, live at peace with everyone.\"",
        "objective": "To know what is Strife and Conflicts",
        "INTRODUCTION": "When you look at the world today, you will see there is a quantum of strife, conflicts contention, dissension. Defined as a strong ongoing conflict over a fundamental issue. Strife is deeper than argument, broader than disagreement, it involves bitterness and sometimes violence. Strife among believers stains the testimony of the church and brings dishonor to the name of Christ.",
        "Discussion_title": "Causes of Strife and Conflicts. Understanding the root causes of conflict is essential to avoiding and solving it.",
        "DISCUSSION": [],
        "CONCLUSION": "Strife can become a canker worm that can eat deep into the unity, growth and peace of homes, church and relationships. The good news is that, it can be avoided and resolved when we understand its causes. May God help us to be conscious and watchful of these pointers in Jesus name!"
    },
    {
        "date": "November",
        "week": 2,
        "title": "STRIFE AND CONFLICTS",
        "subtitle": "PURPOSE OF STRIFE AND CONFLICTS ",
        "scriptures": [
            "Genesis 26:19-33"
        ],
        "memory_verse": "2 Timothy 2:24-25 (KJV)  And the servant of the Lord must not strive; but be gentle unto all men, apt to teach, patient, In meekness instructing those that oppose themselves; if God peradventure will give them repentance to the acknowledging of the truth;",
        "objective": "To understand that strife and conflicts are inevitable in our lives",
        "INTRODUCTION": "Even though believers in the world today are ensconced in the love of God through salvation, however, strife can arise, conflicts are bound to happen. Obedience to the word of God offers great help to believers in situations of strives and conflicts.",
        "Discussion_title": "Strife and Conflicts are bound to occur among people but believers should have an understanding that it's for a purpose",
        "DISCUSSION": [],
        "CONCLUSION": "Whatever God allows in the life of a believer, especially strives and conflicts, He makes appropriate provision and grace to overcome and come out victorious to the glory of His name"
    },
    {
        "date": "November",
        "week": 3,
        "title": "STRIFE AND CONFLICTS",
        "subtitle": "BIBLICAL STEPS TO RESOLVING STRIFES AND CONFLICTS ",
        "scriptures": [
            "Matthew 18:15-17"
        ],
        "memory_verse": "Eccl. 12:13 - Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man.",
        "objective": "To understand God's position in every strife and conflicts",
        "INTRODUCTION": "The Bible has already established the fact that strife can arise either to us directly, as a group or among people we are leading or associated with, How we navigate through is essential in our Christian life and growth",
        "Discussion_title": "As ambassadors of peace, there is no better way to learn peacemaking than from the embodiment of peace Himself - Jesus Christ.",
        "DISCUSSION": [],
        "CONCLUSION": "One of the major and fundamental way of showing or expressing our Love to God, is through obedience to His Word as documented in the Bible and as Led by the spirit of God, may God Open Our eyes of understanding to things we need to do in order to avoid or manage conflicts in Jesus Name"
    },
    {
        "date": "November",
        "week": 4,
        "title": "STRIFE AND CONFLICTS",
        "subtitle": "BENEFITS OF WELL MANAGED STRIFES AND CONFLICTS",
        "scriptures": [
            "Genesis 13:5-9"
        ],
        "memory_verse": "2 Cor. 13:11 Finally, brethren, farewell. Be perfect, be of good comfort, be of one mind, live in peace; and the God of love and peace shall be with you.",
        "objective": "To understand and appropriate the Benefits of a well-managed Strife and Conflicts",
        "INTRODUCTION": "Managing strife effectively can lead to numerous positive outcomes, both on a personal level and within the broader context of communities and organizations",
        "Discussion_title": "The benefits of strife properly managed ",
        "DISCUSSION": [],
        "CONCLUSION": "Managing conflict successfully isn't almost about ending the disputes, but changing conflicts into opportunities for development, understanding, and improved relationships. We will encounter these significant benefits and cultivate a more tranquil and profitable environment by tending to conflicts with wisdom, lowliness, and a commitment to reconciliation. Remember it is God's desire"
    },
    {
        "date": "December",
        "week": 1,
        "title": "KEEP YOURSELF PURE",
        "subtitle": "A COMMAND OR AN ADVICE",
        "scriptures": [
            "1 Timothy 4:11-12;1 Timothy 5:22"
        ],
        "memory_verse": "Matt 5:8 - Blessed are the pure in heart: for they shall see God",
        "objective": "To understand what purity is",
        "INTRODUCTION": "Purity is a quality of being clean, faultless, holy, blameless, uncompromised or unadulterated, and without evil thought or action. It also connotes holiness in the body and mind. A pure life is one in which sin no longer determines the choice one makes. Purity is important to God who alone is truly pure and holy. Therefore, He demands practical purity from every believer. Without holiness (purity) no man shall see God. Heb. 12:14.",
        "DISCUSSION": [],
        "CONCLUSION": "Purity is a command from God which believers must attain."
    },
    {
        "date": "December",
        "week": 2,
        "title": "KEEP YOURSELF PURE",
        "subtitle": "STEPS TO A LIFE OF PURITY",
        "scriptures": [
            "1 Peter 1:13-16"
        ],
        "memory_verse": "Psalms 18:26 - With the pure thou wilt shew thyself pure; and with the froward thou wilt shew thyself froward",
        "objective": "To understand the privilege of the call to a life of purity",
        "INTRODUCTION": "Seeking purity in this world seems you are kicking against the tide of popular opinion. Pure living does not only benefit the believers' life but also adds values to our society as whole. Believers should not underestimate its value and the negative consequences of impurity",
        "Discussion_title": "The following are the steps to a life of purity:",
        "DISCUSSION": [],
        "CONCLUSION": "Believers should persevere, keep moving in living a life of purity, it is worth the effort."
    },
    {
        "date": "December",
        "week": 3,
        "title": "KEEP YOURSELF PURE",
        "subtitle": "THE WAR AGAINST PURITY",
        "scriptures": [
            "Hebrews 10:22"
        ],
        "memory_verse": "Rom. 12:1 - I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service",
        "objective": "To understand the challenges of living a pure life.",
        "INTRODUCTION": "God created human beings to reflect His image and to live in pure, holy and unbroken communion with Him. However, sin is the corruptor of purity. Christians must be aware of different ways the devil is working against living a pure life. ",
        "Discussion_title": "Below are waging war against purity:",
        "DISCUSSION": [],
        "CONCLUSION": "When our hearts are clouded with impurities, we cannot experience God's presence."
    },
    {
        "date": "December",
        "week": 4,
        "title": "KEEP YOURSELF PURE",
        "subtitle": "LIVING AND KEEPING A LIFE OF PURITY",
        "scriptures": [
            "Psalms 18:20-26"
        ],
        "memory_verse": "Psa. 24: 3-4 - Who shall ascend into the hill of the Lord? or who shall stand in his holy place?  He that hath clean hands, and a pure heart; who hath not lifted up his soul unto vanity, nor sworn deceitfully",
        "objective": "To learn and understand the benefits of purity",
        "INTRODUCTION": "In order to have fellowship with a holy God, we must reclaim the purity that He originally intended for us. Once we have been born again through faith in Jesus, God desires that we should live purely in all our dealings with Him and men",
        "Discussion_title": "Benefits of keeping a life of purity:",
        "DISCUSSION": [],
        "CONCLUSION": "Benefits of living a pure life cannot be overemphasized. Holiness must be our lifestyle."
    }
]